program(1.3)
[buildInfo = dict<string, string>({{"coremlc-component-MIL", "3510.2.1"}, {"coremlc-version", "3500.32.1"}})]
{
    func main<ios19>(tensor<fp32, [1, 128]> x) {
            tensor<fp32, [128, 128]> w_0 = const()[name = string("w_0"), val = tensor<fp32, [128, 128]>([[0x1.d152cap+0, -0x1.0db4c4p+1, -0x1.82a208p+0, 0x1.a4f676p+0, -0x1.c1d0acp-1, -0x1.1298c8p+1, -0x1.ea7408p+0, 0x1.1fb798p-2, -0x1.60722ep-1, 0x1.b45fdp-1, -0x1.178888p+0, -0x1.fe709ap+0, -0x1.dbaf6p-1, 0x1.5c9978p+0, 0x1.0bd21p+0, -0x1.12f6cp+0, 0x1.d2c85ap+0, -0x1.d66eaep+0, -0x1.9eeb7ap+0, 0x1.bee756p-1, -0x1.26edacp-1, -0x1.66802cp-4, -0x1.ef0d5ap+0, -0x1.a00bd2p+0, 0x1.a9b968p+0, -0x1.d1940ap-1, -0x1.c32328p+0, 0x1.e314eap-3, -0x1.3600fap-3, -0x1.ecf826p-2, 0x1.37661p+0, -0x1.8b849cp+0, 0x1.60af98p+0, -0x1.f1da7p+0, -0x1.fa6cc6p+0, 0x1.10f7dep+0, -0x1.b760b6p-1, 0x1.93f136p-1, 0x1.323834p-4, 0x1.501618p+0, 0x1.ee534p-1, -0x1.8e487p+0, -0x1.d014a8p-5, 0x1.8a741cp+0, -0x1.cbe4a4p+0, 0x1.3c71bp+0, 0x1.99272ep-1, -0x1.e43c1p+0, 0x1.d167aap-5, 0x1.90d9aep-1, 0x1.f844e2p+0, 0x1.3c6a2cp+0, -0x1.90f25ap+0, 0x1.f6e8e8p-7, -0x1.bb28bep+0, -0x1.cd007cp-4, 0x1.8757cap+0, -0x1.136a16p-2, -0x1.68389ap-1, 0x1.41cf6p-2, 0x1.35a0f8p+0, -0x1.903a38p+0, 0x1.0407e4p+0, -0x1.5d203cp-1, -0x1.7688eep+0, 0x1.86c2b4p-2, -0x1.017fcp+1, 0x1.ec6d14p-1, -0x1.7bbd8cp-2, 0x1.110538p-1, -0x1.125724p+1, 0x1.ce88b2p-1, 0x1.7b2586p+0, -0x1.58e122p-4, -0x1.d4715cp-1, -0x1.4a7078p-3, 0x1.469b72p-3, 0x1.91c0acp+0, -0x1.aa6de4p+0, -0x1.d7463cp+0, 0x1.05292ap+1, 0x1.b1cea8p-2, 0x1.e2cc76p+0, 0x1.4ac644p-2, 0x1.322dcp-1, 0x1.1c10d2p+0, -0x1.6ebc14p+0, 0x1.488444p-4, 0x1.7dcdacp-2, -0x1.f587b8p+0, -0x1.613a86p+0, 0x1.767ccap-3, -0x1.ae8792p-2, -0x1.3d010cp-1, -0x1.50e642p+0, -0x1.07ce4p+1, 0x1.8fec98p+0, -0x1.34aa1ep-1, -0x1.462e96p+0, 0x1.f5744ep+0, -0x1.de6046p+0, 0x1.b3f822p-1, -0x1.352fe6p+0, -0x1.f68688p-6, 0x1.e48ea4p-1, -0x1.816e04p+0, 0x1.bfdc2cp+0, 0x1.447d18p+0, 0x1.5c7884p+0, 0x1.3f194p+0, 0x1.b9f7b2p-1, -0x1.3a6dbap-1, -0x1.1670fcp+0, -0x1.b0c182p-2, 0x1.3490fp+0, 0x1.d70f16p+0, 0x1.970b98p+0, -0x1.6f8c46p-2, -0x1.15d1b6p-1, -0x1.a498bp+0, -0x1.b5eb7cp+0, 0x1.3b5d56p-1, -0x1.4c093p+0, 0x1.bfd09p+0, -0x1.6a0cc2p+0, -0x1.d447aap+0, 0x1.fb566ep-1, -0x1.833582p-2], [0x1.5cc0b6p-1, 0x1.86f4a4p+0, -0x1.3f674cp-1, -0x1.c599a4p+0, -0x1.d34a6ap+0, -0x1.12b6e2p+0, -0x1.e10e2cp+0, -0x1.3aea5ep-1, 0x1.232c5cp+0, -0x1.53f202p-2, -0x1.ff5194p-1, 0x1.c62a4p+0, -0x1.a02344p+0, 0x1.29195ep+0, 0x1.9a77acp+0, 0x1.b1d72p-3, -0x1.fd7b8p+0, 0x1.04fc42p-1, -0x1.da1314p+0, 0x1.a5690ep-2, -0x1.468406p+0, 0x1.0238e2p+1, -0x1.f9185ep-1, 0x1.459dfep+0, 0x1.ad0cb2p-1, 0x1.977f42p+0, -0x1.c35deap-3, 0x1.da179ep+0, 0x1.c6d4fcp-1, 0x1.b5d624p+0, -0x1.753dbcp+0, 0x1.11276p+0, 0x1.a3d296p+0, 0x1.568b8p-1, 0x1.a5ce5ep+0, 0x1.8f6196p+0, 0x1.d7c54ep-1, -0x1.7581b8p+0, -0x1.c175e2p-2, 0x1.4dedap+0, 0x1.1c66b4p+0, -0x1.cf5382p-1, 0x1.933358p+0, -0x1.79ced6p+0, 0x1.10994ap+1, 0x1.08e3a8p-3, -0x1.56215ep+0, 0x1.109a44p+0, -0x1.c0e066p-1, 0x1.fd3ceep+0, -0x1.767414p+0, 0x1.ec5dc8p+0, 0x1.a6ed6cp-4, 0x1.efbe22p-1, 0x1.083e66p+1, -0x1.0f8c72p+1, -0x1.b5d3c8p-3, 0x1.02b476p+1, 0x1.223ff8p-4, 0x1.139ccap-1, -0x1.c7248ap-2, 0x1.1f83d6p+0, 0x1.07a8a4p+1, 0x1.15e7bcp-1, -0x1.09cbc8p+1, -0x1.989958p+0, -0x1.0a9584p+0, 0x1.470456p+0, -0x1.6aa798p-3, -0x1.61f26ap-1, 0x1.b5851cp+0, -0x1.747288p-1, 0x1.f8c814p+0, -0x1.6b632cp+0, 0x1.dd5208p+0, 0x1.59170cp+0, -0x1.590fc6p+0, -0x1.12e69ep+0, 0x1.5a9df8p-3, -0x1.b9589ap-4, 0x1.87f0f4p-1, -0x1.f60448p+0, 0x1.2acb22p+0, -0x1.62641cp-2, -0x1.13cc1p+0, -0x1.2f19c8p+0, 0x1.84e542p+0, -0x1.76a38ep-4, 0x1.c5e452p-2, 0x1.32e49p+0, -0x1.bc50e6p-2, 0x1.98d314p-2, 0x1.753be8p+0, -0x1.ad6dc8p-4, -0x1.0c6312p+0, -0x1.fbf5bcp-2, -0x1.844d64p-1, 0x1.523f9p+0, -0x1.0834dep+0, -0x1.28c39cp+0, 0x1.fcbaep-4, 0x1.e5c6eap-2, -0x1.119c64p+1, -0x1.0cf084p-3, -0x1.7e4edcp+0, -0x1.c331bap+0, 0x1.720ca4p-2, -0x1.1a06b2p+0, 0x1.fe877cp-1, 0x1.6c7c9ap-2, 0x1.37dc9ap+0, -0x1.6889bap-1, -0x1.00d12ep-1, 0x1.6e0598p+0, 0x1.9d453ap+0, -0x1.6e74eap-3, -0x1.a0b3a2p-1, 0x1.f3e122p-7, 0x1.946b12p-1, -0x1.40f366p-1, -0x1.7c685ap+0, 0x1.40a72cp+0, -0x1.a9173ap+0, 0x1.959e4ep+0, -0x1.07e562p+0, 0x1.e1672cp-7, 0x1.4660dp-4, 0x1.20368cp+0], [0x1.33128cp-1, -0x1.ee26f4p-1, 0x1.e49c52p+0, 0x1.65af3cp+0, -0x1.d5da3cp-3, 0x1.b58d4ap+0, -0x1.50dc3p-2, 0x1.872062p+0, -0x1.c2ac54p-1, -0x1.26766cp-5, 0x1.c7edb2p+0, -0x1.6c2c68p-2, 0x1.3204aep+0, -0x1.622798p-2, 0x1.c6cd56p-1, 0x1.07fbeep-2, 0x1.2f0f54p+0, 0x1.52f2fcp+0, -0x1.f6a4a8p+0, -0x1.e3da66p+0, 0x1.3695aep-1, -0x1.8ffadep+0, 0x1.b477e2p-1, -0x1.e44986p+0, -0x1.ec1ec4p-1, 0x1.8cfb06p-2, 0x1.c20866p+0, -0x1.d1bbd8p-2, -0x1.8a56d4p-7, 0x1.be5c62p+0, -0x1.055c54p+0, -0x1.525a7p+0, 0x1.e200ap-1, -0x1.e366eep+0, 0x1.8559b8p-2, -0x1.a5344p-2, 0x1.8eda8ap-2, 0x1.abcbb8p-1, 0x1.652ca6p-2, 0x1.9ceaa4p+0, 0x1.8ae42ap+0, 0x1.2b2348p-2, 0x1.2a6098p+0, 0x1.09b8c8p+1, -0x1.0ee87ap+1, 0x1.750b04p-1, -0x1.e973a2p+0, -0x1.296b0cp+0, 0x1.459f34p+0, -0x1.97346ep-2, 0x1.063f9ep-1, -0x1.0bb51p-1, 0x1.22506p+0, -0x1.a9de26p+0, -0x1.e4b9ccp-1, -0x1.5fbf5ap-1, 0x1.871ffp+0, 0x1.7cdf24p-1, 0x1.0f5184p-2, -0x1.964788p-3, 0x1.ceaa56p+0, -0x1.cc911cp+0, -0x1.39cf4ep-1, -0x1.d739f8p-1, -0x1.47ff1ap-2, 0x1.9e3a32p+0, -0x1.00c7c6p+1, 0x1.06aeb4p+1, -0x1.926e1ep+0, 0x1.110cb4p+1, 0x1.d76b54p+0, -0x1.532f9cp-2, -0x1.cb74ap+0, 0x1.8197f4p+0, -0x1.9ba9f4p-1, -0x1.5207b2p+0, 0x1.370d92p-1, -0x1.e5369ep+0, 0x1.a19ff2p+0, 0x1.38d4f4p+0, -0x1.4bdb84p-2, -0x1.7e6a0ep-1, 0x1.bd1f92p+0, -0x1.22a6p-2, 0x1.3d1956p+0, 0x1.aa300ap+0, 0x1.39e408p+0, -0x1.f3296ap-2, 0x1.afbe02p+0, 0x1.1cf056p-1, -0x1.ec70d6p-3, -0x1.316e0ap+0, 0x1.058b28p+1, 0x1.be6738p-1, 0x1.f51f38p+0, -0x1.dc313p-2, 0x1.3f0118p-1, -0x1.c028d8p-3, -0x1.260ffp+0, 0x1.e1ce54p+0, 0x1.11d08p+0, -0x1.47709cp+0, -0x1.606e72p-1, -0x1.8287dcp-2, -0x1.f4ef46p+0, 0x1.0b6c58p+0, 0x1.9cd1dap-3, -0x1.96cc32p-2, 0x1.1d8388p-1, 0x1.3d60a2p+0, 0x1.b324f2p-3, -0x1.f8e266p-1, -0x1.76e22p-1, -0x1.6f19a6p+0, 0x1.f3caf2p+0, 0x1.ab8ff4p-2, -0x1.cf7522p-3, -0x1.b593c2p-1, 0x1.86b614p+0, 0x1.9535dcp-1, 0x1.e96fb8p-4, 0x1.18c87p-1, 0x1.d86b9p+0, -0x1.9cb306p-6, -0x1.f989bp+0, -0x1.5a4c1ep+0, -0x1.7a3346p-2, 0x1.4af47ap-2], [0x1.06d21ap+1, -0x1.26374cp+0, -0x1.547aaep-1, 0x1.806fe6p-2, -0x1.abb858p+0, 0x1.cca292p+0, 0x1.1249c4p-2, 0x1.d2852p+0, 0x1.6e3facp+0, 0x1.2cc3f8p+0, 0x1.7895e6p-1, -0x1.65543ep-2, 0x1.d60fc2p+0, 0x1.af0fe4p+0, 0x1.93d8a8p-5, 0x1.5e9634p+0, -0x1.688ebap-1, -0x1.dde954p+0, 0x1.a9b04cp-1, -0x1.a830fcp-1, 0x1.175beap+0, 0x1.89915ap-2, -0x1.2bd5d8p+0, 0x1.12a96p+1, -0x1.ad7ebep+0, -0x1.6d90acp-1, -0x1.880d28p+0, 0x1.10fb54p+0, 0x1.aa3b94p+0, -0x1.02391cp+1, -0x1.b77692p-1, 0x1.d81ee4p+0, -0x1.dc042ep+0, 0x1.c83cfcp-5, -0x1.2ca198p-1, 0x1.dbe46cp-4, -0x1.b216f8p-5, -0x1.479822p+0, -0x1.481bcap+0, -0x1.2c76dep+0, -0x1.086ab2p+1, 0x1.ec9ebp-3, -0x1.6cb27cp-1, -0x1.76da5cp-2, 0x1.b45524p-1, -0x1.40182p+0, -0x1.fd014ap-1, 0x1.0ec826p+1, -0x1.4569ecp-3, -0x1.5c0d3ep+0, 0x1.f1371ep-1, -0x1.d44e86p-2, -0x1.1d2a16p-2, -0x1.62ebdcp-1, -0x1.1c8dc8p-1, 0x1.7c69f2p+0, 0x1.0f44d2p+1, 0x1.502aep-1, -0x1.5be8cp+0, 0x1.9c12cp+0, -0x1.edaf3cp-1, 0x1.ac494ap-2, 0x1.0210bp+0, 0x1.7cbc4cp+0, 0x1.912cb4p+0, 0x1.8e9392p-1, 0x1.b9ad72p+0, 0x1.ba1f3cp+0, 0x1.9f669ap-2, -0x1.21bfccp-2, 0x1.2e196ep+0, -0x1.e0d538p-2, -0x1.038ae2p+0, 0x1.3ce42ap+0, 0x1.7d8906p+0, -0x1.448878p+0, 0x1.57b3f2p+0, -0x1.871ec8p+0, -0x1.0e2064p+1, 0x1.acff26p+0, -0x1.018edp+1, -0x1.d7c012p-1, 0x1.40ccep-3, -0x1.a9276ap-2, -0x1.511fd4p-6, 0x1.0ad26ep+1, -0x1.9939b4p+0, 0x1.5f373cp+0, 0x1.8176dap-1, -0x1.ca7be2p+0, 0x1.5c9894p-1, -0x1.3b0e06p+0, -0x1.fa9ceep+0, -0x1.b71d3ap+0, -0x1.a9f5p+0, 0x1.b42272p-1, -0x1.4c307ep+0, 0x1.b94e2p+0, 0x1.84555p+0, -0x1.c63d8ap+0, -0x1.a1fd26p-2, 0x1.a5fde6p+0, -0x1.be5e18p+0, 0x1.78679ep+0, -0x1.c186e2p+0, -0x1.d8457p+0, 0x1.c50614p+0, -0x1.6ae58ep+0, -0x1.60020ap+0, 0x1.de45ap-1, 0x1.eeb93ap+0, -0x1.b6e95ap-1, 0x1.da0448p-1, -0x1.77f55ap+0, 0x1.eabfc2p-1, -0x1.ceb9b4p-5, -0x1.bcbc12p+0, -0x1.2b59f6p-1, -0x1.c9ed9cp+0, -0x1.287584p-1, -0x1.0f0caap-1, 0x1.11a864p+1, 0x1.fbc7f6p-1, 0x1.0bfca6p+1, 0x1.cb0a9ep-3, -0x1.d028bp+0, 0x1.91068cp-1, -0x1.68424p-1], [0x1.716ef6p-1, 0x1.f3bb94p+0, -0x1.ff5154p-2, -0x1.a1197ep+0, 0x1.0de66ep+0, 0x1.d2efa6p+0, 0x1.0e9ab2p-2, 0x1.cb38ecp+0, 0x1.a8d7a8p-1, 0x1.d045a6p+0, 0x1.96be76p-2, -0x1.6b0192p-2, -0x1.0d58b4p+0, 0x1.acbd32p+0, 0x1.b3f6b8p-1, 0x1.cdcde6p-1, -0x1.a354c8p-2, -0x1.3cc5e2p+0, -0x1.ca4716p-4, 0x1.95b284p-1, -0x1.0d659p-1, 0x1.45c104p+0, 0x1.7c0e56p-4, 0x1.71226cp+0, -0x1.221a28p-1, 0x1.62a074p+0, 0x1.70cd16p+0, 0x1.348faap+0, 0x1.359502p-4, -0x1.b87a9ap+0, 0x1.5a74a6p-5, 0x1.ab197ep+0, -0x1.18434p+0, 0x1.db3892p-1, -0x1.a3712p+0, -0x1.f3840ep+0, -0x1.0327cep+0, 0x1.00fb6p+1, 0x1.cf70a6p+0, -0x1.462976p-1, -0x1.a5e40cp+0, -0x1.cb7762p+0, -0x1.fc4532p+0, 0x1.098e42p+0, -0x1.0e5304p-3, 0x1.210cfcp+0, 0x1.33c17cp+0, 0x1.ef5ceap-2, -0x1.1f69d6p-1, -0x1.257744p-1, 0x1.9145c4p-1, 0x1.8c040ep+0, 0x1.e15ebcp+0, -0x1.2ad80cp-1, 0x1.c80b14p-2, -0x1.9e83d2p+0, -0x1.cc0782p+0, 0x1.7963c8p+0, 0x1.70a74cp+0, -0x1.cc8172p-2, 0x1.405204p+0, -0x1.7923f2p+0, -0x1.0237f8p+1, 0x1.d1cf8ap-3, 0x1.7232e6p+0, 0x1.14ed2ep-3, -0x1.13eb24p-1, -0x1.fafd52p-1, 0x1.1803c8p+0, -0x1.3f1becp-1, 0x1.a8ef5ep-2, 0x1.053214p-1, -0x1.10a19ap+0, -0x1.0ae982p+1, 0x1.a936a2p+0, -0x1.1bb58p+0, -0x1.f7d1a2p-2, 0x1.fcdaf8p+0, -0x1.11e1ap+1, -0x1.71bc8ap-1, -0x1.1aa174p-3, -0x1.5cff9ap+0, 0x1.d29b92p+0, -0x1.e36886p+0, -0x1.2f4434p-1, -0x1.0d63bap+0, 0x1.464484p+0, 0x1.ae61a4p-1, -0x1.944e1cp-4, -0x1.d4f15p-1, 0x1.d2f4e4p-2, -0x1.1d19eep+0, -0x1.ce8edap-1, 0x1.fb1e34p+0, 0x1.acbbe6p-1, -0x1.c215fep-2, 0x1.8e22ap-1, 0x1.980142p-1, 0x1.d45d44p+0, -0x1.6cfecep+0, 0x1.62a5bep+0, 0x1.3f1c06p+0, 0x1.e7d0eap+0, -0x1.807b9ap+0, 0x1.36b21ep+0, 0x1.2b1398p-5, -0x1.a1f41cp-1, 0x1.6b8f82p+0, -0x1.f42ecap+0, -0x1.fb0224p-2, -0x1.a2e1bcp-2, -0x1.439df6p-3, -0x1.1005b6p+1, -0x1.4b7748p+0, 0x1.f2115p+0, 0x1.020f4ep+0, 0x1.b2392p-3, -0x1.48f894p-3, 0x1.b0b27ap-2, 0x1.8dac82p-3, -0x1.83ff3ep+0, -0x1.6987fap-1, 0x1.a6ee54p+0, -0x1.5df95cp-1, -0x1.08d976p+1, -0x1.cb9e96p-1, -0x1.86db7p+0, 0x1.3cca78p-1], [0x1.a00f28p-2, -0x1.3650d6p+0, -0x1.f64848p+0, -0x1.234814p-1, 0x1.f3ce02p-4, -0x1.94aa5ap-1, 0x1.a925c8p-2, 0x1.a53a2cp-1, 0x1.23a224p-2, -0x1.5d6d64p-1, -0x1.a0c7d8p-1, -0x1.3efc2ap-1, -0x1.fe9576p-1, -0x1.fe764p-3, -0x1.96477p-1, -0x1.e75fa4p+0, -0x1.49282ap-1, 0x1.ac01aep-3, -0x1.fa63b8p-3, -0x1.fd072p+0, 0x1.49b1e4p-5, 0x1.1705cp-1, -0x1.0e5abep+0, -0x1.5cafccp-1, -0x1.aafe22p-1, 0x1.ac7e7ep+0, 0x1.a6a148p-1, -0x1.a8adp+0, 0x1.91282ap+0, 0x1.5ba92cp-2, 0x1.b1142ep+0, -0x1.0cbe98p-4, 0x1.c71b56p+0, 0x1.fc8b48p-5, -0x1.470562p-2, -0x1.12daf2p-4, 0x1.b21104p+0, -0x1.2dbc1ep-2, 0x1.a2e87ep-4, -0x1.5f268cp-2, 0x1.cabe12p+0, -0x1.567c0cp+0, -0x1.530d2p+0, 0x1.aae8d4p-1, 0x1.6f0eep-2, -0x1.d5e10ap+0, -0x1.27868ep-1, 0x1.4d94eep+0, 0x1.79bed4p-3, -0x1.5f0374p+0, -0x1.c0ad22p-2, -0x1.723cecp-1, 0x1.ad3ae8p+0, -0x1.1bc6acp-2, -0x1.304e1ep-2, -0x1.06112p+1, -0x1.cf4c1ep+0, -0x1.7371e6p+0, 0x1.0c6b9cp+0, -0x1.04a518p+0, -0x1.02992ep+1, -0x1.cb7602p+0, 0x1.a092c6p-1, -0x1.53fec6p+0, -0x1.97cd6ap-2, -0x1.7339a8p-2, -0x1.7b57ccp+0, 0x1.4db918p-2, -0x1.e4ea34p+0, 0x1.24e0a8p-1, 0x1.001acp-5, 0x1.dd0fb4p+0, 0x1.615c9ap+0, -0x1.a8488p-1, -0x1.0de97ap+1, 0x1.df072p+0, -0x1.0765a2p+1, 0x1.0884b4p+1, -0x1.5d496ap-1, 0x1.181d96p+0, 0x1.91907cp+0, -0x1.31728cp-1, 0x1.031114p+1, -0x1.e066ap+0, 0x1.ad220ep-1, 0x1.242e9p+0, 0x1.c6ae9ap-1, -0x1.bca432p+0, -0x1.63f6acp-2, 0x1.a25b8cp-2, 0x1.06282ap+1, -0x1.1d32acp-2, 0x1.63867cp+0, -0x1.efdc48p-1, 0x1.a38dp-8, -0x1.be2d68p+0, -0x1.55cd2ep-5, -0x1.103b86p+1, 0x1.d135a4p+0, -0x1.845a08p+0, -0x1.2ce722p-1, -0x1.025352p-4, -0x1.43a082p-3, 0x1.65c5fp+0, -0x1.494a1cp-1, 0x1.0050a2p+1, -0x1.305728p-1, 0x1.f44148p-2, -0x1.84b7c2p+0, 0x1.e9b56p+0, -0x1.7b403p-1, -0x1.4d49a4p-7, 0x1.f43326p-1, 0x1.435fb6p-1, -0x1.3461dap-1, -0x1.ade4f4p-1, -0x1.1b1ca6p-3, 0x1.1fc046p-1, -0x1.093826p+0, -0x1.d091eap+0, 0x1.a012fcp-7, -0x1.b05d4ap+0, 0x1.80c4d8p-1, 0x1.04907cp+0, -0x1.f37facp+0, 0x1.4e2aap-4, 0x1.6edaa4p-3, 0x1.0a1922p+1], [0x1.22ff0ap+0, 0x1.5091b4p+0, 0x1.945404p-3, -0x1.e9e6ccp-1, 0x1.56b6dp+0, -0x1.f9d0b4p-1, -0x1.455edp-1, -0x1.bd3d8ap-1, -0x1.1b17aep-1, -0x1.458f54p+0, -0x1.fd028ep+0, 0x1.0fa0e4p+1, 0x1.58bcecp-3, -0x1.2b7ecep-7, 0x1.977c14p+0, -0x1.328874p+0, -0x1.3adccp+0, -0x1.9b52a2p+0, -0x1.fb7a24p+0, 0x1.665492p-2, 0x1.96b2d2p-1, -0x1.11b606p+1, -0x1.f4712ap-1, 0x1.7bb7a6p+0, 0x1.d1259cp-2, -0x1.76ee7ap-1, 0x1.5218c4p-1, 0x1.24f4bp+0, -0x1.064f6p+0, 0x1.df388ap-2, 0x1.0f5708p+0, 0x1.2f0166p-3, -0x1.402c46p+0, 0x1.410f18p+0, -0x1.7d3458p+0, -0x1.defa42p-1, -0x1.c4e5e6p+0, -0x1.58bd0ap-1, -0x1.ef0916p-2, -0x1.93d138p+0, -0x1.9ffb4p+0, -0x1.59f766p+0, 0x1.588b82p+0, 0x1.0198f2p-4, -0x1.a5a33p-1, 0x1.ae97a6p+0, 0x1.f01a28p-1, 0x1.1a2f78p+0, -0x1.0e215ap+0, -0x1.5124a8p-3, 0x1.203aeep+0, 0x1.05a5d2p+1, -0x1.7715cp+0, 0x1.d5351p-1, -0x1.1966bcp-1, -0x1.fe2d74p+0, -0x1.16ee46p+0, -0x1.f1610ap-1, 0x1.c1cb2p-3, 0x1.1b7958p-6, -0x1.05727ap+1, -0x1.0546bcp-2, 0x1.7d13c4p+0, 0x1.7f3d6ap-2, -0x1.dc42ecp-1, -0x1.7d5464p-2, -0x1.beb5fp-3, -0x1.dd6b5cp-1, 0x1.d25b82p-1, 0x1.065ed8p-4, 0x1.706cfep+0, -0x1.9588ep-1, -0x1.b16cep-1, -0x1.d940cp-1, -0x1.97f982p+0, 0x1.0adb68p+0, -0x1.b15874p-1, 0x1.0cd34ep+1, -0x1.066832p+0, -0x1.1e4a4ep-2, 0x1.388f1ap-1, -0x1.7604e8p+0, 0x1.a80ae8p-2, -0x1.f20fap+0, 0x1.fbbf0ap+0, 0x1.c54228p+0, 0x1.20cb8cp+0, -0x1.3034dap+0, 0x1.3825d4p+0, 0x1.15055cp+0, 0x1.e05b22p-6, -0x1.3269bp+0, -0x1.83f59ep-3, 0x1.90624ep+0, -0x1.16b622p-2, -0x1.0bf3a6p-2, 0x1.2e4a0ap+0, 0x1.40504p+0, -0x1.da08b8p+0, -0x1.7137f8p+0, 0x1.d83d5ep+0, -0x1.be6fa8p+0, 0x1.b84cep+0, 0x1.df22f6p-1, -0x1.dad204p+0, 0x1.026bd6p+1, -0x1.1c895cp-1, 0x1.7702cap-2, -0x1.6e2236p-1, 0x1.1b48aep-2, 0x1.b72a4cp-1, 0x1.b27178p-9, 0x1.05f658p+1, -0x1.9d333p-3, 0x1.82c43cp-1, 0x1.20a602p+0, 0x1.c1a2fap-1, 0x1.bf4f38p+0, 0x1.45fb9cp+0, -0x1.0d025p+0, 0x1.94082ap-1, 0x1.cd6aa2p+0, -0x1.3f52aep-1, 0x1.fb5806p-7, 0x1.19627ep-2, 0x1.8816f2p-1, -0x1.b13468p-2, 0x1.093ccap+0], [-0x1.fddbe6p-2, -0x1.fb7bccp-1, -0x1.9fc594p-1, 0x1.f01b66p-2, 0x1.217b44p-2, 0x1.99bd72p-1, -0x1.fbee02p+0, -0x1.3e7ad6p-5, 0x1.00f5c8p-1, 0x1.5b0296p-1, -0x1.55f072p+0, 0x1.0d71c4p+1, -0x1.0a19d4p+1, -0x1.754e78p-5, -0x1.ad09fep+0, 0x1.72e3ap+0, -0x1.9fd482p+0, -0x1.780af6p-1, -0x1.7d011p-3, -0x1.6bc3e4p-2, 0x1.f2224p+0, 0x1.23705ap+0, -0x1.87aadcp-1, 0x1.dece5p+0, -0x1.8d4c9ep-1, -0x1.ec96f4p-3, 0x1.d7e7c6p+0, 0x1.995764p-3, -0x1.b9981p-1, 0x1.2a9bfep+0, 0x1.81f0d2p-2, -0x1.51da1p+0, 0x1.9e1876p+0, 0x1.b6974p-1, -0x1.9ea17ep-2, -0x1.ee242cp-1, -0x1.67ae64p-1, -0x1.a6172ap-2, -0x1.eafdd2p-4, -0x1.6a9a9ap+0, -0x1.d2b02p+0, 0x1.cc43cap+0, 0x1.4e90cep-3, -0x1.1228a8p+1, 0x1.2b4af2p+0, -0x1.1c56e8p-1, -0x1.0647cep-2, 0x1.b44918p+0, 0x1.a74cb6p+0, -0x1.323d28p-3, 0x1.d0513ap+0, -0x1.5828cp-2, -0x1.882074p+0, 0x1.5b09fep-1, -0x1.eded2ep-3, -0x1.7ac5bp+0, -0x1.6d5fe8p-3, -0x1.ce8e4p+0, -0x1.5d4654p+0, -0x1.d30636p+0, 0x1.37cec4p-2, 0x1.5fc172p-2, 0x1.4b4ecp+0, 0x1.ccae7p+0, -0x1.f14e2ap+0, -0x1.806a1cp+0, 0x1.09e446p+1, 0x1.8a5672p-3, 0x1.101588p+1, 0x1.763f56p+0, 0x1.4c4588p+0, 0x1.0950dep+1, 0x1.ded83ep+0, 0x1.1147a2p+0, -0x1.f40edcp+0, 0x1.37ce16p+0, -0x1.e28b58p+0, -0x1.06e884p-2, 0x1.8fd0f8p+0, -0x1.12a1d8p+1, -0x1.26eeeep-1, -0x1.470f5ep+0, 0x1.4ede16p-4, 0x1.9dcaa4p+0, 0x1.c77f0ep-3, 0x1.ae58d6p-1, -0x1.343b72p+0, 0x1.28d8eap-1, -0x1.2d5f96p-4, 0x1.6e252ap+0, 0x1.43211p-3, 0x1.a4f684p-3, -0x1.a8566p-1, -0x1.8c3072p-1, -0x1.0f5044p+1, -0x1.110096p+0, 0x1.55c5a2p+0, -0x1.85b57ep+0, 0x1.52014cp-3, -0x1.cda1c8p+0, -0x1.3bba3ep+0, 0x1.0bec16p+1, -0x1.eea154p-1, -0x1.76bc78p-3, 0x1.2310d8p-3, -0x1.c829d4p+0, 0x1.8801dcp+0, -0x1.b0e57cp+0, -0x1.c7d992p+0, 0x1.7e1262p+0, -0x1.9188a8p-1, 0x1.0e2dfep-2, 0x1.4fb19ep+0, -0x1.5b1eap+0, 0x1.61e6f2p-3, -0x1.105d9ap+1, 0x1.c7789p-1, 0x1.b058dep+0, -0x1.6b1572p-1, 0x1.a1bb4ap-2, 0x1.cde128p+0, -0x1.3f7dcap-2, -0x1.1b529ap+0, 0x1.0c1e7ap+0, -0x1.a19092p+0, 0x1.9704cp+0, -0x1.02646cp+1, 0x1.6a2da2p-2], [-0x1.97dcfep-2, -0x1.b2856ep+0, -0x1.1ffb34p-2, 0x1.a1e6fep+0, -0x1.30f048p+0, -0x1.36756ap+0, 0x1.2c83acp-1, -0x1.637782p+0, 0x1.b7bc4p+0, -0x1.6f5e2ap-1, -0x1.07571ep+0, 0x1.31efe6p+0, -0x1.0c21b2p+1, 0x1.09c3eep+1, -0x1.19163cp-1, -0x1.b43ec4p-1, 0x1.16af7ap+0, 0x1.bbc726p+0, -0x1.1829c2p+0, 0x1.498e38p+0, -0x1.cfc87ap+0, 0x1.bac942p+0, 0x1.ee24dcp+0, 0x1.0e666cp+1, -0x1.08642cp+1, -0x1.8074fap-2, -0x1.28d8c4p-4, -0x1.b30454p-2, -0x1.1283acp+0, 0x1.e0f79ep-1, -0x1.9b62eap+0, -0x1.f98ecap+0, -0x1.f8de52p+0, -0x1.6695c8p-1, -0x1.ebc53cp-2, 0x1.67883cp-2, -0x1.0931ccp+1, 0x1.ba0072p-4, -0x1.14d522p-2, -0x1.2f31f8p-1, 0x1.2f1122p+0, -0x1.107b5p-1, -0x1.5e0adp+0, 0x1.4ca4eep-1, -0x1.6f73dep+0, -0x1.dcc8ep+0, -0x1.7b311p-2, -0x1.65d9f2p+0, -0x1.115ef2p+1, -0x1.83f358p+0, -0x1.53130ap+0, 0x1.44a188p-1, 0x1.eb50bap+0, -0x1.c42dd6p-1, 0x1.7fddb8p-1, -0x1.34a854p-1, 0x1.a1b1bcp+0, -0x1.e25896p+0, 0x1.512e72p-2, -0x1.0e90fap+0, -0x1.5ad222p+0, -0x1.ee1466p+0, -0x1.26d396p-2, 0x1.eeabccp+0, -0x1.61cd28p+0, 0x1.07a72ap+0, -0x1.3c572cp-1, 0x1.081fe8p-1, -0x1.cc4e1p-1, -0x1.7b6de8p-2, -0x1.1a31b6p+0, 0x1.077f0cp+1, 0x1.6e34f4p-1, -0x1.de721p-2, -0x1.f37be2p+0, -0x1.e33cfp+0, 0x1.a67194p-1, 0x1.edc5d4p+0, 0x1.0b618ap-1, -0x1.d26d4ap-4, 0x1.060cf8p+1, -0x1.550012p+0, -0x1.d0949ep+0, -0x1.3420a4p+0, -0x1.d18c18p+0, -0x1.6b7c16p-2, -0x1.fce96p+0, 0x1.88d8bap+0, -0x1.ee4d0ep+0, -0x1.d4e70cp+0, 0x1.6dcbap+0, 0x1.2ff37ap-1, 0x1.d47b2cp-1, 0x1.806082p+0, 0x1.5ee6ap-1, -0x1.43ea3ap-1, -0x1.99447p-1, -0x1.c5cf58p-1, -0x1.c8fbb4p-2, 0x1.08a45ep+1, -0x1.a8c888p-1, -0x1.853246p+0, -0x1.4f21c2p-2, -0x1.7dee24p+0, 0x1.b7e08ap-3, 0x1.04c6a8p+0, 0x1.ddbc78p-3, 0x1.eabap+0, 0x1.944176p+0, 0x1.f7640ap+0, -0x1.6798a8p-1, -0x1.46dfa2p-6, -0x1.8db9a2p+0, 0x1.88556ap-2, 0x1.6b98c4p+0, 0x1.862de2p-2, -0x1.aac8dcp+0, -0x1.06fd6cp+0, 0x1.52124cp+0, 0x1.3f078cp+0, 0x1.1c2e8p-3, -0x1.8541cp+0, -0x1.d2b0e2p-5, 0x1.263dfcp+0, -0x1.773122p+0, 0x1.447674p+0, -0x1.0d2cd4p+0, -0x1.76dab4p-1], [-0x1.5bf66p+0, -0x1.6766a4p-5, -0x1.907348p-1, 0x1.666d1p-7, 0x1.687134p-3, 0x1.43a282p-5, 0x1.12b51ap+1, 0x1.cb42eep+0, -0x1.70d5e4p+0, -0x1.dacae2p-1, 0x1.2aac18p-2, -0x1.aa571ep-2, 0x1.0bd9d8p-4, 0x1.cb781p-3, -0x1.7ea242p+0, -0x1.83d66ap+0, -0x1.78baa4p-4, 0x1.91d9eep-3, 0x1.159914p+0, -0x1.b8743p-1, 0x1.9b0362p-2, -0x1.1b1c02p+0, -0x1.3b5792p+0, 0x1.7baebcp-1, 0x1.3f78ccp+0, 0x1.de6a4p-2, 0x1.acc842p-2, 0x1.7f6edep+0, -0x1.992992p+0, 0x1.34b2a8p+0, 0x1.a4a7fep+0, -0x1.f22f6cp-3, -0x1.34272ap+0, -0x1.097a7ep+1, 0x1.64a0c2p+0, -0x1.0b3bd2p+1, -0x1.63db9ap+0, 0x1.67b808p+0, 0x1.4f469cp-4, 0x1.b5d9e6p-1, 0x1.4089b8p+0, 0x1.19ff64p+0, 0x1.6c2f96p-2, -0x1.048ba4p+1, 0x1.c31d82p+0, 0x1.b1ad4ep-1, -0x1.42f34ep-2, -0x1.053908p+1, -0x1.fe67cep-1, -0x1.faca7ap+0, -0x1.3c575p+0, -0x1.fa63b2p+0, -0x1.edcb24p+0, -0x1.deff6p-5, -0x1.71a092p-1, 0x1.624928p+0, 0x1.35869cp-1, 0x1.d7e4b4p-2, 0x1.b2f774p+0, -0x1.dbfeb8p-2, -0x1.3a756cp-1, -0x1.f6e2ep+0, -0x1.60f20ap+0, -0x1.87295ap-1, -0x1.871e36p-4, -0x1.6c52dcp-1, -0x1.545d46p-1, -0x1.c15bccp+0, -0x1.db1926p-3, 0x1.3cfef6p-1, 0x1.0d40a2p+1, -0x1.ef8434p-2, -0x1.04c012p+1, -0x1.11b76ep+1, -0x1.4c0a38p+0, -0x1.6093dep+0, -0x1.b1b816p+0, -0x1.dd7f4ap+0, 0x1.bbb94cp+0, 0x1.1b0c56p+0, 0x1.1294aep+1, -0x1.8f3288p-1, 0x1.ce2bf8p-1, 0x1.4d4948p-2, 0x1.6d1dd6p+0, 0x1.c1f786p+0, 0x1.818228p+0, 0x1.853826p-4, 0x1.3edb08p+0, 0x1.c468aap-1, -0x1.c26a04p-1, -0x1.f518bp-2, -0x1.c12ff4p+0, -0x1.62ec62p+0, 0x1.ad0b76p-2, -0x1.25b4d8p+0, -0x1.8daeep-1, -0x1.57c556p+0, 0x1.b5bb08p+0, 0x1.33569cp+0, -0x1.9c2414p-1, -0x1.7e545ap-1, 0x1.01aa1ap-1, -0x1.3f365ep-7, -0x1.163b2cp+0, 0x1.08ac9ep-2, 0x1.4d1156p-6, -0x1.5d6bp+0, 0x1.27f6eep+0, 0x1.7fd202p-3, 0x1.089002p+0, 0x1.51d734p+0, 0x1.681cfep+0, 0x1.5c9cccp+0, -0x1.df2eb2p+0, 0x1.48739p+0, -0x1.7982b6p+0, -0x1.8a673ep-1, 0x1.b8ac0ep+0, 0x1.fe332p+0, -0x1.66d23p-1, -0x1.98aafcp-1, -0x1.990352p+0, -0x1.c16ae2p-3, 0x1.c1c18ap+0, 0x1.0bb386p+0, 0x1.9aac8ap-3, -0x1.a82202p-3], [0x1.65ade6p+0, 0x1.9846dap-1, -0x1.de9938p+0, -0x1.22c8bep-1, -0x1.a23b04p+0, 0x1.2c03fp+0, -0x1.4aea5ap-2, 0x1.202a44p-1, -0x1.50939ap-1, -0x1.7ee488p-5, -0x1.1962d8p-5, -0x1.782018p-2, -0x1.3fa352p-2, 0x1.0b00d6p+1, -0x1.8f8054p-5, -0x1.4530eap-2, 0x1.4823a8p+0, -0x1.5ebc3ap+0, -0x1.f0931ep+0, 0x1.05824p+1, -0x1.778658p-1, 0x1.1172fep+0, 0x1.63741cp+0, -0x1.793e88p-4, 0x1.9e38d8p-1, 0x1.0d2d46p+1, -0x1.92868ep+0, 0x1.067964p-1, -0x1.0ce008p+1, 0x1.93b6c6p-1, -0x1.bb0aa2p+0, -0x1.99ef3ap-1, -0x1.30aa14p+0, -0x1.251414p+0, 0x1.be1d02p-3, -0x1.881c7ap+0, 0x1.e1e73p-2, 0x1.425882p-6, 0x1.435edap+0, -0x1.981f74p-1, 0x1.f97f8p-1, -0x1.9a934p+0, -0x1.4dd586p-1, -0x1.32fa36p-3, -0x1.62b144p-2, 0x1.2cec9ep+0, -0x1.4876c2p-2, -0x1.a8139cp+0, 0x1.455ecep+0, 0x1.7ae3c4p+0, 0x1.123866p+1, 0x1.0909ccp+0, -0x1.9dea08p+0, -0x1.638566p-1, -0x1.ad0f6p-5, 0x1.0adb88p+1, -0x1.957006p+0, -0x1.16db12p-2, 0x1.753eb4p+0, -0x1.78f4dcp+0, 0x1.ff293ep-1, -0x1.51f682p-3, -0x1.477202p+0, -0x1.033486p+1, 0x1.49673ap-3, -0x1.7226b4p-2, 0x1.4cc9f2p+0, -0x1.086336p+1, -0x1.c0315p+0, 0x1.7068c2p-2, 0x1.7ecf6p-3, -0x1.d2e002p-1, 0x1.b270a2p-1, -0x1.cc0a66p-1, 0x1.edfcf8p+0, 0x1.b9bc6p-1, 0x1.ccfd2cp+0, -0x1.8055d2p-3, -0x1.8f1a8p+0, 0x1.aca2aap-1, -0x1.219308p-1, -0x1.a2a424p-3, 0x1.ea38d2p-1, 0x1.9985ecp+0, -0x1.ef4adap+0, -0x1.3f596ap-2, -0x1.57f2dep+0, -0x1.899168p+0, 0x1.afc5aap-1, 0x1.da2de4p+0, -0x1.5ec8d8p+0, 0x1.678102p-4, -0x1.00a9fcp-1, 0x1.e30beap-2, 0x1.8de788p-1, 0x1.937c36p-1, -0x1.11ff08p+0, 0x1.9927e6p+0, 0x1.394b22p+0, -0x1.058ca8p+1, 0x1.09824ap-2, -0x1.7d0398p+0, -0x1.17d1bep-1, -0x1.8ba872p-2, -0x1.f48422p+0, -0x1.d02daep-2, 0x1.8cd2b4p+0, -0x1.0ecfb6p+1, -0x1.f46cc8p+0, 0x1.be06fp-2, -0x1.392d9ep-1, -0x1.1049ccp+1, -0x1.817ab2p-4, -0x1.56bfbp-2, -0x1.72c022p-5, 0x1.15e1eep-2, 0x1.5e555ep-3, 0x1.3ea05cp+0, -0x1.83ee96p+0, -0x1.58f484p-1, 0x1.0ad75p+1, 0x1.cc98d2p+0, -0x1.d24706p+0, 0x1.275eaap-1, 0x1.01f54ap-5, -0x1.d2769cp-1, -0x1.8faaa8p+0, -0x1.baa136p-1], [0x1.d17bc2p+0, -0x1.1aad94p+0, -0x1.ef688cp-1, 0x1.96e8b6p+0, -0x1.5c11ep+0, 0x1.60128ap+0, -0x1.6ccf2cp-1, 0x1.aad388p-2, -0x1.0174e2p+1, -0x1.02bc9p+1, 0x1.785d56p+0, 0x1.f4bb2cp+0, -0x1.1c88a8p-1, 0x1.02a456p+1, 0x1.564c02p+0, -0x1.2ffb3ep+0, 0x1.cf1828p-1, -0x1.e440bap+0, 0x1.e80478p+0, 0x1.91629ep-1, -0x1.f6b364p+0, 0x1.7eb126p-3, -0x1.63eb54p-1, 0x1.68c7a8p-4, -0x1.e10a38p-1, 0x1.918c4ep-1, -0x1.a05256p+0, 0x1.1545a6p-1, -0x1.07f7a6p+0, -0x1.04951ep-7, 0x1.527f06p-3, -0x1.e4c60cp-2, 0x1.be293cp-3, -0x1.6814f2p-3, 0x1.c61976p+0, -0x1.87d706p+0, 0x1.a28a0ep+0, 0x1.8d25f8p-1, -0x1.c612bcp-3, 0x1.0487d2p-2, 0x1.9242e2p+0, 0x1.40c45ep+0, -0x1.9acd3cp+0, -0x1.f5889cp-1, -0x1.cef764p+0, -0x1.2d1116p+0, -0x1.688348p+0, -0x1.115a82p+1, 0x1.bdd8f6p-2, 0x1.a42376p+0, -0x1.e050aep-5, -0x1.51f148p-2, 0x1.726e88p-2, 0x1.869b9ep+0, 0x1.8dca84p-3, 0x1.00626p-1, 0x1.6ecbf2p-3, -0x1.0c147p+0, 0x1.adc776p-1, -0x1.dfc6bp-2, 0x1.6b9e5ap+0, 0x1.2728ccp+0, -0x1.1aba92p-1, -0x1.55770ep+0, 0x1.8b7d04p+0, 0x1.ea75a2p+0, 0x1.17aa26p+0, -0x1.7b736ep+0, 0x1.d11442p-3, -0x1.c0c386p-5, 0x1.6f4e8ap-1, 0x1.ae59eap-2, -0x1.6b1f82p-2, -0x1.89a9e4p-3, 0x1.62fa78p-1, -0x1.171854p+0, 0x1.fa02f4p-4, 0x1.efcf82p-2, -0x1.1e2c1p+0, 0x1.614aa8p+0, -0x1.9bb6fp-5, -0x1.690228p+0, 0x1.00f8f6p+1, 0x1.252226p+0, 0x1.081ff4p-2, -0x1.70c666p-1, 0x1.b26b64p-3, 0x1.4d79b6p-1, 0x1.3391c8p+0, -0x1.7ca906p+0, -0x1.460c04p-3, 0x1.6c77fcp-1, 0x1.b21ddep-1, -0x1.b43ap-2, -0x1.e981d6p+0, 0x1.bbfb1ep-5, 0x1.5235dap+0, 0x1.106b66p+0, -0x1.5707e4p+0, -0x1.e7a0ep+0, -0x1.d5cf18p+0, -0x1.f87bf6p-1, -0x1.c2de68p+0, -0x1.82129ep-1, -0x1.b07caep+0, -0x1.e33b7ep+0, -0x1.fe4e0ep+0, 0x1.50c26p-2, -0x1.561c16p+0, -0x1.b77da8p-2, -0x1.f07492p+0, -0x1.e96444p-2, 0x1.6edd6p-1, -0x1.ed3828p-1, -0x1.6c9fa6p-7, -0x1.3e1098p-1, -0x1.4eeea2p-1, 0x1.9d1ceap+0, 0x1.413638p+0, -0x1.7a3a74p-4, 0x1.8e3868p+0, -0x1.0bf0b4p+1, 0x1.253748p-1, 0x1.f418cap-1, 0x1.063238p+1, 0x1.4ba394p+0, 0x1.24a326p+0, -0x1.47d656p+0], [-0x1.249c92p+0, -0x1.97745cp+0, 0x1.89a0cap+0, 0x1.48559cp-2, -0x1.0058d6p+0, 0x1.8b9adcp-1, 0x1.8e6002p-1, 0x1.be4d9ap+0, 0x1.0bf1f4p+0, -0x1.d13b46p+0, 0x1.01c4fcp+1, -0x1.6f2d1ap+0, 0x1.86973cp-1, -0x1.308898p-1, 0x1.8f1d3ep+0, -0x1.2ad43p-2, 0x1.108b5cp-1, 0x1.3e6892p+0, 0x1.020bb8p+0, 0x1.38fdbap-1, 0x1.2ceda6p+0, 0x1.31eb3ap+0, -0x1.f777d8p+0, 0x1.fdd402p-2, 0x1.c449cp+0, 0x1.b249e2p+0, -0x1.c4158p-1, -0x1.d01cd6p-2, -0x1.1672a4p+0, 0x1.ec3b26p+0, 0x1.82364p+0, -0x1.6b154ap+0, 0x1.d022a4p+0, 0x1.b87ce2p+0, 0x1.89df7ap-2, 0x1.34cc46p-3, 0x1.aa335ep+0, -0x1.0cf69ep-1, 0x1.92ce6cp-1, -0x1.bdd6bap-1, 0x1.2619dap-2, 0x1.2b976ep-6, -0x1.fed8e4p+0, -0x1.9a3876p-8, -0x1.d8cc5cp+0, -0x1.79d28cp+0, 0x1.a197cep+0, 0x1.7a8312p+0, 0x1.10c69ap+0, -0x1.f92a78p-8, -0x1.3f8decp+0, 0x1.a3a4aap-2, 0x1.be80dcp-3, 0x1.09bc92p+1, -0x1.44cdcp-1, 0x1.051296p+1, -0x1.f35684p-1, 0x1.2922ecp+0, 0x1.0a5d76p+0, 0x1.b93258p-1, 0x1.e4fef8p+0, 0x1.c9d828p-1, 0x1.8ea942p-1, -0x1.084ceap+0, -0x1.019916p+0, 0x1.1ba57cp-6, -0x1.6c7324p-1, -0x1.6516cp-1, 0x1.f890f8p+0, -0x1.08e0ccp+1, 0x1.c75836p-5, 0x1.c1fb2cp+0, 0x1.5b3eaep+0, 0x1.069c0cp-1, 0x1.c49b3cp-1, -0x1.4f025p-4, 0x1.8293b6p-1, -0x1.375df8p+0, 0x1.e6e32p+0, 0x1.e265a4p+0, -0x1.75eeacp+0, 0x1.6307b4p+0, -0x1.e7e13p+0, 0x1.260e4ap+0, -0x1.8c9ea2p-7, 0x1.8fe072p-1, 0x1.0ec166p+1, 0x1.758174p+0, -0x1.6f1c8cp-2, 0x1.a86938p-2, 0x1.f1e8c2p+0, -0x1.5952e8p-2, 0x1.36ca48p+0, 0x1.1e80cap-3, -0x1.a28d34p+0, -0x1.de80d2p-4, -0x1.cfaaccp-1, 0x1.7d7b3cp+0, 0x1.2f89c8p+0, 0x1.1700fp-1, 0x1.b11872p+0, 0x1.63fe0ep-1, -0x1.956c92p+0, -0x1.fbb452p-1, 0x1.af37bp+0, -0x1.008006p+1, 0x1.5bbbd4p+0, -0x1.0cfbaep+1, -0x1.7266fcp+0, 0x1.8f3d74p-2, 0x1.ad2d8ep-1, -0x1.d883bap-3, -0x1.5fa47ap+0, 0x1.ba4aecp-5, 0x1.049c62p+1, -0x1.4b3378p+0, 0x1.85618ap-1, 0x1.4e9e52p+0, -0x1.e24d08p+0, -0x1.8d1d6cp+0, -0x1.719272p+0, -0x1.d789cp-3, -0x1.566d18p+0, 0x1.467a54p-2, 0x1.a69e6cp-1, 0x1.d775dep+0, 0x1.96b07ap-1, 0x1.2bcb3p-2], [0x1.fc8f7ap+0, 0x1.c0b716p+0, -0x1.557a08p-6, 0x1.192624p-1, -0x1.5ebeeap-2, 0x1.d283e6p+0, 0x1.cd9b4p-1, -0x1.20def6p-3, 0x1.5f956ap-8, 0x1.58c594p+0, -0x1.16d084p+0, -0x1.027aep+1, -0x1.505aap+0, -0x1.6a8b8ep+0, -0x1.7889bp-1, 0x1.bf914p+0, -0x1.c21deep-3, -0x1.189edap-2, -0x1.c4fa3ap-1, -0x1.ae444cp-2, 0x1.b774a6p-3, -0x1.6eb5d6p-4, -0x1.9853dcp+0, 0x1.73d108p+0, -0x1.c81b8p-1, -0x1.f80bdcp-1, -0x1.4258fp+0, -0x1.d46156p+0, -0x1.2eafb8p+0, -0x1.4c7668p+0, -0x1.e6953ep+0, 0x1.fb8f2ap-2, 0x1.e8dc3p-3, -0x1.6fd45ap-1, -0x1.2430b2p-3, 0x1.f79d9p+0, 0x1.e50604p-2, 0x1.f671dcp-1, 0x1.a08fep+0, 0x1.79d6ap-3, -0x1.92fcb8p+0, 0x1.2921aap-1, 0x1.9567c4p+0, -0x1.a1f17ep-3, 0x1.5e5562p-1, 0x1.72699cp+0, -0x1.73933p-3, -0x1.107d02p+0, 0x1.6b9f44p+0, 0x1.52f89ap-2, 0x1.02a126p+0, 0x1.7d4ae4p-2, 0x1.42ab5ep+0, -0x1.797ae8p+0, 0x1.f5bd1ap-4, -0x1.3c4c98p+0, 0x1.7824fap+0, -0x1.6c7e42p+0, 0x1.2c5276p-1, 0x1.cc3846p+0, 0x1.57b47cp+0, -0x1.ec1974p+0, 0x1.02ba36p+0, 0x1.3eb036p+0, -0x1.3c3e4ep+0, 0x1.33653ap-3, -0x1.634bd4p+0, -0x1.4aff16p+0, -0x1.475d6ap+0, -0x1.2bef56p+0, 0x1.ccf2d6p+0, -0x1.b7cd44p-3, 0x1.71becep+0, -0x1.02216ap+0, 0x1.0b1666p+0, -0x1.b2f75ep+0, -0x1.8a4708p+0, -0x1.daed2ap-1, 0x1.1f4dd6p-1, 0x1.2a4fep-1, 0x1.0dfcc2p+1, 0x1.b2087ap-1, 0x1.072142p+0, -0x1.a25828p-1, 0x1.6651d8p-1, 0x1.8d6bdp+0, 0x1.600552p+0, 0x1.46e3aep+0, -0x1.468378p-1, -0x1.3574d6p-2, 0x1.571c32p+0, 0x1.7d9f58p-2, 0x1.f1032p+0, -0x1.f48e4ep+0, -0x1.02d8eap-3, 0x1.b347f8p-4, 0x1.0c2596p+1, -0x1.0b86d4p+0, 0x1.245648p+0, -0x1.b3724ap+0, 0x1.c3e878p+0, -0x1.e024d6p-1, 0x1.054b94p+1, 0x1.7e88e4p+0, -0x1.01a726p-2, -0x1.88772ap+0, -0x1.dc2566p+0, 0x1.9c97f2p-1, -0x1.9a5404p-2, 0x1.18b08ep-1, 0x1.e73ca4p-2, 0x1.0224b8p+1, 0x1.b311fp+0, 0x1.2800d2p-1, -0x1.329b7p+0, 0x1.bb9db2p+0, 0x1.53f05cp-2, 0x1.c9ef08p+0, -0x1.a34bdp-3, -0x1.126dc4p+1, 0x1.3c03cp+0, -0x1.86bdeep+0, 0x1.bc27d8p-1, 0x1.2e139p+0, 0x1.efe23cp+0, -0x1.961a94p+0, 0x1.af0224p-4, -0x1.c14cfap+0], [-0x1.f8c736p-1, -0x1.c482bep+0, -0x1.224f7ap-1, -0x1.faeab8p+0, 0x1.19258ep-2, 0x1.6b1f32p+0, 0x1.a65356p-1, 0x1.c6e46ap-1, -0x1.0d54f4p+0, -0x1.9802e2p-2, 0x1.e905b8p-3, 0x1.3a6d7p+0, 0x1.43ef04p-4, -0x1.cd473ap-2, 0x1.42c2bp+0, -0x1.956a4ap+0, -0x1.c2d288p-5, 0x1.54b41cp+0, -0x1.8d45b4p+0, -0x1.af57dcp-1, -0x1.d894ap+0, -0x1.d6bdf6p-6, 0x1.59f786p+0, 0x1.3daa58p-1, -0x1.d56a44p+0, 0x1.600a7p+0, 0x1.90dee2p-3, -0x1.793826p+0, 0x1.fd84dp+0, -0x1.0f5e18p+0, 0x1.77d2a6p+0, 0x1.19acdep+0, 0x1.68c38ep+0, -0x1.8e75c8p+0, -0x1.53297p+0, -0x1.ba533cp+0, 0x1.62bf7ap-1, 0x1.cb6574p-3, 0x1.3a2ad2p-1, 0x1.2fd21p-2, 0x1.9187a6p-1, -0x1.2388bep-2, 0x1.c2b2bp-1, -0x1.ecb264p+0, 0x1.6e822p-2, -0x1.c9224ep+0, 0x1.0f3ac4p+1, -0x1.956c9ap-3, -0x1.80c102p-2, -0x1.f7c8c4p-1, -0x1.832746p-4, -0x1.8ed858p-1, -0x1.88f1ccp-1, -0x1.bbdd5p-4, 0x1.19ca3cp-1, -0x1.91c7bep+0, 0x1.c18a1cp+0, -0x1.35c5eap+0, -0x1.9d4276p-2, 0x1.a5f498p-3, 0x1.2378f6p+0, -0x1.50934ep-4, 0x1.cb9982p+0, 0x1.955e98p+0, 0x1.3b8eap-1, 0x1.7135bcp+0, 0x1.afaba2p+0, -0x1.b1cb02p-1, -0x1.4f827cp-1, -0x1.42281p-2, -0x1.7a0fbp-6, -0x1.bcb1a6p-1, -0x1.45bc9ep-1, 0x1.381d7p+0, 0x1.56a71cp+0, 0x1.00a242p+1, -0x1.56e19ep+0, -0x1.3cd74ep+0, -0x1.864694p-1, 0x1.9e93ccp+0, 0x1.cfcbf2p+0, -0x1.560144p-3, -0x1.dcc30cp+0, 0x1.b97002p+0, -0x1.5d6c18p+0, -0x1.0f1d22p-1, -0x1.05fa8ep+1, 0x1.ddc48p-6, 0x1.061eb2p+1, 0x1.22e286p-3, -0x1.d31d2ap+0, 0x1.54026cp-1, -0x1.c8ed12p+0, -0x1.010712p+1, -0x1.19bf48p-2, 0x1.1204dcp-2, -0x1.f79028p-1, 0x1.520798p+0, -0x1.547148p-2, -0x1.c101fap-2, 0x1.405a66p+0, -0x1.acb22cp+0, -0x1.dd3fdep+0, -0x1.0e7842p+0, -0x1.0b7dcep+1, -0x1.4b8ad8p-2, 0x1.4e015ep-1, 0x1.e6be34p+0, -0x1.1274cp+0, 0x1.1114fcp-1, 0x1.11f2f8p+1, -0x1.04054cp+1, 0x1.db64b6p+0, 0x1.b68e5ap+0, -0x1.d96baap+0, 0x1.5b70b4p-1, 0x1.e03b86p+0, -0x1.6f57dcp-3, 0x1.8295f4p-1, -0x1.061638p+0, 0x1.4b72b8p-1, -0x1.f35ee6p+0, 0x1.ebc1d6p-2, 0x1.8f0b96p-3, -0x1.e15e06p-1, -0x1.245feap-2, 0x1.7fc196p-1, -0x1.441954p+0], [0x1.176d0ap-1, 0x1.30cf76p+0, 0x1.3aa85ap+0, 0x1.f7daeep+0, 0x1.f92286p-2, -0x1.ad4968p-9, -0x1.0051bep+0, -0x1.d07ca4p+0, 0x1.73d53cp+0, -0x1.6b7822p+0, -0x1.f1fbeap-2, -0x1.004d6ep+1, -0x1.b167e4p-1, 0x1.5e9144p+0, 0x1.52c0b4p-1, 0x1.a7995cp-5, 0x1.10613cp+0, -0x1.d94812p+0, -0x1.bdb024p+0, 0x1.8e81e4p-2, 0x1.0b684p+1, 0x1.5de1e6p-1, -0x1.0d0122p+1, 0x1.c778c6p-1, 0x1.0b93c2p+1, 0x1.983d26p-3, -0x1.f8f4b6p-1, -0x1.02d3aep+1, 0x1.2cc7c2p+0, -0x1.c340dep+0, -0x1.194c26p+0, -0x1.92f5d4p-1, 0x1.e1333cp+0, 0x1.80ea76p-1, -0x1.04d606p+1, 0x1.a9faeap+0, -0x1.00d9ep+0, -0x1.589d7cp-2, -0x1.251718p-1, 0x1.db244ap-2, 0x1.b30deep-1, 0x1.a8493cp-9, 0x1.9475bep-3, -0x1.7d0b8cp+0, -0x1.80d8fep+0, -0x1.96c35ap+0, -0x1.be692cp+0, 0x1.8b7042p+0, -0x1.f4d134p+0, -0x1.d1fa4p+0, 0x1.320876p-4, 0x1.1164e6p+1, -0x1.2e2efap+0, 0x1.2c7cf6p-1, 0x1.24248p+0, -0x1.d7c984p-3, -0x1.f24dc2p+0, -0x1.c7f16ap+0, 0x1.7ec786p-1, -0x1.853224p-1, 0x1.7d531ep+0, 0x1.f2ae34p-1, 0x1.a2714ap+0, -0x1.1fe32ep-1, -0x1.1290cap+1, -0x1.ad41fep-2, -0x1.10e3f2p+0, 0x1.79108p+0, -0x1.97f452p+0, -0x1.c569b8p+0, -0x1.a2941p+0, 0x1.01511ap+1, 0x1.cdb2dap-2, -0x1.f66e12p-1, 0x1.84d91ap+0, -0x1.00afb2p-2, -0x1.0f62cp-1, 0x1.891128p+0, -0x1.5a40aap-2, 0x1.3f01e8p+0, -0x1.e984c6p-5, 0x1.fc3bfp+0, 0x1.fb599ap+0, -0x1.013628p-3, -0x1.d871a2p+0, 0x1.dc641p+0, -0x1.c481c8p+0, 0x1.b039f6p-1, 0x1.af1c62p-5, -0x1.0885aep+1, 0x1.5698bep+0, 0x1.ba023ep-1, -0x1.7883dp-1, -0x1.08c37ep-2, 0x1.6a9b42p+0, 0x1.ebbe16p-1, 0x1.07e01cp+1, -0x1.7b1b9p+0, 0x1.7fb432p-1, 0x1.ec86f2p-1, 0x1.62f93ap-1, 0x1.2079d2p+0, 0x1.09c96ep+1, -0x1.06a342p-2, 0x1.c26a0ep-1, -0x1.183ec6p+0, -0x1.4e5436p+0, -0x1.ac4efp-1, -0x1.2f9d98p-1, 0x1.297d2ep+0, -0x1.cb4c94p+0, 0x1.c43b24p+0, 0x1.ac6008p-1, -0x1.a8cc98p+0, 0x1.544442p+0, -0x1.b5707p+0, 0x1.e2da8ep+0, -0x1.55477ep+0, 0x1.98a184p+0, -0x1.bb3368p-1, -0x1.d75c0cp+0, 0x1.700ab6p+0, 0x1.386964p+0, -0x1.0a91b6p+0, -0x1.b27c08p+0, 0x1.aaa206p-7, 0x1.39009cp+0, 0x1.bcf656p+0], [0x1.28beaap-1, 0x1.167a6ep+0, -0x1.6bc738p-1, -0x1.d1c8a8p+0, -0x1.0cc526p+1, -0x1.e2189ap+0, -0x1.0de8eap+1, 0x1.a07da8p-6, -0x1.ec67f4p+0, -0x1.07b73p+1, -0x1.53bbd4p+0, 0x1.51a862p-1, -0x1.1be22p+0, 0x1.b5aebap+0, 0x1.e48d86p-2, -0x1.169c38p-2, -0x1.9f332p-1, 0x1.23df38p+0, -0x1.5928bcp+0, -0x1.ed098ep-1, -0x1.7f8126p-2, -0x1.7cd78ep-1, -0x1.68c84ep+0, 0x1.420dbcp-2, -0x1.350852p+0, 0x1.b29654p+0, -0x1.45e3e6p+0, -0x1.72a33ap-4, 0x1.9a6c44p-3, 0x1.33b17cp-1, -0x1.fc793p-2, -0x1.ed23a2p-6, -0x1.511908p+0, -0x1.af4aa4p+0, 0x1.16e306p-1, -0x1.a864a6p+0, -0x1.bbeefep-1, -0x1.542164p-1, 0x1.ca9a12p+0, -0x1.f4c5acp-1, 0x1.994bap+0, 0x1.b4db86p-2, 0x1.de121cp-2, 0x1.06e016p+1, 0x1.93986ep-1, -0x1.a6a9fep+0, 0x1.d7f6d6p-1, -0x1.6a3b8ap+0, -0x1.420f62p-5, -0x1.05aaap-1, -0x1.f128eap+0, 0x1.7edf0ep+0, -0x1.a9fc36p-2, 0x1.1931c6p+0, -0x1.78a3eep-1, 0x1.d403bcp-2, 0x1.a7bcc2p+0, -0x1.0e34ecp+1, 0x1.094de4p+0, -0x1.0ee9a6p+1, 0x1.662976p-1, -0x1.ab541p+0, 0x1.ffaaa4p+0, -0x1.9c6054p+0, -0x1.090a12p+1, 0x1.2148aep+0, 0x1.bb8f3p-1, -0x1.04bdbcp+1, -0x1.76afdcp+0, 0x1.a456acp+0, -0x1.f1b5d4p-5, 0x1.62eae6p-7, -0x1.bc89e6p+0, 0x1.abb71cp-1, -0x1.bd937p-1, -0x1.63abc4p+0, -0x1.0591fep-1, 0x1.295b1p+0, 0x1.84dd94p+0, 0x1.29819cp+0, -0x1.1692a6p-2, 0x1.63de16p-3, 0x1.6e1c26p+0, -0x1.fc95f6p+0, -0x1.61b5dap-1, 0x1.d7da4cp+0, 0x1.468acap+0, -0x1.c661dcp+0, 0x1.d3cac6p-1, 0x1.311028p-1, 0x1.b8eb4ep-3, 0x1.42eeeap+0, -0x1.90bf6cp+0, 0x1.2c89cep+0, 0x1.dab10ep-3, -0x1.7cd986p-2, 0x1.26e3c6p+0, -0x1.04ea94p-1, -0x1.1fc5b8p-3, -0x1.731938p-1, -0x1.7e6bfep+0, 0x1.2eeb82p+0, 0x1.100a4ap-2, 0x1.3879cep-2, 0x1.7bef06p-1, 0x1.6b31a4p+0, -0x1.9bd654p-1, -0x1.cd46f6p-2, 0x1.7d5874p+0, -0x1.169d94p-2, 0x1.52cacap-3, -0x1.5618c2p+0, -0x1.18eb24p-2, 0x1.015b46p+1, 0x1.1e9bd8p-2, -0x1.0fef8ap+1, 0x1.d6caa6p-1, 0x1.e07c88p+0, 0x1.edeb84p-1, 0x1.78a0c8p-11, 0x1.68375ap+0, 0x1.8eaa5ep-2, -0x1.94976p+0, 0x1.30e86ep+0, -0x1.edb578p-2, -0x1.6b0f76p+0, -0x1.090cep+1, -0x1.e4b8cap+0], [0x1.f070e4p+0, -0x1.c15b68p+0, -0x1.6efbb2p+0, -0x1.f99e9cp-1, -0x1.08fad6p+0, -0x1.c2fcfp+0, 0x1.7fb822p+0, 0x1.bb5aa2p+0, 0x1.e7d7e2p-5, -0x1.f8a88cp-2, 0x1.c6d47ep-2, 0x1.73afbap-1, -0x1.1b94cp-1, 0x1.96a294p+0, -0x1.323768p-1, -0x1.3df8dep+0, -0x1.1c7e4ep-1, -0x1.d61694p-3, -0x1.16544p-1, 0x1.b61b5ap+0, -0x1.d84482p-1, -0x1.41545ap-1, 0x1.f445a8p+0, -0x1.e92a86p-1, 0x1.e9ed68p-2, -0x1.7eae22p+0, 0x1.ae5362p-1, -0x1.d48ea4p-1, -0x1.1fe1ccp-2, 0x1.2439e6p+0, 0x1.7b16cap+0, -0x1.11e8dcp+1, 0x1.05f166p-2, 0x1.517db2p+0, -0x1.010fdap-1, 0x1.bfe5c2p-3, 0x1.0cdc52p+1, -0x1.5434a2p+0, -0x1.c745b2p+0, 0x1.5e6ccap+0, 0x1.94c4d2p+0, 0x1.d7c692p+0, 0x1.b2b176p+0, 0x1.1e1f18p+0, 0x1.e1047ep+0, -0x1.6bc882p-1, -0x1.bc219ap+0, -0x1.7f816ep+0, 0x1.39f64cp+0, 0x1.dbcf28p-2, -0x1.caf51ep+0, -0x1.083188p+1, 0x1.422516p+0, -0x1.5ec32ep+0, -0x1.ac74aep-2, -0x1.6c76aap-2, -0x1.15fceep+0, 0x1.f2192cp+0, -0x1.824664p+0, 0x1.e71c76p-3, -0x1.d0628cp-14, 0x1.946c02p-2, -0x1.50702ap+0, -0x1.72ffdap+0, 0x1.d5b0e4p+0, 0x1.d235ccp+0, 0x1.77c8c4p+0, -0x1.07c066p+0, -0x1.fb2b3ep-4, 0x1.12d08ep+1, -0x1.ab9dacp-1, -0x1.5cd594p+0, 0x1.801efep-3, 0x1.ac94fep-3, -0x1.7cc7fep-1, -0x1.4cfc9cp-1, -0x1.353daep-2, 0x1.c11aecp-1, -0x1.2b6418p+0, -0x1.fff39p+0, -0x1.39fb5cp-1, 0x1.fe0538p+0, 0x1.7c6c94p+0, 0x1.6f5dap+0, -0x1.00d1f6p+0, -0x1.13dcep-4, 0x1.4147ccp-1, -0x1.7ff2cp+0, 0x1.f286d8p-1, -0x1.47d0d4p+0, 0x1.91ede2p-2, -0x1.f33fd8p+0, -0x1.1d5706p+0, 0x1.8cebf4p+0, 0x1.72153cp-1, -0x1.743916p+0, -0x1.0f7fbep+1, -0x1.231424p+0, -0x1.2c5e62p-4, -0x1.88d25ap-1, -0x1.19866ap-2, 0x1.b467acp-1, 0x1.567904p-2, 0x1.a22c54p+0, 0x1.82dfp-2, -0x1.919df6p-1, 0x1.d1d3bep+0, 0x1.cd380ap-2, 0x1.1ce0fcp-1, -0x1.c76182p+0, 0x1.7da772p+0, 0x1.05f9e8p+1, 0x1.fefb68p+0, -0x1.07a7f6p+1, 0x1.023736p+0, 0x1.829346p-1, 0x1.522618p+0, -0x1.3a404p+0, -0x1.b2cabep+0, -0x1.c8b16cp-2, 0x1.f3d2c2p-4, -0x1.93af56p-4, 0x1.fccc54p-4, 0x1.fb85a2p-1, 0x1.b301d4p+0, 0x1.1555e2p-3, 0x1.8af434p-1, -0x1.5880cep-1], [0x1.dbc716p+0, -0x1.613ff6p-3, -0x1.dce082p+0, 0x1.064ee4p-1, -0x1.991b54p+0, -0x1.50a8cap-1, 0x1.031a7cp+1, 0x1.8faa8ep+0, 0x1.ab3158p+0, 0x1.46818ep-1, -0x1.71b88cp+0, -0x1.637ceap+0, -0x1.ad4c2ap-1, -0x1.49becep+0, -0x1.986886p+0, -0x1.101852p+1, 0x1.3b9d34p-2, 0x1.f75eccp+0, 0x1.23c72ap+0, -0x1.cba71ap-1, -0x1.4d8436p+0, 0x1.b8112p-1, -0x1.a9dabp-1, -0x1.003158p+1, -0x1.73b53ep-1, 0x1.c38e6ap+0, 0x1.0ddfe6p+1, -0x1.056076p+1, 0x1.431638p+0, -0x1.69e282p-1, -0x1.6b04p-1, 0x1.028376p-3, -0x1.d11e5ep+0, -0x1.422efp-3, 0x1.d03f34p+0, 0x1.0c2788p+0, 0x1.ed3f0ep+0, 0x1.035c34p+1, -0x1.4be3dcp-2, -0x1.034daep-1, 0x1.0616f6p-1, 0x1.0c8d5ep+1, 0x1.7016c6p-1, 0x1.0bc106p+0, -0x1.b7522p+0, -0x1.4b765p-1, -0x1.0d6d8ap-2, -0x1.534f58p+0, 0x1.0dee6ap+0, -0x1.ce5338p+0, -0x1.fbe6d4p+0, 0x1.3192a6p+0, 0x1.04219cp+0, -0x1.c10f9ap-3, 0x1.1dea52p-3, -0x1.cce1fp-4, 0x1.bdb4dep+0, -0x1.230ecp-1, -0x1.4f93ccp-1, 0x1.226112p+0, -0x1.18f1ep-1, -0x1.bdcc82p-3, -0x1.e95676p-3, -0x1.aa7a7ap+0, 0x1.b01dcap-1, -0x1.edde8cp+0, -0x1.376c74p-4, -0x1.ddc35p-1, -0x1.071166p+1, 0x1.8981c2p+0, 0x1.4f324ap+0, 0x1.0f9db2p+1, 0x1.aa1486p-3, -0x1.8d6176p+0, -0x1.5c7708p-3, 0x1.ad0292p-3, 0x1.0f715ap+1, 0x1.21d434p-3, 0x1.218d06p-1, 0x1.0820c8p+0, 0x1.a99f9p+0, -0x1.a43b1cp+0, -0x1.5d0ec8p-4, -0x1.120c14p+1, -0x1.9a5168p-3, -0x1.93cbccp+0, 0x1.76c1a2p-5, 0x1.3b089ap-4, 0x1.fd7166p-1, -0x1.99d87p+0, 0x1.6e6264p+0, -0x1.09296p-2, -0x1.2d10a6p+0, 0x1.34e7e4p+0, 0x1.ed06a4p-3, -0x1.fb03e6p-3, 0x1.9e0b9cp+0, -0x1.867872p+0, 0x1.7e8154p+0, 0x1.9127b4p-1, 0x1.a18fbcp+0, -0x1.acd324p+0, 0x1.2c38ecp-1, -0x1.e20634p+0, 0x1.e62e5cp+0, -0x1.7150bp-3, -0x1.c73776p-1, 0x1.a66776p-1, 0x1.0835ecp+0, -0x1.9cafaep+0, -0x1.513666p+0, 0x1.32d2acp-2, -0x1.a20148p+0, -0x1.10540ep-3, -0x1.9c4cecp+0, -0x1.2e0c96p+0, -0x1.bb7106p+0, -0x1.fd2378p+0, 0x1.87f6eap+0, -0x1.41e01ep+0, 0x1.c82406p+0, 0x1.acccbcp-2, 0x1.3673cp-1, 0x1.60e088p+0, 0x1.97c19cp-1, 0x1.1a0f36p+0, 0x1.7f3eb4p+0, 0x1.c36c0cp+0], [0x1.0fd438p-1, -0x1.35ebb6p+0, 0x1.c4726cp+0, 0x1.ce621p+0, -0x1.a42664p+0, 0x1.0ed4e8p+1, 0x1.5b20aep+0, 0x1.7f7f26p-1, -0x1.92c52p+0, -0x1.d13e34p-1, -0x1.768608p+0, -0x1.262a7ap-3, -0x1.005448p+1, -0x1.56563cp-9, 0x1.33516p-1, 0x1.dd9a3ep+0, -0x1.e7611cp-1, 0x1.c9e33ep-3, 0x1.d8557ep+0, -0x1.20b8ep-4, -0x1.6e886cp-1, 0x1.106ddap+0, 0x1.cffdf6p-2, -0x1.968cfap+0, 0x1.18ddfap-1, 0x1.09927cp+0, 0x1.cc43e6p+0, -0x1.5b7f98p+0, -0x1.07af3ep+1, 0x1.31d47ep-3, -0x1.037b32p+0, 0x1.c02c08p-1, 0x1.3cedb2p+0, -0x1.0334fp+1, -0x1.4b9218p-2, 0x1.46830ep-2, -0x1.adfdb4p+0, -0x1.97ce2ep+0, -0x1.c65ceep+0, -0x1.b29f72p-1, 0x1.49ae26p+0, -0x1.806804p+0, -0x1.ca1f6p-3, 0x1.4c987p-1, -0x1.07dc78p+1, -0x1.b26836p+0, 0x1.e0978cp+0, 0x1.364c62p+0, 0x1.1ce8f4p-2, 0x1.f09dcp-1, 0x1.638012p+0, -0x1.9d470ap+0, -0x1.b621acp+0, -0x1.135bdcp-5, -0x1.cb7ad8p-3, 0x1.b10ebap-2, 0x1.7ddd26p-2, -0x1.6a41p+0, -0x1.b77f94p+0, 0x1.3a622ap-3, 0x1.f1e314p-2, 0x1.065ae2p+0, -0x1.033296p-2, 0x1.d2110cp+0, 0x1.d7681p+0, -0x1.0c2bbp+1, 0x1.c42374p+0, -0x1.5d5548p-1, 0x1.328daep+0, -0x1.696162p-1, -0x1.8ec032p+0, 0x1.ff17d4p+0, 0x1.4227bcp-2, 0x1.b8cdecp-2, -0x1.df4138p+0, -0x1.5db81cp-2, -0x1.473de2p-1, 0x1.b1c87p-1, 0x1.b81d34p-1, 0x1.51fedp+0, -0x1.5be01p+0, 0x1.386e92p-2, 0x1.129358p+1, 0x1.09c402p+1, -0x1.c157e4p-1, -0x1.b40b22p-1, -0x1.65ec3ap+0, -0x1.8a70e6p+0, 0x1.02f706p+1, -0x1.0bc73cp+0, 0x1.015c9p+0, 0x1.83452p-3, -0x1.d7b93cp-1, -0x1.c78284p+0, 0x1.543334p+0, 0x1.6563d6p-2, -0x1.d7e508p-1, -0x1.a1e93p+0, -0x1.835db6p-3, 0x1.662dbap-1, 0x1.e399bcp+0, 0x1.a0fb96p-1, 0x1.9fcae8p+0, -0x1.98d7b4p-1, 0x1.710d86p+0, -0x1.ba7e4cp+0, -0x1.a714bep-2, -0x1.9787acp-2, -0x1.943cb2p+0, 0x1.586fbp+0, 0x1.6dfab2p-3, 0x1.a42f6ap-3, 0x1.357988p-1, 0x1.6e14p+0, -0x1.b030bcp-2, 0x1.5a2434p+0, 0x1.2db972p+0, -0x1.e7f4acp+0, -0x1.2892cp-1, 0x1.e7e87p+0, 0x1.e4fe66p-1, -0x1.88d6b2p+0, -0x1.ad409ep-1, -0x1.8b997cp-1, -0x1.8feb3ep-3, 0x1.d5ce02p-1, 0x1.259254p-1, 0x1.dc854p+0], [0x1.e5a878p-1, -0x1.13e9fep-2, -0x1.802746p+0, 0x1.61b1f4p+0, 0x1.651478p+0, -0x1.12744ep-1, 0x1.506048p+0, 0x1.246362p+0, -0x1.09dfc8p-1, 0x1.600452p+0, -0x1.38b604p+0, -0x1.627122p-3, 0x1.c31c3p+0, -0x1.02256p+1, -0x1.5cf47cp+0, -0x1.cabb54p-2, -0x1.ede572p-2, 0x1.e589fap+0, 0x1.d5ff22p+0, 0x1.97d4dep+0, -0x1.8f6b04p+0, -0x1.f7afcp-4, -0x1.5e83ep-5, -0x1.7fc49p+0, -0x1.a8393cp-1, -0x1.5fe284p+0, 0x1.33c5dep-3, 0x1.23cd6ep+0, 0x1.b5eaa2p+0, 0x1.3b1fc6p-3, 0x1.7c0af2p+0, 0x1.d99514p-1, 0x1.3fb62ap+0, 0x1.e90c14p-2, -0x1.2e1c92p-1, 0x1.ee3f2cp-1, -0x1.2ea612p+0, 0x1.d103cp+0, -0x1.aa35acp-1, 0x1.783a42p-1, -0x1.c6387p+0, -0x1.d2ccfap+0, -0x1.625d6p+0, 0x1.168a26p+0, -0x1.fa1222p-1, -0x1.6dbe94p+0, 0x1.496a5ap+0, -0x1.019e6cp+1, -0x1.a70a1p+0, 0x1.26bf84p+0, -0x1.e4485ep+0, 0x1.ee902ep+0, 0x1.390e3ep+0, -0x1.2a7a98p+0, -0x1.174e22p-1, -0x1.006fb8p-1, 0x1.7bb544p+0, -0x1.c404d6p+0, -0x1.1dc82p+0, 0x1.a2e596p+0, 0x1.318584p-1, 0x1.1cb30ap-1, -0x1.5a7fecp+0, -0x1.0ad542p+1, -0x1.f4ec4p+0, 0x1.c27e92p+0, 0x1.0fb09ap+1, 0x1.0d09fcp-2, -0x1.06a46ep+1, 0x1.53e9cp-1, -0x1.695e7cp-1, 0x1.93dce2p-6, 0x1.9ee912p+0, 0x1.43776cp+0, -0x1.48c3fep-2, -0x1.62f2c8p+0, 0x1.48a9dcp-1, -0x1.acfbeep-1, 0x1.3b8e88p-2, 0x1.de10e4p-3, -0x1.165da6p+0, -0x1.875eb4p+0, -0x1.700f9cp-3, 0x1.0e962p+0, -0x1.f31176p-6, 0x1.bf734ep-1, -0x1.3f196cp-1, -0x1.39f2c2p-1, 0x1.5d6fcep+0, -0x1.ed82d8p+0, -0x1.faa144p+0, -0x1.0fc91ap+0, 0x1.57cbf2p+0, -0x1.d6ea92p-3, -0x1.6115p-3, 0x1.97eb4p+0, -0x1.3b2906p+0, 0x1.7cb124p-1, 0x1.0ce9d6p-3, 0x1.e66fdap-2, 0x1.d11af8p+0, -0x1.26591ep-3, -0x1.9498ep+0, -0x1.6a5c78p+0, 0x1.95e278p+0, 0x1.ddd0e2p-3, -0x1.b734e4p-1, -0x1.de78f6p-1, 0x1.547614p-1, -0x1.307f7ep-1, 0x1.17903ap-5, -0x1.58647ap-4, -0x1.e938ep+0, 0x1.6a88bap-1, -0x1.0f009ap-4, -0x1.0fb184p+1, -0x1.034864p+1, -0x1.9160dep+0, 0x1.52b3acp-4, -0x1.64b708p+0, 0x1.d771e6p-1, 0x1.f334cap+0, -0x1.d7485cp+0, 0x1.8fe9b8p+0, -0x1.152472p-1, 0x1.d73f2p-3, 0x1.8eb45ep-1, -0x1.8f6524p+0], [-0x1.947e2ap+0, 0x1.0288f8p+1, 0x1.d940ccp+0, 0x1.be6dap-1, 0x1.68f9a8p+0, 0x1.148048p-3, -0x1.2e064ep-2, 0x1.e7c41ep-1, -0x1.db5278p+0, 0x1.74b8dp-1, -0x1.09ea68p+0, 0x1.8053c6p-2, -0x1.e1afb6p-3, 0x1.dbe808p+0, -0x1.1c595ap-1, 0x1.3d520cp+0, -0x1.89988p-1, -0x1.77fd8ep-2, 0x1.b29b08p-1, 0x1.23df2cp+0, -0x1.9341cp-1, 0x1.6ac5c2p-2, 0x1.0b415p+1, 0x1.5315d4p-1, 0x1.6922cap-3, -0x1.71a7a4p+0, -0x1.5f896p-1, -0x1.d1d826p-3, -0x1.c3847ap+0, 0x1.458acep-1, -0x1.3381c6p-1, 0x1.d0bc84p-1, -0x1.f65448p+0, -0x1.8f865ep-3, -0x1.c95858p-1, -0x1.676d84p+0, 0x1.caaf5cp-3, -0x1.da6ce8p+0, -0x1.943c2ap+0, -0x1.31e264p+0, 0x1.73ee72p+0, -0x1.c3e9cap+0, -0x1.811adp+0, 0x1.58bd6ep-1, 0x1.958054p-1, -0x1.3fda8p+0, 0x1.a11458p+0, -0x1.5927b8p-1, 0x1.5911eep-2, -0x1.939ad6p-6, -0x1.e98c2ep+0, 0x1.902f2p+0, -0x1.3057a2p+0, 0x1.58a7ecp-1, 0x1.c669a2p-3, 0x1.01eabp+1, -0x1.325ec2p-2, -0x1.8e3288p-4, -0x1.8e9d32p-2, 0x1.3937dap+0, 0x1.008fd4p-5, 0x1.1dc6e2p+0, -0x1.ddc012p-3, 0x1.01b6fcp+1, -0x1.15352p-1, 0x1.e292f4p-1, 0x1.00291cp+0, 0x1.0ea668p-1, -0x1.b68df4p-4, -0x1.02693ep+1, -0x1.37e2c4p-2, 0x1.9bbffcp+0, -0x1.06dfb8p+1, -0x1.522a9ep+0, -0x1.0d4a7ap+1, -0x1.9d1eb6p+0, -0x1.bfe11cp+0, -0x1.0ce80cp+1, -0x1.2b6348p-1, -0x1.ddf7dp-1, 0x1.fe3b92p-1, 0x1.cbde16p-2, 0x1.94e33ap+0, 0x1.eb865cp+0, -0x1.329f78p+0, 0x1.22af48p+0, 0x1.7c114ep+0, 0x1.fa3f0ep+0, -0x1.6ef11ep-5, -0x1.b623d6p-1, 0x1.b265a8p+0, 0x1.709d6ap-1, -0x1.d2b0dep-3, 0x1.787ec4p+0, -0x1.6167b6p+0, -0x1.04fadcp+1, -0x1.934974p+0, 0x1.a65e3ep+0, -0x1.ed0f6cp+0, -0x1.af1242p-2, -0x1.1e9e9ap+0, -0x1.1ab4d4p-1, -0x1.8a504ap+0, -0x1.27b78p+0, 0x1.243f88p+0, -0x1.05372ap+1, -0x1.07696ap+1, 0x1.c09cfp-1, 0x1.507dcap+0, -0x1.68531cp-1, 0x1.54bb02p-1, -0x1.2f8116p-1, -0x1.3e34a2p+0, -0x1.51f11ap-2, 0x1.269fd8p-5, -0x1.5b4c4ap-1, -0x1.fa359cp+0, -0x1.c5d9e8p-6, 0x1.b9134p-1, 0x1.b5dc3cp-2, 0x1.c3557p-3, 0x1.19712ap-1, 0x1.a7c1b4p-3, 0x1.75d79ap-1, -0x1.025cccp+1, -0x1.252e76p-1, 0x1.0d797p-2, -0x1.c5059ap-3], [0x1.1b1822p+0, 0x1.afb17p-1, -0x1.04a142p-5, -0x1.356c7cp-2, 0x1.f4c6acp-1, 0x1.7c15f8p-4, -0x1.a9f946p-1, 0x1.0722b6p+1, 0x1.094182p+1, -0x1.b33522p+0, -0x1.d7be82p-4, -0x1.21569ep+0, 0x1.6d5944p-3, -0x1.ce386p-1, -0x1.2339f8p+0, 0x1.0c4aaep+0, 0x1.59519cp+0, -0x1.8b1e68p+0, -0x1.7ca65cp-2, -0x1.45a09ap-3, 0x1.755ea2p+0, 0x1.2da51cp+0, 0x1.343616p-2, -0x1.446bc4p-2, 0x1.3bbcd4p-1, -0x1.f6bea2p+0, 0x1.ae3f2cp-1, -0x1.4f18eep-3, -0x1.f198e8p-2, -0x1.d0f17ap+0, -0x1.4a9f9ep+0, -0x1.c3c01ap+0, 0x1.b398e6p-3, -0x1.a3aa06p+0, -0x1.8adceap-1, 0x1.737ecep+0, -0x1.72e5bcp-1, 0x1.03c914p+0, -0x1.eda5ep+0, 0x1.a05cbp-1, 0x1.596c5ep+0, 0x1.408d5ap-1, -0x1.4f93d8p-1, 0x1.e80c3p+0, 0x1.0bb8fcp+1, 0x1.952852p+0, 0x1.61387ep-3, -0x1.f2a65cp-2, -0x1.004108p+1, -0x1.0aa22cp+0, -0x1.7754c6p+0, 0x1.572fd8p+0, 0x1.443d2p-3, 0x1.6c8656p-2, 0x1.d5976ep-2, -0x1.5d3c4ap+0, 0x1.2f5b96p+0, 0x1.081986p+0, -0x1.98b5d6p-2, -0x1.e242dp+0, 0x1.b5fdfap+0, 0x1.f80a7p-1, 0x1.e8a41p+0, 0x1.cd4842p+0, 0x1.38a222p+0, -0x1.6ad4eap+0, 0x1.bf69d6p+0, 0x1.98706ap+0, 0x1.b62fb6p+0, -0x1.342bfep+0, -0x1.478d1ap-1, 0x1.ad91eap+0, 0x1.44b96cp-2, 0x1.a71184p+0, 0x1.1cf0ap-3, -0x1.a18a9ep-1, 0x1.9f7944p+0, 0x1.4bdbdep+0, 0x1.3dc7dap+0, 0x1.da9b56p+0, 0x1.9bdedcp+0, 0x1.fae1fcp-2, -0x1.7d6a78p+0, -0x1.61ac52p+0, 0x1.9caeccp-2, -0x1.380e1ep+0, -0x1.a919f6p-2, -0x1.61caa8p-2, -0x1.f94a84p+0, -0x1.335cep-3, 0x1.05d99ap+1, -0x1.12b20ap+0, -0x1.515b44p+0, -0x1.5daa3cp-2, -0x1.d6ce0ep+0, -0x1.bf68e2p+0, -0x1.a44d5cp+0, 0x1.fcbaccp-1, 0x1.792aeep-1, 0x1.7aee1ep-2, 0x1.2a06e6p+0, -0x1.37c84ep+0, -0x1.04f68ep-4, 0x1.d882acp+0, -0x1.4f0eccp-1, -0x1.8c2c56p+0, 0x1.103a5ep+0, -0x1.c1affcp-2, 0x1.af609ap+0, 0x1.d6cf44p-7, 0x1.70a57p+0, 0x1.b41474p+0, -0x1.d21b2p+0, 0x1.17a194p-1, 0x1.065ee2p+1, -0x1.d313a8p-1, 0x1.d433acp+0, 0x1.ad9abep-3, -0x1.553b86p-2, 0x1.fbe45ep-4, -0x1.e84f4p+0, -0x1.d3bb06p-1, -0x1.78962p+0, -0x1.a05966p-1, -0x1.b81f26p+0, -0x1.f7747cp+0, 0x1.4b20c6p-1, 0x1.af6d3p+0], [-0x1.a466b6p+0, -0x1.df7436p+0, -0x1.28a9bcp-3, -0x1.b775aep+0, 0x1.eee7aep+0, 0x1.ead144p-1, 0x1.6d8574p+0, -0x1.64befcp-1, 0x1.38c8c8p+0, -0x1.50ce02p-1, 0x1.ac2962p+0, 0x1.ab76b4p+0, 0x1.3e63dep+0, -0x1.73b106p+0, -0x1.f64bbap-1, 0x1.0b25bap+1, -0x1.93d2ccp+0, 0x1.415f3p+0, -0x1.0b33d8p-2, 0x1.e94512p+0, 0x1.47264p-4, -0x1.537448p+0, 0x1.3a213cp+0, -0x1.08a844p-2, -0x1.1dd474p-2, -0x1.d7e144p-1, -0x1.db643ap+0, -0x1.a82e5ep-1, -0x1.34b38cp-1, -0x1.6e617p-2, -0x1.8f327cp-1, 0x1.584c1ep+0, 0x1.a14dp-3, 0x1.0e0612p+1, 0x1.9f4e38p+0, 0x1.39577p-7, 0x1.b419f4p-1, -0x1.f70522p+0, -0x1.a8f554p+0, 0x1.217062p+0, 0x1.1f0d4ep-2, -0x1.0e79acp+1, 0x1.560404p+0, 0x1.379f58p+0, -0x1.907218p+0, -0x1.afb90ep+0, -0x1.0021b4p-1, -0x1.5b580ap-4, 0x1.1a474p-1, 0x1.5fa0e8p+0, -0x1.9f1e6cp+0, 0x1.f42414p-2, 0x1.d7021ep+0, -0x1.b44126p+0, -0x1.2be83ap-1, -0x1.77fa2cp+0, -0x1.232c28p+0, -0x1.3a10dap-4, 0x1.255aacp+0, -0x1.885ed8p-1, -0x1.8ac74ap+0, 0x1.85e88p+0, 0x1.7f0582p+0, 0x1.02589p+0, -0x1.30fedap-3, 0x1.09210ap+1, -0x1.532236p-2, 0x1.0a2a2ep+1, 0x1.29ff9p+0, -0x1.bd8feep+0, -0x1.057934p+0, -0x1.049178p+1, 0x1.2777ccp-1, 0x1.6a76bcp+0, -0x1.88cbd2p-3, -0x1.2e9d34p-2, 0x1.9ac1fp-6, 0x1.5568f2p+0, 0x1.5163cep-3, 0x1.d75352p+0, -0x1.7e0f16p+0, -0x1.e53e3p+0, 0x1.be640cp-5, -0x1.8e7124p-2, -0x1.fdd25ep+0, 0x1.0513b2p+1, -0x1.11cb22p+1, -0x1.359524p-1, -0x1.0e0bd4p+0, 0x1.3068a4p+0, -0x1.11e21p+0, -0x1.1ee95ap-1, -0x1.181678p+0, -0x1.80c8bep+0, 0x1.af548p-1, 0x1.f8f418p+0, -0x1.04319ap+0, 0x1.5be22ep+0, 0x1.0f131cp+0, -0x1.1f73e6p-1, 0x1.09b694p+1, -0x1.2b398p+0, 0x1.612b98p+0, -0x1.82bb74p-3, -0x1.1d055ap-5, 0x1.441cd6p+0, 0x1.45ef38p+0, -0x1.cbc6e2p-3, -0x1.36a6c8p+0, -0x1.26173p+0, -0x1.40ea1ep+0, 0x1.1eab5ap+0, -0x1.1acb22p-2, -0x1.5c0914p-2, 0x1.044094p+0, 0x1.3e9306p-1, -0x1.0e4ad4p+0, 0x1.3b663p-2, -0x1.1ab0c2p+0, -0x1.361614p-2, 0x1.1872c8p-2, -0x1.888624p+0, 0x1.e3e9dcp+0, -0x1.7869e6p+0, -0x1.fb88d8p-2, -0x1.9981dcp-3, -0x1.85289p+0, 0x1.7f236ap+0], [-0x1.92aab6p-3, -0x1.e57c5ap+0, 0x1.8ef104p-1, 0x1.cafe34p+0, 0x1.f5ea2p+0, -0x1.3fe11ep+0, -0x1.c4560ep+0, -0x1.760df4p-2, 0x1.9a0b2ap-1, 0x1.100aaep+1, -0x1.416cc8p+0, -0x1.d7436ep+0, -0x1.bd3f3ep-3, 0x1.d47dd4p-1, -0x1.dce0cp+0, 0x1.f03a2ep+0, -0x1.62eda6p-1, 0x1.cbf096p-2, 0x1.737f62p-5, -0x1.59244p-1, 0x1.691adcp+0, -0x1.151954p+0, -0x1.f6d164p+0, 0x1.358142p-1, 0x1.6096f2p+0, -0x1.0e1074p+1, 0x1.e417bap-1, -0x1.8a0fb4p-2, -0x1.0cf9fcp+1, 0x1.116ef4p+1, 0x1.e6e274p-1, 0x1.a21948p+0, -0x1.840d0cp-1, -0x1.091d7p+0, -0x1.7cc98p-2, -0x1.8bb8fp+0, 0x1.4b147p-1, -0x1.7ab0ap+0, -0x1.49f85p+0, 0x1.1df76ap+0, -0x1.a91c14p+0, -0x1.0640e4p+0, 0x1.5c7cf6p-1, 0x1.331e2p-1, -0x1.0bcfccp+1, -0x1.52e216p+0, -0x1.587376p-3, 0x1.d5b442p-5, 0x1.f0fba2p+0, -0x1.6e22aep+0, -0x1.c3c4b8p+0, 0x1.77e26cp-3, 0x1.ff792ep+0, 0x1.013e68p+1, 0x1.1d9dp+0, 0x1.3a742cp-2, 0x1.97253p-1, 0x1.cf539ap-5, -0x1.52dcecp+0, -0x1.5faf78p+0, 0x1.c33952p+0, -0x1.9246bp-1, -0x1.43dbeap+0, -0x1.9269ep+0, -0x1.31c2f8p-11, 0x1.a4762ap-2, 0x1.11f3dap+1, -0x1.8172b8p-1, 0x1.86184p-1, -0x1.3c8eaap-1, 0x1.c6bc08p+0, 0x1.0fe82p+1, 0x1.59d678p+0, -0x1.c3099ep-4, 0x1.e27af4p-3, -0x1.a5dbbap+0, -0x1.c1e0fep+0, -0x1.da55cep-1, -0x1.e76882p+0, -0x1.34a4ep-1, -0x1.9eaafcp-1, 0x1.909f72p+0, 0x1.65566p+0, 0x1.178458p+0, -0x1.4bb444p+0, -0x1.2bf064p-2, -0x1.cc5c28p+0, -0x1.28b57ap-2, -0x1.ddf974p+0, -0x1.294782p+0, -0x1.0e4ep+1, -0x1.1f82dap-1, -0x1.8f7492p+0, -0x1.c1846ap-2, 0x1.cc921ap+0, 0x1.eedc8ap-3, -0x1.e9ec78p+0, 0x1.d5574ep-2, -0x1.b08cf2p+0, 0x1.1927bp-2, -0x1.b2f358p-2, -0x1.0b16b6p+0, -0x1.d25178p+0, 0x1.f878b2p+0, 0x1.a66138p-1, -0x1.fff22cp-2, -0x1.d4b656p+0, 0x1.05d94cp+1, 0x1.d5fbfep+0, 0x1.78719ep-2, 0x1.d88f8ep-3, 0x1.00cc1ep+1, -0x1.b5213ap+0, 0x1.762c16p-1, -0x1.ec9e78p-2, 0x1.5b8562p-2, 0x1.11562p+0, -0x1.d16728p-1, 0x1.56a7e4p-2, 0x1.1b6d7ep-1, 0x1.ea6618p+0, 0x1.03f69cp+1, -0x1.037bbap+1, 0x1.1fe5dp-1, 0x1.6952cp+0, -0x1.bc92d4p+0, 0x1.67ae22p+0, 0x1.50676p+0], [0x1.d53a46p+0, 0x1.e00c9ap-1, -0x1.992732p+0, -0x1.afd0b4p-1, -0x1.02b478p-3, -0x1.6b4b3ep-1, 0x1.438ab8p-2, -0x1.7ddb26p+0, 0x1.aaa502p+0, 0x1.99173p+0, 0x1.81fd8cp-7, -0x1.0c12bep+0, 0x1.0cdbb6p+0, 0x1.d17ec8p-3, -0x1.9a9f58p+0, -0x1.c7817cp-1, -0x1.292f1p+0, -0x1.128f64p+1, 0x1.2161a2p+0, -0x1.cd8122p-1, 0x1.3b8bb2p-2, 0x1.d1efc2p+0, -0x1.32ed56p+0, 0x1.9ce8aep-1, -0x1.406742p+0, -0x1.8a22d6p-3, -0x1.182154p-4, 0x1.a0b5eap+0, 