program(1.3)
[buildInfo = dict<string, string>({{"coremlc-component-MIL", "3510.2.1"}, {"coremlc-version", "3500.32.1"}})]
{
    func main<ios19>(tensor<fp32, [1, 32]> x) {
            tensor<fp32, [32, 32]> wa_0 = const()[name = string("wa_0"), val = tensor<fp32, [32, 32]>([[0x1p+0, 0x1p+1, 0x1.8p+1, 0x1p+2, 0x1.4p+2, 0x1.8p+2, 0x1.cp+2, 0x1p+3, 0x1.2p+3, 0x1.4p+3, 0x1.6p+3, 0x1.8p+3, 0x1.ap+3, 0x1.cp+3, 0x1.ep+3, 0x1p+4, 0x1.1p+4, 0x1.2p+4, 0x1.3p+4, 0x1.4p+4, 0x1.5p+4, 0x1.6p+4, 0x1.7p+4, 0x1.8p+4, 0x1.9p+4, 0x1.ap+4, 0x1.bp+4, 0x1.cp+4, 0x1.dp+4, 0x1.ep+4, 0x1.fp+4, 0x1p+5], [0x1.08p+5, 0x1.1p+5, 0x1.18p+5, 0x1.2p+5, 0x1.28p+5, 0x1.3p+5, 0x1.38p+5, 0x1.4p+5, 0x1.48p+5, 0x1.5p+5, 0x1.58p+5, 0x1.6p+5, 0x1.68p+5, 0x1.7p+5, 0x1.78p+5, 0x1.8p+5, 0x1.88p+5, 0x1.9p+5, 0x1.98p+5, 0x1.ap+5, 0x1.a8p+5, 0x1.bp+5, 0x1.b8p+5, 0x1.cp+5, 0x1.c8p+5, 0x1.dp+5, 0x1.d8p+5, 0x1.ep+5, 0x1.e8p+5, 0x1.fp+5, 0x1.f8p+5, 0x1p+6], [0x1.04p+6, 0x1.08p+6, 0x1.0cp+6, 0x1.1p+6, 0x1.14p+6, 0x1.18p+6, 0x1.1cp+6, 0x1.2p+6, 0x1.24p+6, 0x1.28p+6, 0x1.2cp+6, 0x1.3p+6, 0x1.34p+6, 0x1.38p+6, 0x1.3cp+6, 0x1.4p+6, 0x1.44p+6, 0x1.48p+6, 0x1.4cp+6, 0x1.5p+6, 0x1.54p+6, 0x1.58p+6, 0x1.5cp+6, 0x1.6p+6, 0x1.64p+6, 0x1.68p+6, 0x1.6cp+6, 0x1.7p+6, 0x1.74p+6, 0x1.78p+6, 0x1.7cp+6, 0x1.8p+6], [0x1.84p+6, 0x1.88p+6, 0x1.8cp+6, 0x1.9p+6, 0x1.94p+6, 0x1.98p+6, 0x1.9cp+6, 0x1.ap+6, 0x1.a4p+6, 0x1.a8p+6, 0x1.acp+6, 0x1.bp+6, 0x1.b4p+6, 0x1.b8p+6, 0x1.bcp+6, 0x1.cp+6, 0x1.c4p+6, 0x1.c8p+6, 0x1.ccp+6, 0x1.dp+6, 0x1.d4p+6, 0x1.d8p+6, 0x1.dcp+6, 0x1.ep+6, 0x1.e4p+6, 0x1.e8p+6, 0x1.ecp+6, 0x1.fp+6, 0x1.f4p+6, 0x1.f8p+6, 0x1.fcp+6, 0x1p+7], [0x1.02p+7, 0x1.04p+7, 0x1.06p+7, 0x1.08p+7, 0x1.0ap+7, 0x1.0cp+7, 0x1.0ep+7, 0x1.1p+7, 0x1.12p+7, 0x1.14p+7, 0x1.16p+7, 0x1.18p+7, 0x1.1ap+7, 0x1.1cp+7, 0x1.1ep+7, 0x1.2p+7, 0x1.22p+7, 0x1.24p+7, 0x1.26p+7, 0x1.28p+7, 0x1.2ap+7, 0x1.2cp+7, 0x1.2ep+7, 0x1.3p+7, 0x1.32p+7, 0x1.34p+7, 0x1.36p+7, 0x1.38p+7, 0x1.3ap+7, 0x1.3cp+7, 0x1.3ep+7, 0x1.4p+7], [0x1.42p+7, 0x1.44p+7, 0x1.46p+7, 0x1.48p+7, 0x1.4ap+7, 0x1.4cp+7, 0x1.4ep+7, 0x1.5p+7, 0x1.52p+7, 0x1.54p+7, 0x1.56p+7, 0x1.58p+7, 0x1.5ap+7, 0x1.5cp+7, 0x1.5ep+7, 0x1.6p+7, 0x1.62p+7, 0x1.64p+7, 0x1.66p+7, 0x1.68p+7, 0x1.6ap+7, 0x1.6cp+7, 0x1.6ep+7, 0x1.7p+7, 0x1.72p+7, 0x1.74p+7, 0x1.76p+7, 0x1.78p+7, 0x1.7ap+7, 0x1.7cp+7, 0x1.7ep+7, 0x1.8p+7], [0x1.82p+7, 0x1.84p+7, 0x1.86p+7, 0x1.88p+7, 0x1.8ap+7, 0x1.8cp+7, 0x1.8ep+7, 0x1.9p+7, 0x1.92p+7, 0x1.94p+7, 0x1.96p+7, 0x1.98p+7, 0x1.9ap+7, 0x1.9cp+7, 0x1.9ep+7, 0x1.ap+7, 0x1.a2p+7, 0x1.a4p+7, 0x1.a6p+7, 0x1.a8p+7, 0x1.aap+7, 0x1.acp+7, 0x1.aep+7, 0x1.bp+7, 0x1.b2p+7, 0x1.b4p+7, 0x1.b6p+7, 0x1.b8p+7, 0x1.bap+7, 0x1.bcp+7, 0x1.bep+7, 0x1.cp+7], [0x1.c2p+7, 0x1.c4p+7, 0x1.c6p+7, 0x1.c8p+7, 0x1.cap+7, 0x1.ccp+7, 0x1.cep+7, 0x1.dp+7, 0x1.d2p+7, 0x1.d4p+7, 0x1.d6p+7, 0x1.d8p+7, 0x1.dap+7, 0x1.dcp+7, 0x1.dep+7, 0x1.ep+7, 0x1.e2p+7, 0x1.e4p+7, 0x1.e6p+7, 0x1.e8p+7, 0x1.eap+7, 0x1.ecp+7, 0x1.eep+7, 0x1.fp+7, 0x1.f2p+7, 0x1.f4p+7, 0x1.f6p+7, 0x1.f8p+7, 0x1.fap+7, 0x1.fcp+7, 0x1.fep+7, 0x1p+8], [0x1.01p+8, 0x1.02p+8, 0x1.03p+8, 0x1.04p+8, 0x1.05p+8, 0x1.06p+8, 0x1.07p+8, 0x1.08p+8, 0x1.09p+8, 0x1.0ap+8, 0x1.0bp+8, 0x1.0cp+8, 0x1.0dp+8, 0x1.0ep+8, 0x1.0fp+8, 0x1.1p+8, 0x1.11p+8, 0x1.12p+8, 0x1.13p+8, 0x1.14p+8, 0x1.15p+8, 0x1.16p+8, 0x1.17p+8, 0x1.18p+8, 0x1.19p+8, 0x1.1ap+8, 0x1.1bp+8, 0x1.1cp+8, 0x1.1dp+8, 0x1.1ep+8, 0x1.1fp+8, 0x1.2p+8], [0x1.21p+8, 0x1.22p+8, 0x1.23p+8, 0x1.24p+8, 0x1.25p+8, 0x1.26p+8, 0x1.27p+8, 0x1.28p+8, 0x1.29p+8, 0x1.2ap+8, 0x1.2bp+8, 0x1.2cp+8, 0x1.2dp+8, 0x1.2ep+8, 0x1.2fp+8, 0x1.3p+8, 0x1.31p+8, 0x1.32p+8, 0x1.33p+8, 0x1.34p+8, 0x1.35p+8, 0x1.36p+8, 0x1.37p+8, 0x1.38p+8, 0x1.39p+8, 0x1.3ap+8, 0x1.3bp+8, 0x1.3cp+8, 0x1.3dp+8, 0x1.3ep+8, 0x1.3fp+8, 0x1.4p+8], [0x1.41p+8, 0x1.42p+8, 0x1.43p+8, 0x1.44p+8, 0x1.45p+8, 0x1.46p+8, 0x1.47p+8, 0x1.48p+8, 0x1.49p+8, 0x1.4ap+8, 0x1.4bp+8, 0x1.4cp+8, 0x1.4dp+8, 0x1.4ep+8, 0x1.4fp+8, 0x1.5p+8, 0x1.51p+8, 0x1.52p+8, 0x1.53p+8, 0x1.54p+8, 0x1.55p+8, 0x1.56p+8, 0x1.57p+8, 0x1.58p+8, 0x1.59p+8, 0x1.5ap+8, 0x1.5bp+8, 0x1.5cp+8, 0x1.5dp+8, 0x1.5ep+8, 0x1.5fp+8, 0x1.6p+8], [0x1.61p+8, 0x1.62p+8, 0x1.63p+8, 0x1.64p+8, 0x1.65p+8, 0x1.66p+8, 0x1.67p+8, 0x1.68p+8, 0x1.69p+8, 0x1.6ap+8, 0x1.6bp+8, 0x1.6cp+8, 0x1.6dp+8, 0x1.6ep+8, 0x1.6fp+8, 0x1.7p+8, 0x1.71p+8, 0x1.72p+8, 0x1.73p+8, 0x1.74p+8, 0x1.75p+8, 0x1.76p+8, 0x1.77p+8, 0x1.78p+8, 0x1.79p+8, 0x1.7ap+8, 0x1.7bp+8, 0x1.7cp+8, 0x1.7dp+8, 0x1.7ep+8, 0x1.7fp+8, 0x1.8p+8], [0x1.81p+8, 0x1.82p+8, 0x1.83p+8, 0x1.84p+8, 0x1.85p+8, 0x1.86p+8, 0x1.87p+8, 0x1.88p+8, 0x1.89p+8, 0x1.8ap+8, 0x1.8bp+8, 0x1.8cp+8, 0x1.8dp+8, 0x1.8ep+8, 0x1.8fp+8, 0x1.9p+8, 0x1.91p+8, 0x1.92p+8, 0x1.93p+8, 0x1.94p+8, 0x1.95p+8, 0x1.96p+8, 0x1.97p+8, 0x1.98p+8, 0x1.99p+8, 0x1.9ap+8, 0x1.9bp+8, 0x1.9cp+8, 0x1.9dp+8, 0x1.9ep+8, 0x1.9fp+8, 0x1.ap+8], [0x1.a1p+8, 0x1.a2p+8, 0x1.a3p+8, 0x1.a4p+8, 0x1.a5p+8, 0x1.a6p+8, 0x1.a7p+8, 0x1.a8p+8, 0x1.a9p+8, 0x1.aap+8, 0x1.abp+8, 0x1.acp+8, 0x1.adp+8, 0x1.aep+8, 0x1.afp+8, 0x1.bp+8, 0x1.b1p+8, 0x1.b2p+8, 0x1.b3p+8, 0x1.b4p+8, 0x1.b5p+8, 0x1.b6p+8, 0x1.b7p+8, 0x1.b8p+8, 0x1.b9p+8, 0x1.bap+8, 0x1.bbp+8, 0x1.bcp+8, 0x1.bdp+8, 0x1.bep+8, 0x1.bfp+8, 0x1.cp+8], [0x1.c1p+8, 0x1.c2p+8, 0x1.c3p+8, 0x1.c4p+8, 0x1.c5p+8, 0x1.c6p+8, 0x1.c7p+8, 0x1.c8p+8, 0x1.c9p+8, 0x1.cap+8, 0x1.cbp+8, 0x1.ccp+8, 0x1.cdp+8, 0x1.cep+8, 0x1.cfp+8, 0x1.dp+8, 0x1.d1p+8, 0x1.d2p+8, 0x1.d3p+8, 0x1.d4p+8, 0x1.d5p+8, 0x1.d6p+8, 0x1.d7p+8, 0x1.d8p+8, 0x1.d9p+8, 0x1.dap+8, 0x1.dbp+8, 0x1.dcp+8, 0x1.ddp+8, 0x1.dep+8, 0x1.dfp+8, 0x1.ep+8], [0x1.e1p+8, 0x1.e2p+8, 0x1.e3p+8, 0x1.e4p+8, 0x1.e5p+8, 0x1.e6p+8, 0x1.e7p+8, 0x1.e8p+8, 0x1.e9p+8, 0x1.eap+8, 0x1.ebp+8, 0x1.ecp+8, 0x1.edp+8, 0x1.eep+8, 0x1.efp+8, 0x1.fp+8, 0x1.f1p+8, 0x1.f2p+8, 0x1.f3p+8, 0x1.f4p+8, 0x1.f5p+8, 0x1.f6p+8, 0x1.f7p+8, 0x1.f8p+8, 0x1.f9p+8, 0x1.fap+8, 0x1.fbp+8, 0x1.fcp+8, 0x1.fdp+8, 0x1.fep+8, 0x1.ffp+8, 0x1p+9], [0x1.008p+9, 0x1.01p+9, 0x1.018p+9, 0x1.02p+9, 0x1.028p+9, 0x1.03p+9, 0x1.038p+9, 0x1.04p+9, 0x1.048p+9, 0x1.05p+9, 0x1.058p+9, 0x1.06p+9, 0x1.068p+9, 0x1.07p+9, 0x1.078p+9, 0x1.08p+9, 0x1.088p+9, 0x1.09p+9, 0x1.098p+9, 0x1.0ap+9, 0x1.0a8p+9, 0x1.0bp+9, 0x1.0b8p+9, 0x1.0cp+9, 0x1.0c8p+9, 0x1.0dp+9, 0x1.0d8p+9, 0x1.0ep+9, 0x1.0e8p+9, 0x1.0fp+9, 0x1.0f8p+9, 0x1.1p+9], [0x1.108p+9, 0x1.11p+9, 0x1.118p+9, 0x1.12p+9, 0x1.128p+9, 0x1.13p+9, 0x1.138p+9, 0x1.14p+9, 0x1.148p+9, 0x1.15p+9, 0x1.158p+9, 0x1.16p+9, 0x1.168p+9, 0x1.17p+9, 0x1.178p+9, 0x1.18p+9, 0x1.188p+9, 0x1.19p+9, 0x1.198p+9, 0x1.1ap+9, 0x1.1a8p+9, 0x1.1bp+9, 0x1.1b8p+9, 0x1.1cp+9, 0x1.1c8p+9, 0x1.1dp+9, 0x1.1d8p+9, 0x1.1ep+9, 0x1.1e8p+9, 0x1.1fp+9, 0x1.1f8p+9, 0x1.2p+9], [0x1.208p+9, 0x1.21p+9, 0x1.218p+9, 0x1.22p+9, 0x1.228p+9, 0x1.23p+9, 0x1.238p+9, 0x1.24p+9, 0x1.248p+9, 0x1.25p+9, 0x1.258p+9, 0x1.26p+9, 0x1.268p+9, 0x1.27p+9, 0x1.278p+9, 0x1.28p+9, 0x1.288p+9, 0x1.29p+9, 0x1.298p+9, 0x1.2ap+9, 0x1.2a8p+9, 0x1.2bp+9, 0x1.2b8p+9, 0x1.2cp+9, 0x1.2c8p+9, 0x1.2dp+9, 0x1.2d8p+9, 0x1.2ep+9, 0x1.2e8p+9, 0x1.2fp+9, 0x1.2f8p+9, 0x1.3p+9], [0x1.308p+9, 0x1.31p+9, 0x1.318p+9, 0x1.32p+9, 0x1.328p+9, 0x1.33p+9, 0x1.338p+9, 0x1.34p+9, 0x1.348p+9, 0x1.35p+9, 0x1.358p+9, 0x1.36p+9, 0x1.368p+9, 0x1.37p+9, 0x1.378p+9, 0x1.38p+9, 0x1.388p+9, 0x1.39p+9, 0x1.398p+9, 0x1.3ap+9, 0x1.3a8p+9, 0x1.3bp+9, 0x1.3b8p+9, 0x1.3cp+9, 0x1.3c8p+9, 0x1.3dp+9, 0x1.3d8p+9, 0x1.3ep+9, 0x1.3e8p+9, 0x1.3fp+9, 0x1.3f8p+9, 0x1.4p+9], [0x1.408p+9, 0x1.41p+9, 0x1.418p+9, 0x1.42p+9, 0x1.428p+9, 0x1.43p+9, 0x1.438p+9, 0x1.44p+9, 0x1.448p+9, 0x1.45p+9, 0x1.458p+9, 0x1.46p+9, 0x1.468p+9, 0x1.47p+9, 0x1.478p+9, 0x1.48p+9, 0x1.488p+9, 0x1.49p+9, 0x1.498p+9, 0x1.4ap+9, 0x1.4a8p+9, 0x1.4bp+9, 0x1.4b8p+9, 0x1.4cp+9, 0x1.4c8p+9, 0x1.4dp+9, 0x1.4d8p+9, 0x1.4ep+9, 0x1.4e8p+9, 0x1.4fp+9, 0x1.4f8p+9, 0x1.5p+9], [0x1.508p+9, 0x1.51p+9, 0x1.518p+9, 0x1.52p+9, 0x1.528p+9, 0x1.53p+9, 0x1.538p+9, 0x1.54p+9, 0x1.548p+9, 0x1.55p+9, 0x1.558p+9, 0x1.56p+9, 0x1.568p+9, 0x1.57p+9, 0x1.578p+9, 0x1.58p+9, 0x1.588p+9, 0x1.59p+9, 0x1.598p+9, 0x1.5ap+9, 0x1.5a8p+9, 0x1.5bp+9, 0x1.5b8p+9, 0x1.5cp+9, 0x1.5c8p+9, 0x1.5dp+9, 0x1.5d8p+9, 0x1.5ep+9, 0x1.5e8p+9, 0x1.5fp+9, 0x1.5f8p+9, 0x1.6p+9], [0x1.608p+9, 0x1.61p+9, 0x1.618p+9, 0x1.62p+9, 0x1.628p+9, 0x1.63p+9, 0x1.638p+9, 0x1.64p+9, 0x1.648p+9, 0x1.65p+9, 0x1.658p+9, 0x1.66p+9, 0x1.668p+9, 0x1.67p+9, 0x1.678p+9, 0x1.68p+9, 0x1.688p+9, 0x1.69p+9, 0x1.698p+9, 0x1.6ap+9, 0x1.6a8p+9, 0x1.6bp+9, 0x1.6b8p+9, 0x1.6cp+9, 0x1.6c8p+9, 0x1.6dp+9, 0x1.6d8p+9, 0x1.6ep+9, 0x1.6e8p+9, 0x1.6fp+9, 0x1.6f8p+9, 0x1.7p+9], [0x1.708p+9, 0x1.71p+9, 0x1.718p+9, 0x1.72p+9, 0x1.728p+9, 0x1.73p+9, 0x1.738p+9, 0x1.74p+9, 0x1.748p+9, 0x1.75p+9, 0x1.758p+9, 0x1.76p+9, 0x1.768p+9, 0x1.77p+9, 0x1.778p+9, 0x1.78p+9, 0x1.788p+9, 0x1.79p+9, 0x1.798p+9, 0x1.7ap+9, 0x1.7a8p+9, 0x1.7bp+9, 0x1.7b8p+9, 0x1.7cp+9, 0x1.7c8p+9, 0x1.7dp+9, 0x1.7d8p+9, 0x1.7ep+9, 0x1.7e8p+9, 0x1.7fp+9, 0x1.7f8p+9, 0x1.8p+9], [0x1.808p+9, 0x1.81p+9, 0x1.818p+9, 0x1.82p+9, 0x1.828p+9, 0x1.83p+9, 0x1.838p+9, 0x1.84p+9, 0x1.848p+9, 0x1.85p+9, 0x1.858p+9, 0x1.86p+9, 0x1.868p+9, 0x1.87p+9, 0x1.878p+9, 0x1.88p+9, 0x1.888p+9, 0x1.89p+9, 0x1.898p+9, 0x1.8ap+9, 0x1.8a8p+9, 0x1.8bp+9, 0x1.8b8p+9, 0x1.8cp+9, 0x1.8c8p+9, 0x1.8dp+9, 0x1.8d8p+9, 0x1.8ep+9, 0x1.8e8p+9, 0x1.8fp+9, 0x1.8f8p+9, 0x1.9p+9], [0x1.908p+9, 0x1.91p+9, 0x1.918p+9, 0x1.92p+9, 0x1.928p+9, 0x1.93p+9, 0x1.938p+9, 0x1.94p+9, 0x1.948p+9, 0x1.95p+9, 0x1.958p+9, 0x1.96p+9, 0x1.968p+9, 0x1.97p+9, 0x1.978p+9, 0x1.98p+9, 0x1.988p+9, 0x1.99p+9, 0x1.998p+9, 0x1.9ap+9, 0x1.9a8p+9, 0x1.9bp+9, 0x1.9b8p+9, 0x1.9cp+9, 0x1.9c8p+9, 0x1.9dp+9, 0x1.9d8p+9, 0x1.9ep+9, 0x1.9e8p+9, 0x1.9fp+9, 0x1.9f8p+9, 0x1.ap+9], [0x1.a08p+9, 0x1.a1p+9, 0x1.a18p+9, 0x1.a2p+9, 0x1.a28p+9, 0x1.a3p+9, 0x1.a38p+9, 0x1.a4p+9, 0x1.a48p+9, 0x1.a5p+9, 0x1.a58p+9, 0x1.a6p+9, 0x1.a68p+9, 0x1.a7p+9, 0x1.a78p+9, 0x1.a8p+9, 0x1.a88p+9, 0x1.a9p+9, 0x1.a98p+9, 0x1.aap+9, 0x1.aa8p+9, 0x1.abp+9, 0x1.ab8p+9, 0x1.acp+9, 0x1.ac8p+9, 0x1.adp+9, 0x1.ad8p+9, 0x1.aep+9, 0x1.ae8p+9, 0x1.afp+9, 0x1.af8p+9, 0x1.bp+9], [0x1.b08p+9, 0x1.b1p+9, 0x1.b18p+9, 0x1.b2p+9, 0x1.b28p+9, 0x1.b3p+9, 0x1.b38p+9, 0x1.b4p+9, 0x1.b48p+9, 0x1.b5p+9, 0x1.b58p+9, 0x1.b6p+9, 0x1.b68p+9, 0x1.b7p+9, 0x1.b78p+9, 0x1.b8p+9, 0x1.b88p+9, 0x1.b9p+9, 0x1.b98p+9, 0x1.bap+9, 0x1.ba8p+9, 0x1.bbp+9, 0x1.bb8p+9, 0x1.bcp+9, 0x1.bc8p+9, 0x1.bdp+9, 0x1.bd8p+9, 0x1.bep+9, 0x1.be8p+9, 0x1.bfp+9, 0x1.bf8p+9, 0x1.cp+9], [0x1.c08p+9, 0x1.c1p+9, 0x1.c18p+9, 0x1.c2p+9, 0x1.c28p+9, 0x1.c3p+9, 0x1.c38p+9, 0x1.c4p+9, 0x1.c48p+9, 0x1.c5p+9, 0x1.c58p+9, 0x1.c6p+9, 0x1.c68p+9, 0x1.c7p+9, 0x1.c78p+9, 0x1.c8p+9, 0x1.c88p+9, 0x1.c9p+9, 0x1.c98p+9, 0x1.cap+9, 0x1.ca8p+9, 0x1.cbp+9, 0x1.cb8p+9, 0x1.ccp+9, 0x1.cc8p+9, 0x1.cdp+9, 0x1.cd8p+9, 0x1.cep+9, 0x1.ce8p+9, 0x1.cfp+9, 0x1.cf8p+9, 0x1.dp+9], [0x1.d08p+9, 0x1.d1p+9, 0x1.d18p+9, 0x1.d2p+9, 0x1.d28p+9, 0x1.d3p+9, 0x1.d38p+9, 0x1.d4p+9, 0x1.d48p+9, 0x1.d5p+9, 0x1.d58p+9, 0x1.d6p+9, 0x1.d68p+9, 0x1.d7p+9, 0x1.d78p+9, 0x1.d8p+9, 0x1.d88p+9, 0x1.d9p+9, 0x1.d98p+9, 0x1.dap+9, 0x1.da8p+9, 0x1.dbp+9, 0x1.db8p+9, 0x1.dcp+9, 0x1.dc8p+9, 0x1.ddp+9, 0x1.dd8p+9, 0x1.dep+9, 0x1.de8p+9, 0x1.dfp+9, 0x1.df8p+9, 0x1.ep+9], [0x1.e08p+9, 0x1.e1p+9, 0x1.e18p+9, 0x1.e2p+9, 0x1.e28p+9, 0x1.e3p+9, 0x1.e38p+9, 0x1.e4p+9, 0x1.e48p+9, 0x1.e5p+9, 0x1.e58p+9, 0x1.e6p+9, 0x1.e68p+9, 0x1.e7p+9, 0x1.e78p+9, 0x1.e8p+9, 0x1.e88p+9, 0x1.e9p+9, 0x1.e98p+9, 0x1.eap+9, 0x1.ea8p+9, 0x1.ebp+9, 0x1.eb8p+9, 0x1.ecp+9, 0x1.ec8p+9, 0x1.edp+9, 0x1.ed8p+9, 0x1.eep+9, 0x1.ee8p+9, 0x1.efp+9, 0x1.ef8p+9, 0x1.fp+9], [0x1.f08p+9, 0x1.f1p+9, 0x1.f18p+9, 0x1.f2p+9, 0x1.f28p+9, 0x1.f3p+9, 0x1.f38p+9, 0x1.f4p+9, 0x1.f48p+9, 0x1.f5p+9, 0x1.f58p+9, 0x1.f6p+9, 0x1.f68p+9, 0x1.f7p+9, 0x1.f78p+9, 0x1.f8p+9, 0x1.f88p+9, 0x1.f9p+9, 0x1.f98p+9, 0x1.fap+9, 0x1.fa8p+9, 0x1.fbp+9, 0x1.fb8p+9, 0x1.fcp+9, 0x1.fc8p+9, 0x1.fdp+9, 0x1.fd8p+9, 0x1.fep+9, 0x1.fe8p+9, 0x1.ffp+9, 0x1.ff8p+9, 0x1p+10]])];
            tensor<fp32, [32, 32]> wb_1 = const()[name = string("wb_1"), val = tensor<fp32, [32, 32]>([[0x1.4p+2, 0x1.8p+2, 0x1.cp+2, 0x1p+3, 0x1.2p+3, 0x1.4p+3, 0x1.6p+3, 0x1.8p+3, 0x1.ap+3, 0x1.cp+3, 0x1.ep+3, 0x1p+4, 0x1.1p+4, 0x1.2p+4, 0x1.3p+4, 0x1.4p+4, 0x1.5p+4, 0x1.6p+4, 0x1.7p+4, 0x1.8p+4, 0x1.9p+4, 0x1.ap+4, 0x1.bp+4, 0x1.cp+4, 0x1.dp+4, 0x1.ep+4, 0x1.fp+4, 0x1p+5, 0x1.08p+5, 0x1.1p+5, 0x1.18p+5, 0x1.2p+5], [0x1.28p+5, 0x1.3p+5, 0x1.38p+5, 0x1.4p+5, 0x1.48p+5, 0x1.5p+5, 0x1.58p+5, 0x1.6p+5, 0x1.68p+5, 0x1.7p+5, 0x1.78p+5, 0x1.8p+5, 0x1.88p+5, 0x1.9p+5, 0x1.98p+5, 0x1.ap+5, 0x1.a8p+5, 0x1.bp+5, 0x1.b8p+5, 0x1.cp+5, 0x1.c8p+5, 0x1.dp+5, 0x1.d8p+5, 0x1.ep+5, 0x1.e8p+5, 0x1.fp+5, 0x1.f8p+5, 0x1p+6, 0x1.04p+6, 0x1.08p+6, 0x1.0cp+6, 0x1.1p+6], [0x1.14p+6, 0x1.18p+6, 0x1.1cp+6, 0x1.2p+6, 0x1.24p+6, 0x1.28p+6, 0x1.2cp+6, 0x1.3p+6, 0x1.34p+6, 0x1.38p+6, 0x1.3cp+6, 0x1.4p+6, 0x1.44p+6, 0x1.48p+6, 0x1.4cp+6, 0x1.5p+6, 0x1.54p+6, 0x1.58p+6, 0x1.5cp+6, 0x1.6p+6, 0x1.64p+6, 0x1.68p+6, 0x1.6cp+6, 0x1.7p+6, 0x1.74p+6, 0x1.78p+6, 0x1.7cp+6, 0x1.8p+6, 0x1.84p+6, 0x1.88p+6, 0x1.8cp+6, 0x1.9p+6], [0x1.94p+6, 0x1.98p+6, 0x1.9cp+6, 0x1.ap+6, 0x1.a4p+6, 0x1.a8p+6, 0x1.acp+6, 0x1.bp+6, 0x1.b4p+6, 0x1.b8p+6, 0x1.bcp+6, 0x1.cp+6, 0x1.c4p+6, 0x1.c8p+6, 0x1.ccp+6, 0x1.dp+6, 0x1.d4p+6, 0x1.d8p+6, 0x1.dcp+6, 0x1.ep+6, 0x1.e4p+6, 0x1.e8p+6, 0x1.ecp+6, 0x1.fp+6, 0x1.f4p+6, 0x1.f8p+6, 0x1.fcp+6, 0x1p+7, 0x1.02p+7, 0x1.04p+7, 0x1.06p+7, 0x1.08p+7], [0x1.0ap+7, 0x1.0cp+7, 0x1.0ep+7, 0x1.1p+7, 0x1.12p+7, 0x1.14p+7, 0x1.16p+7, 0x1.18p+7, 0x1.1ap+7, 0x1.1cp+7, 0x1.1ep+7, 0x1.2p+7, 0x1.22p+7, 0x1.24p+7, 0x1.26p+7, 0x1.28p+7, 0x1.2ap+7, 0x1.2cp+7, 0x1.2ep+7, 0x1.3p+7, 0x1.32p+7, 0x1.34p+7, 0x1.36p+7, 0x1.38p+7, 0x1.3ap+7, 0x1.3cp+7, 0x1.3ep+7, 0x1.4p+7, 0x1.42p+7, 0x1.44p+7, 0x1.46p+7, 0x1.48p+7], [0x1.4ap+7, 0x1.4cp+7, 0x1.4ep+7, 0x1.5p+7, 0x1.52p+7, 0x1.54p+7, 0x1.56p+7, 0x1.58p+7, 0x1.5ap+7, 0x1.5cp+7, 0x1.5ep+7, 0x1.6p+7, 0x1.62p+7, 0x1.64p+7, 0x1.66p+7, 0x1.68p+7, 0x1.6ap+7, 0x1.6cp+7, 0x1.6ep+7, 0x1.7p+7, 0x1.72p+7, 0x1.74p+7, 0x1.76p+7, 0x1.78p+7, 0x1.7ap+7, 0x1.7cp+7, 0x1.7ep+7, 0x1.8p+7, 0x1.82p+7, 0x1.84p+7, 0x1.86p+7, 0x1.88p+7], [0x1.8ap+7, 0x1.8cp+7, 0x1.8ep+7, 0x1.9p+7, 0x1.92p+7, 0x1.94p+7, 0x1.96p+7, 0x1.98p+7, 0x1.9ap+7, 0x1.9cp+7, 0x1.9ep+7, 0x1.ap+7, 0x1.a2p+7, 0x1.a4p+7, 0x1.a6p+7, 0x1.a8p+7, 0x1.aap+7, 0x1.acp+7, 0x1.aep+7, 0x1.bp+7, 0x1.b2p+7, 0x1.b4p+7, 0x1.b6p+7, 0x1.b8p+7, 0x1.bap+7, 0x1.bcp+7, 0x1.bep+7, 0x1.cp+7, 0x1.c2p+7, 0x1.c4p+7, 0x1.c6p+7, 0x1.c8p+7], [0x1.cap+7, 0x1.ccp+7, 0x1.cep+7, 0x1.dp+7, 0x1.d2p+7, 0x1.d4p+7, 0x1.d6p+7, 0x1.d8p+7, 0x1.dap+7, 0x1.dcp+7, 0x1.dep+7, 0x1.ep+7, 0x1.e2p+7, 0x1.e4p+7, 0x1.e6p+7, 0x1.e8p+7, 0x1.eap+7, 0x1.ecp+7, 0x1.eep+7, 0x1.fp+7, 0x1.f2p+7, 0x1.f4p+7, 0x1.f6p+7, 0x1.f8p+7, 0x1.fap+7, 0x1.fcp+7, 0x1.fep+7, 0x1p+8, 0x1.01p+8, 0x1.02p+8, 0x1.03p+8, 0x1.04p+8], [0x1.05p+8, 0x1.06p+8, 0x1.07p+8, 0x1.08p+8, 0x1.09p+8, 0x1.0ap+8, 0x1.0bp+8, 0x1.0cp+8, 0x1.0dp+8, 0x1.0ep+8, 0x1.0fp+8, 0x1.1p+8, 0x1.11p+8, 0x1.12p+8, 0x1.13p+8, 0x1.14p+8, 0x1.15p+8, 0x1.16p+8, 0x1.17p+8, 0x1.18p+8, 0x1.19p+8, 0x1.1ap+8, 0x1.1bp+8, 0x1.1cp+8, 0x1.1dp+8, 0x1.1ep+8, 0x1.1fp+8, 0x1.2p+8, 0x1.21p+8, 0x1.22p+8, 0x1.23p+8, 0x1.24p+8], [0x1.25p+8, 0x1.26p+8, 0x1.27p+8, 0x1.28p+8, 0x1.29p+8, 0x1.2ap+8, 0x1.2bp+8, 0x1.2cp+8, 0x1.2dp+8, 0x1.2ep+8, 0x1.2fp+8, 0x1.3p+8, 0x1.31p+8, 0x1.32p+8, 0x1.33p+8, 0x1.34p+8, 0x1.35p+8, 0x1.36p+8, 0x1.37p+8, 0x1.38p+8, 0x1.39p+8, 0x1.3ap+8, 0x1.3bp+8, 0x1.3cp+8, 0x1.3dp+8, 0x1.3ep+8, 0x1.3fp+8, 0x1.4p+8, 0x1.41p+8, 0x1.42p+8, 0x1.43p+8, 0x1.44p+8], [0x1.45p+8, 0x1.46p+8, 0x1.47p+8, 0x1.48p+8, 0x1.49p+8, 0x1.4ap+8, 0x1.4bp+8, 0x1.4cp+8, 0x1.4dp+8, 0x1.4ep+8, 0x1.4fp+8, 0x1.5p+8, 0x1.51p+8, 0x1.52p+8, 0x1.53p+8, 0x1.54p+8, 0x1.55p+8, 0x1.56p+8, 0x1.57p+8, 0x1.58p+8, 0x1.59p+8, 0x1.5ap+8, 0x1.5bp+8, 0x1.5cp+8, 0x1.5dp+8, 0x1.5ep+8, 0x1.5fp+8, 0x1.6p+8, 0x1.61p+8, 0x1.62p+8, 0x1.63p+8, 0x1.64p+8], [0x1.65p+8, 0x1.66p+8, 0x1.67p+8, 0x1.68p+8, 0x1.69p+8, 0x1.6ap+8, 0x1.6bp+8, 0x1.6cp+8, 0x1.6dp+8, 0x1.6ep+8, 0x1.6fp+8, 0x1.7p+8, 0x1.71p+8, 0x1.72p+8, 0x1.73p+8, 0x1.74p+8, 0x1.75p+8, 0x1.76p+8, 0x1.77p+8, 0x1.78p+8, 0x1.79p+8, 0x1.7ap+8, 0x1.7bp+8, 0x1.7cp+8, 0x1.7dp+8, 0x1.7ep+8, 0x1.7fp+8, 0x1.8p+8, 0x1.81p+8, 0x1.82p+8, 0x1.83p+8, 0x1.84p+8], [0x1.85p+8, 0x1.86p+8, 0x1.87p+8, 0x1.88p+8, 0x1.89p+8, 0x1.8ap+8, 0x1.8bp+8, 0x1.8cp+8, 0x1.8dp+8, 0x1.8ep+8, 0x1.8fp+8, 0x1.9p+8, 0x1.91p+8, 0x1.92p+8, 0x1.93p+8, 0x1.94p+8, 0x1.95p+8, 0x1.96p+8, 0x1.97p+8, 0x1.98p+8, 0x1.99p+8, 0x1.9ap+8, 0x1.9bp+8, 0x1.9cp+8, 0x1.9dp+8, 0x1.9ep+8, 0x1.9fp+8, 0x1.ap+8, 0x1.a1p+8, 0x1.a2p+8, 0x1.a3p+8, 0x1.a4p+8], [0x1.a5p+8, 0x1.a6p+8, 0x1.a7p+8, 0x1.a8p+8, 0x1.a9p+8, 0x1.aap+8, 0x1.abp+8, 0x1.acp+8, 0x1.adp+8, 0x1.aep+8, 0x1.afp+8, 0x1.bp+8, 0x1.b1p+8, 0x1.b2p+8, 0x1.b3p+8, 0x1.b4p+8, 0x1.b5p+8, 0x1.b6p+8, 0x1.b7p+8, 0x1.b8p+8, 0x1.b9p+8, 0x1.bap+8, 0x1.bbp+8, 0x1.bcp+8, 0x1.bdp+8, 0x1.bep+8, 0x1.bfp+8, 0x1.cp+8, 0x1.c1p+8, 0x1.c2p+8, 0x1.c3p+8, 0x1.c4p+8], [0x1.c5p+8, 0x1.c6p+8, 0x1.c7p+8, 0x1.c8p+8, 0x1.c9p+8, 0x1.cap+8, 0x1.cbp+8, 0x1.ccp+8, 0x1.cdp+8, 0x1.cep+8, 0x1.cfp+8, 0x1.dp+8, 0x1.d1p+8, 0x1.d2p+8, 0x1.d3p+8, 0x1.d4p+8, 0x1.d5p+8, 0x1.d6p+8, 0x1.d7p+8, 0x1.d8p+8, 0x1.d9p+8, 0x1.dap+8, 0x1.dbp+8, 0x1.dcp+8, 0x1.ddp+8, 0x1.dep+8, 0x1.dfp+8, 0x1.ep+8, 0x1.e1p+8, 0x1.e2p+8, 0x1.e3p+8, 0x1.e4p+8], [0x1.e5p+8, 0x1.e6p+8, 0x1.e7p+8, 0x1.e8p+8, 0x1.e9p+8, 0x1.eap+8, 0x1.ebp+8, 0x1.ecp+8, 0x1.edp+8, 0x1.eep+8, 0x1.efp+8, 0x1.fp+8, 0x1.f1p+8, 0x1.f2p+8, 0x1.f3p+8, 0x1.f4p+8, 0x1.f5p+8, 0x1.f6p+8, 0x1.f7p+8, 0x1.f8p+8, 0x1.f9p+8, 0x1.fap+8, 0x1.fbp+8, 0x1.fcp+8, 0x1.fdp+8, 0x1.fep+8, 0x1.ffp+8, 0x1p+9, 0x1.008p+9, 0x1.01p+9, 0x1.018p+9, 0x1.02p+9], [0x1.028p+9, 0x1.03p+9, 0x1.038p+9, 0x1.04p+9, 0x1.048p+9, 0x1.05p+9, 0x1.058p+9, 0x1.06p+9, 0x1.068p+9, 0x1.07p+9, 0x1.078p+9, 0x1.08p+9, 0x1.088p+9, 0x1.09p+9, 0x1.098p+9, 0x1.0ap+9, 0x1.0a8p+9, 0x1.0bp+9, 0x1.0b8p+9, 0x1.0cp+9, 0x1.0c8p+9, 0x1.0dp+9, 0x1.0d8p+9, 0x1.0ep+9, 0x1.0e8p+9, 0x1.0fp+9, 0x1.0f8p+9, 0x1.1p+9, 0x1.108p+9, 0x1.11p+9, 0x1.118p+9, 0x1.12p+9], [0x1.128p+9, 0x1.13p+9, 0x1.138p+9, 0x1.14p+9, 0x1.148p+9, 0x1.15p+9, 0x1.158p+9, 0x1.16p+9, 0x1.168p+9, 0x1.17p+9, 0x1.178p+9, 0x1.18p+9, 0x1.188p+9, 0x1.19p+9, 0x1.198p+9, 0x1.1ap+9, 0x1.1a8p+9, 0x1.1bp+9, 0x1.1b8p+9, 0x1.1cp+9, 0x1.1c8p+9, 0x1.1dp+9, 0x1.1d8p+9, 0x1.1ep+9, 0x1.1e8p+9, 0x1.1fp+9, 0x1.1f8p+9, 0x1.2p+9, 0x1.208p+9, 0x1.21p+9, 0x1.218p+9, 0x1.22p+9], [0x1.228p+9, 0x1.23p+9, 0x1.238p+9, 0x1.24p+9, 0x1.248p+9, 0x1.25p+9, 0x1.258p+9, 0x1.26p+9, 0x1.268p+9, 0x1.27p+9, 0x1.278p+9, 0x1.28p+9, 0x1.288p+9, 0x1.29p+9, 0x1.298p+9, 0x1.2ap+9, 0x1.2a8p+9, 0x1.2bp+9, 0x1.2b8p+9, 0x1.2cp+9, 0x1.2c8p+9, 0x1.2dp+9, 0x1.2d8p+9, 0x1.2ep+9, 0x1.2e8p+9, 0x1.2fp+9, 0x1.2f8p+9, 0x1.3p+9, 0x1.308p+9, 0x1.31p+9, 0x1.318p+9, 0x1.32p+9], [0x1.328p+9, 0x1.33p+9, 0x1.338p+9, 0x1.34p+9, 0x1.348p+9, 0x1.35p+9, 0x1.358p+9, 0x1.36p+9, 0x1.368p+9, 0x1.37p+9, 0x1.378p+9, 0x1.38p+9, 0x1.388p+9, 0x1.39p+9, 0x1.398p+9, 0x1.3ap+9, 0x1.3a8p+9, 0x1.3bp+9, 0x1.3b8p+9, 0x1.3cp+9, 0x1.3c8p+9, 0x1.3dp+9, 0x1.3d8p+9, 0x1.3ep+9, 0x1.3e8p+9, 0x1.3fp+9, 0x1.3f8p+9, 0x1.4p+9, 0x1.408p+9, 0x1.41p+9, 0x1.418p+9, 0x1.42p+9], [0x1.428p+9, 0x1.43p+9, 0x1.438p+9, 0x1.44p+9, 0x1.448p+9, 0x1.45p+9, 0x1.458p+9, 0x1.46p+9, 0x1.468p+9, 0x1.47p+9, 0x1.478p+9, 0x1.48p+9, 0x1.488p+9, 0x1.49p+9, 0x1.498p+9, 0x1.4ap+9, 0x1.4a8p+9, 0x1.4bp+9, 0x1.4b8p+9, 0x1.4cp+9, 0x1.4c8p+9, 0x1.4dp+9, 0x1.4d8p+9, 0x1.4ep+9, 0x1.4e8p+9, 0x1.4fp+9, 0x1.4f8p+9, 0x1.5p+9, 0x1.508p+9, 0x1.51p+9, 0x1.518p+9, 0x1.52p+9], [0x1.528p+9, 0x1.53p+9, 0x1.538p+9, 0x1.54p+9, 0x1.548p+9, 0x1.55p+9, 0x1.558p+9, 0x1.56p+9, 0x1.568p+9, 0x1.57p+9, 0x1.578p+9, 0x1.58p+9, 0x1.588p+9, 0x1.59p+9, 0x1.598p+9, 0x1.5ap+9, 0x1.5a8p+9, 0x1.5bp+9, 0x1.5b8p+9, 0x1.5cp+9, 0x1.5c8p+9, 0x1.5dp+9, 0x1.5d8p+9, 0x1.5ep+9, 0x1.5e8p+9, 0x1.5fp+9, 0x1.5f8p+9, 0x1.6p+9, 0x1.608p+9, 0x1.61p+9, 0x1.618p+9, 0x1.62p+9], [0x1.628p+9, 0x1.63p+9, 0x1.638p+9, 0x1.64p+9, 0x1.648p+9, 0x1.65p+9, 0x1.658p+9, 0x1.66p+9, 0x1.668p+9, 0x1.67p+9, 0x1.678p+9, 0x1.68p+9, 0x1.688p+9, 0x1.69p+9, 0x1.698p+9, 0x1.6ap+9, 0x1.6a8p+9, 0x1.6bp+9, 0x1.6b8p+9, 0x1.6cp+9, 0x1.6c8p+9, 0x1.6dp+9, 0x1.6d8p+9, 0x1.6ep+9, 0x1.6e8p+9, 0x1.6fp+9, 0x1.6f8p+9, 0x1.7p+9, 0x1.708p+9, 0x1.71p+9, 0x1.718p+9, 0x1.72p+9], [0x1.728p+9, 0x1.73p+9, 0x1.738p+9, 0x1.74p+9, 0x1.748p+9, 0x1.75p+9, 0x1.758p+9, 0x1.76p+9, 0x1.768p+9, 0x1.77p+9, 0x1.778p+9, 0x1.78p+9, 0x1.788p+9, 0x1.79p+9, 0x1.798p+9, 0x1.7ap+9, 0x1.7a8p+9, 0x1.7bp+9, 0x1.7b8p+9, 0x1.7cp+9, 0x1.7c8p+9, 0x1.7dp+9, 0x1.7d8p+9, 0x1.7ep+9, 0x1.7e8p+9, 0x1.7fp+9, 0x1.7f8p+9, 0x1.8p+9, 0x1.808p+9, 0x1.81p+9, 0x1.818p+9, 0x1.82p+9], [0x1.828p+9, 0x1.83p+9, 0x1.838p+9, 0x1.84p+9, 0x1.848p+9, 0x1.85p+9, 0x1.858p+9, 0x1.86p+9, 0x1.868p+9, 0x1.87p+9, 0x1.878p+9, 0x1.88p+9, 0x1.888p+9, 0x1.89p+9, 0x1.898p+9, 0x1.8ap+9, 0x1.8a8p+9, 0x1.8bp+9, 0x1.8b8p+9, 0x1.8cp+9, 0x1.8c8p+9, 0x1.8dp+9, 0x1.8d8p+9, 0x1.8ep+9, 0x1.8e8p+9, 0x1.8fp+9, 0x1.8f8p+9, 0x1.9p+9, 0x1.908p+9, 0x1.91p+9, 0x1.918p+9, 0x1.92p+9], [0x1.928p+9, 0x1.93p+9, 0x1.938p+9, 0x1.94p+9, 0x1.948p+9, 0x1.95p+9, 0x1.958p+9, 0x1.96p+9, 0x1.968p+9, 0x1.97p+9, 0x1.978p+9, 0x1.98p+9, 0x1.988p+9, 0x1.99p+9, 0x1.998p+9, 0x1.9ap+9, 0x1.9a8p+9, 0x1.9bp+9, 0x1.9b8p+9, 0x1.9cp+9, 0x1.9c8p+9, 0x1.9dp+9, 0x1.9d8p+9, 0x1.9ep+9, 0x1.9e8p+9, 0x1.9fp+9, 0x1.9f8p+9, 0x1.ap+9, 0x1.a08p+9, 0x1.a1p+9, 0x1.a18p+9, 0x1.a2p+9], [0x1.a28p+9, 0x1.a3p+9, 0x1.a38p+9, 0x1.a4p+9, 0x1.a48p+9, 0x1.a5p+9, 0x1.a58p+9, 0x1.a6p+9, 0x1.a68p+9, 0x1.a7p+9, 0x1.a78p+9, 0x1.a8p+9, 0x1.a88p+9, 0x1.a9p+9, 0x1.a98p+9, 0x1.aap+9, 0x1.aa8p+9, 0x1.abp+9, 0x1.ab8p+9, 0x1.acp+9, 0x1.ac8p+9, 0x1.adp+9, 0x1.ad8p+9, 0x1.aep+9, 0x1.ae8p+9, 0x1.afp+9, 0x1.af8p+9, 0x1.bp+9, 0x1.b08p+9, 0x1.b1p+9, 0x1.b18p+9, 0x1.b2p+9], [0x1.b28p+9, 0x1.b3p+9, 0x1.b38p+9, 0x1.b4p+9, 0x1.b48p+9, 0x1.b5p+9, 0x1.b58p+9, 0x1.b6p+9, 0x1.b68p+9, 0x1.b7p+9, 0x1.b78p+9, 0x1.b8p+9, 0x1.b88p+9, 0x1.b9p+9, 0x1.b98p+9, 0x1.bap+9, 0x1.ba8p+9, 0x1.bbp+9, 0x1.bb8p+9, 0x1.bcp+9, 0x1.bc8p+9, 0x1.bdp+9, 0x1.bd8p+9, 0x1.bep+9, 0x1.be8p+9, 0x1.bfp+9, 0x1.bf8p+9, 0x1.cp+9, 0x1.c08p+9, 0x1.c1p+9, 0x1.c18p+9, 0x1.c2p+9], [0x1.c28p+9, 0x1.c3p+9, 0x1.c38p+9, 0x1.c4p+9, 0x1.c48p+9, 0x1.c5p+9, 0x1.c58p+9, 0x1.c6p+9, 0x1.c68p+9, 0x1.c7p+9, 0x1.c78p+9, 0x1.c8p+9, 0x1.c88p+9, 0x1.c9p+9, 0x1.c98p+9, 0x1.cap+9, 0x1.ca8p+9, 0x1.cbp+9, 0x1.cb8p+9, 0x1.ccp+9, 0x1.cc8p+9, 0x1.cdp+9, 0x1.cd8p+9, 0x1.cep+9, 0x1.ce8p+9, 0x1.cfp+9, 0x1.cf8p+9, 0x1.dp+9, 0x1.d08p+9, 0x1.d1p+9, 0x1.d18p+9, 0x1.d2p+9], [0x1.d28p+9, 0x1.d3p+9, 0x1.d38p+9, 0x1.d4p+9, 0x1.d48p+9, 0x1.d5p+9, 0x1.d58p+9, 0x1.d6p+9, 0x1.d68p+9, 0x1.d7p+9, 0x1.d78p+9, 0x1.d8p+9, 0x1.d88p+9, 0x1.d9p+9, 0x1.d98p+9, 0x1.dap+9, 0x1.da8p+9, 0x1.dbp+9, 0x1.db8p+9, 0x1.dcp+9, 0x1.dc8p+9, 0x1.ddp+9, 0x1.dd8p+9, 0x1.dep+9, 0x1.de8p+9, 0x1.dfp+9, 0x1.df8p+9, 0x1.ep+9, 0x1.e08p+9, 0x1.e1p+9, 0x1.e18p+9, 0x1.e2p+9], [0x1.e28p+9, 0x1.e3p+9, 0x1.e38p+9, 0x1.e4p+9, 0x1.e48p+9, 0x1.e5p+9, 0x1.e58p+9, 0x1.e6p+9, 0x1.e68p+9, 0x1.e7p+9, 0x1.e78p+9, 0x1.e8p+9, 0x1.e88p+9, 0x1.e9p+9, 0x1.e98p+9, 0x1.eap+9, 0x1.ea8p+9, 0x1.ebp+9, 0x1.eb8p+9, 0x1.ecp+9, 0x1.ec8p+9, 0x1.edp+9, 0x1.ed8p+9, 0x1.eep+9, 0x1.ee8p+9, 0x1.efp+9, 0x1.ef8p+9, 0x1.fp+9, 0x1.f08p+9, 0x1.f1p+9, 0x1.f18p+9, 0x1.f2p+9], [0x1.f28p+9, 0x1.f3p+9, 0x1.f38p+9, 0x1.f4p+9, 0x1.f48p+9, 0x1.f5p+9, 0x1.f58p+9, 0x1.f6p+9, 0x1.f68p+9, 0x1.f7p+9, 0x1.f78p+9, 0x1.f8p+9, 0x1.f88p+9, 0x1.f9p+9, 0x1.f98p+9, 0x1.fap+9, 0x1.fa8p+9, 0x1.fbp+9, 0x1.fb8p+9, 0x1.fcp+9, 0x1.fc8p+9, 0x1.fdp+9, 0x1.fd8p+9, 0x1.fep+9, 0x1.fe8p+9, 0x1.ffp+9, 0x1.ff8p+9, 0x1p+10, 0x1.004p+10, 0x1.008p+10, 0x1.00cp+10, 0x1.01p+10]])];
            tensor<fp32, [1, 1]> matmul_2 = matmul(transpose_x = bool(false), transpose_y = bool(false), x = x, y = wa_0)[name = string("matmul_2")];
            tensor<fp32, [1, 1]> matmul_3 = matmul(transpose_x = bool(false), transpose_y = bool(false), x = x, y = wb_1)[name = string("matmul_3")];
            tensor<fp32, [1, 1]> add_4 = add(x = matmul_2, y = matmul_3)[name = string("add_4")];
        } -> (add_4);
}