program(1.3)
[buildInfo = dict<string, string>({{"coremlc-component-MIL", "3510.2.1"}, {"coremlc-version", "3500.32.1"}})]
{
    func main<ios19>(tensor<fp32, [1, 4]> x) {
            tensor<fp32, [4, 1]> wa_0 = const()[name = string("wa_0"), val = tensor<fp32, [4, 1]>([[-0x1.7f2d04p-4], [0x1.1955acp+0], [0x1.0035f8p+1], [0x1.2c7958p-3]])];
            tensor<fp32, [4, 1]> wb_1 = const()[name = string("wb_1"), val = tensor<fp32, [4, 1]>([[0x1.636232p+0], [-0x1.71e58p+0], [-0x1.0de2bap+1], [0x1.1614f6p-4]])];
            tensor<fp32, [1, 1]> matmul_2 = matmul(transpose_x = bool(false), transpose_y = bool(false), x = x, y = wa_0)[name = string("matmul_2")];
            tensor<fp32, [1, 1]> matmul_3 = matmul(transpose_x = bool(false), transpose_y = bool(false), x = x, y = wb_1)[name = string("matmul_3")];
            tensor<fp32, [1, 1]> add_4 = add(x = matmul_2, y = matmul_3)[name = string("add_4")];
        } -> (add_4);
}