program(1.3)
[buildInfo = dict<string, string>({{"coremlc-component-MIL", "3510.2.1"}, {"coremlc-version", "3500.32.1"}})]
{
    func main<ios19>(tensor<fp32, [1, 128]> x) {
            tensor<fp32, [4, 4]> dummy_0_0 = const()[name = string("dummy_0_0"), val = tensor<fp32, [4, 4]>([[-0x1.0bc6dp-1, 0x1.c2d9b4p+0, 0x1.67487ep+0, -0x1.6e05fcp+0], [-0x1.3b8d1ep-1, 0x1.4317c4p-1, 0x1.3d2584p-2, -0x1.24efe6p+0], [-0x1.07c70cp+0, -0x1.074ac6p+1, 0x1.21e36ap-1, 0x1.9ce94ep-1], [0x1.ef3394p+0, -0x1.f0d7bcp-2, 0x1.286ad2p-1, 0x1.3af088p+0]])];
            tensor<fp32, [4, 4]> dummy_1_1 = const()[name = string("dummy_1_1"), val = tensor<fp32, [4, 4]>([[0x1.eae336p-1, -0x1.90c2f4p-1, 0x1.969a12p+0, -0x1.8233d6p+0], [0x1.270704p+0, 0x1.7cc554p-2, -0x1.f2263cp+0, 0x1.e719aep+0], [0x1.015912p-1, 0x1.2c18e6p+0, 0x1.0c993ep+0, 0x1.89fe46p+0], [0x1.97c1f2p-1, 0x1.d59904p-2, 0x1.ffa542p+0, -0x1.62cd9ep-1]])];
            tensor<fp32, [4, 4]> dummy_2_2 = const()[name = string("dummy_2_2"), val = tensor<fp32, [4, 4]>([[-0x1.dabc5ap+0, 0x1.efccap-1, 0x1.c5eba6p+0, -0x1.9661b4p+0], [-0x1.5fae64p+0, 0x1.cd6c82p-4, 0x1.7ed1fp-4, 0x1.4f409p-1], [0x1.04900ep+1, 0x1.b4463p-4, 0x1.8840cap+0, -0x1.02fd8ap+1], [-0x1.5dc68p-2, 0x1.670272p+0, -0x1.c0dbbep-1, 0x1.adc4d4p+0]])];
            tensor<fp32, [4, 4]> dummy_3_3 = const()[name = string("dummy_3_3"), val = tensor<fp32, [4, 4]>([[-0x1.7d9d62p-2, -0x1.9354dep+0, 0x1.f53d3ap+0, -0x1.aa8f8ep+0], [0x1.947cbep-2, -0x1.2c1e24p-3, 0x1.11003ep+1, -0x1.2fb23cp-1], [-0x1.73de8ep-1, -0x1.eb2042p-1, 0x1.01f42ap+1, -0x1.4a7176p+0], [-0x1.7ac43ap+0, -0x1.f2e458p+0, 0x1.1603f4p-1, -0x1.f49418p-3]])];
            tensor<fp32, [4, 4]> dummy_4_4 = const()[name = string("dummy_4_4"), val = tensor<fp32, [4, 4]>([[0x1.1bedaap+0, 0x1.67975ep-3, 0x1.124768p+1, -0x1.bebd6ap+0], [-0x1.10cb1ap+1, -0x1.9f7946p-2, -0x1.f6f232p-4, -0x1.d75284p+0], [0x1.9d089cp-1, -0x1.033252p+1, -0x1.cbf318p+0, -0x1.1dcfb2p-1], [0x1.ad6c24p+0, -0x1.014826p+0, 0x1.f671d2p+0, 0x1.104c9p+1]])];
            tensor<fp32, [128, 128]> w_5 = const()[name = string("w_5"), val = tensor<fp32, [128, 128]>([[-0x1.0bc6dp-1, 0x1.c2d9b4p+0, 0x1.67487ep+0, -0x1.6e05fcp+0, -0x1.3b8d1ep-1, 0x1.4317c4p-1, 0x1.3d2584p-2, -0x1.24efe6p+0, -0x1.07c70cp+0, -0x1.074ac6p+1, 0x1.21e36ap-1, 0x1.9ce94ep-1, 0x1.ef3394p+0, -0x1.f0d7bcp-2, 0x1.286ad2p-1, 0x1.3af088p+0, -0x1.2da3cap-3, -0x1.18c8d2p-1, -0x1.b55088p+0, 0x1.0c158ap-1, -0x1.7e356cp-4, -0x1.14ac06p-3, 0x1.d3b4b4p-3, 0x1.07ec8ap+1, -0x1.c94c6cp+0, -0x1.3f452ep-1, -0x1.426628p+0, 0x1.0c727cp+0, -0x1.8eb5bp+0, 0x1.917cd2p-3, -0x1.b416bp-3, -0x1.ff8d16p+0, 0x1.91e03p-2, -0x1.94e0bp-2, 0x1.44dd7p+0, -0x1.c4232ap+0, -0x1.26c548p-3, 0x1.603faap-2, -0x1.7f3bc8p-2, 0x1.3f51fap+0, -0x1.2ce822p-1, -0x1.ebd9e8p-1, 0x1.531b9cp+0, 0x1.022906p+1, 0x1.153982p+0, -0x1.3d89fp+0, -0x1.b47ad4p+0, -0x1.ae52d4p-2, 0x1.4ffa98p+0, 0x1.00c4c2p+1, 0x1.8e0866p-1, -0x1.35da0cp-1, -0x1.9b19fcp-1, 0x1.dffecap+0, 0x1.767e22p-2, 0x1.33d9cep-2, 0x1.c9dee2p+0, 0x1.b626a4p-1, 0x1.f0c1ccp+0, 0x1.41ee56p-3, -0x1.a9a476p-2, 0x1.9b3b46p+0, 0x1.2be34cp-2, 0x1.eac5acp-1, 0x1.60aad2p-1, 0x1.cf0b1p+0, -0x1.4dcf8ap+0, 0x1.78515ap+0, -0x1.fd31b2p+0, 0x1.63b0ap-2, 0x1.39208ep+0, -0x1.627f8ep-1, -0x1.4d3e98p+0, -0x1.70f238p+0, -0x1.c3a7p+0, -0x1.e33cf4p+0, 0x1.0aff1p+1, -0x1.1a803ep-2, -0x1.f099eep+0, 0x1.ffc8c4p+0, 0x1.662d52p+0, -0x1.bfcf54p-1, -0x1.0452bap-1, 0x1.46b9f4p-2, -0x1.a6ee26p-1, -0x1.ec2952p-1, -0x1.72f2dcp-1, -0x1.81060cp+0, 0x1.f4724p+0, 0x1.94936cp+0, -0x1.bad0dcp+0, -0x1.8585d2p-1, 0x1.a37436p-1, -0x1.ca363p+0, -0x1.c671d2p-3, 0x1.0dd9cp-4, -0x1.a4e22ap-2, -0x1.d1317p-2, 0x1.09ffc4p+0, 0x1.e230c4p-1, 0x1.120076p-3, 0x1.261852p+0, 0x1.9ea918p+0, -0x1.5489c6p+0, -0x1.0e7b04p+1, -0x1.8fa5d2p-2, 0x1.2521b2p+0, 0x1.451d9ep-2, -0x1.cac2dap+0, -0x1.2a73e6p-1, 0x1.0d64bcp-6, 0x1.69dae8p-2, -0x1.6a301ep+0, -0x1.cb43a4p-3, -0x1.892816p+0, -0x1.d9cdf2p-1, 0x1.41e8ap+0, -0x1.60cfe2p+0, 0x1.3fb9ecp-2, -0x1.b9d2d2p-1, -0x1.0d85eep+1, 0x1.be416ep-4, -0x1.03bbccp-3, 0x1.1d385p-1, -0x1.a775d4p+0, 0x1.7c706cp+0, 0x1.3d58fp-1, -0x1.34815p-1], [-0x1.d54028p-2, 0x1.f50ffap-1, 0x1.19e86cp-1, -0x1.8292eap-2, 0x1.2df59p-6, 0x1.c08822p+0, 0x1.713398p-2, -0x1.2b189ep-1, 0x1.1abd2p-2, -0x1.08909cp+0, -0x1.5cc066p+0, -0x1.c487f8p-1, 0x1.55fbf8p-5, -0x1.a2800ep-1, 0x1.1762c6p-2, 0x1.d770cp+0, -0x1.d67e28p+0, 0x1.159bb4p-1, 0x1.466452p-1, 0x1.428ad4p-1, 0x1.73c38p-3, -0x1.a8fa22p-7, -0x1.355b6p+0, -0x1.d2b042p-2, 0x1.2aad6p+0, -0x1.4f0fcep+0, 0x1.ac9ec4p-1, -0x1.d50ffap+0, 0x1.828196p-1, 0x1.36140cp-2, 0x1.68f348p+0, 0x1.ad76fep-1, 0x1.f6fec6p-1, 0x1.34c4bp+0, 0x1.11cb5ap-2, 0x1.dcc658p-1, 0x1.118acap+0, -0x1.47b5bp+0, 0x1.0a5d76p+1, -0x1.b808b8p-3, -0x1.083d44p+0, 0x1.8a8506p-1, 0x1.1768fp+0, 0x1.c289dp+0, -0x1.96a306p-2, -0x1.fd8514p+0, -0x1.cd3c6ap-3, 0x1.8d5f8cp+0, 0x1.ea7c26p-1, -0x1.4d8bdep-1, 0x1.26dfbcp-3, -0x1.ae1cecp-1, 0x1.9cdcf2p-4, -0x1.a45df4p+0, 0x1.f89364p+0, -0x1.099d56p+1, 0x1.4e2f8cp+0, -0x1.e7c35p-2, -0x1.1820e4p-2, 0x1.f6d5e6p+0, -0x1.6c1d72p+0, -0x1.2a8444p-1, 0x1.c5d68p+0, 0x1.5541a6p-6, 0x1.53de4p+0, 0x1.5013a4p-1, 0x1.115316p+1, 0x1.e677e6p-1, 0x1.c6cca2p-5, 0x1.3e3p-1, -0x1.7325c2p+0, 0x1.17525ap+0, 0x1.8076fp-1, -0x1.af4ed4p-1, 0x1.a28152p+0, -0x1.0e63eep-2, 0x1.cf34bp+0, -0x1.3dc608p-1, 0x1.41794ap-2, 0x1.edc7a4p-1, 0x1.b31b5ap-1, -0x1.33f18cp+0, 0x1.5ca3fap+0, -0x1.e076c6p+0, 0x1.07a862p+0, 0x1.443fa2p-2, -0x1.3dbe56p-3, 0x1.7936cp+0, 0x1.210872p+0, -0x1.8069fp+0, -0x1.d1cc8ep+0, 0x1.69de4cp-2, -0x1.09b102p-1, 0x1.c051a4p+0, -0x1.bfdabap+0, -0x1.43c6fap-3, -0x1.8e6762p+0, -0x1.2df53ap+0, -0x1.d964b2p+0, 0x1.0535dcp+1, 0x1.ad35c2p-3, 0x1.064faep+1, -0x1.70103cp+0, -0x1.d153acp-1, -0x1.3e4934p+0, 0x1.53adap+0, -0x1.3bdb78p+0, 0x1.04dfp+0, -0x1.fd8a92p-2, 0x1.a44be6p-1, 0x1.c6c178p+0, -0x1.633526p-5, 0x1.87cae6p+0, -0x1.3143fep+0, -0x1.bfab22p+0, -0x1.5dc824p-1, -0x1.9ece68p+0, -0x1.140516p+0, -0x1.c154c6p+0, -0x1.5a9f82p-6, 0x1.f0c3bap-2, -0x1.dc6252p+0, 0x1.b71ac8p-1, -0x1.545562p+0, 0x1.e5505p+0, 0x1.13b12p-1, 0x1.aa4eb6p+0, -0x1.d7590cp+0], [-0x1.095b42p+1, -0x1.1dd73ep+0, -0x1.e1dda2p+0, 0x1.b7f2f4p-1, 0x1.867d8ep-1, 0x1.88c282p+0, -0x1.1254d6p+1, -0x1.59c0c2p+0, 0x1.fcac14p-1, 0x1.fd9a48p-3, 0x1.86d8b4p+0, -0x1.47d5f6p+0, -0x1.1ec25ap-4, -0x1.274b9p-4, -0x1.aca53p-1, 0x1.10a256p-3, -0x1.08eb7p+1, 0x1.989452p-3, 0x1.a18d62p+0, 0x1.e29b54p-1, -0x1.52064ap-2, -0x1.0d8p-5, 0x1.da54fp-1, -0x1.5abd6p+0, 0x1.08631ep+1, 0x1.618cfcp+0, 0x1.f1249ap+0, -0x1.edf79p-6, -0x1.f979fcp-1, -0x1.e77ccep-2, -0x1.4614dp+0, 0x1.45c2a2p-1, 0x1.b14acap+0, -0x1.a190eap+0, 0x1.72277cp-1, -0x1.e3a366p-1, 0x1.fc7ee2p-2, -0x1.8aa442p+0, 0x1.3cf018p+0, 0x1.13569ep+0, 0x1.c938a2p-2, -0x1.3b878ap+0, -0x1.7b96eep-1, -0x1.b0b89ep+0, 0x1.1225d6p-1, 0x1.e2959cp+0, 0x1.8a4e36p+0, -0x1.974812p+0, 0x1.7cc2c4p-1, 0x1.16af72p+0, 0x1.0c74f4p-2, -0x1.8fb178p-2, -0x1.6aef58p+0, -0x1.0ab4fep+1, -0x1.d060f4p+0, 0x1.c2ae04p+0, -0x1.b18fd4p-1, -0x1.115526p+1, -0x1.9a48d2p+0, -0x1.0088a4p-1, -0x1.a63812p+0, -0x1.3662c8p-3, -0x1.fc00bp-6, 0x1.5c6aa4p-1, -0x1.816dd4p+0, -0x1.c48e6p-1, 0x1.cd54d4p+0, -0x1.c81f68p+0, 0x1.0ad62ep+1, -0x1.f5b90cp+0, 0x1.66ec9cp-4, 0x1.1a7a48p-1, -0x1.c78514p+0, -0x1.47f30ep-3, -0x1.b184bcp-3, 0x1.108e1ep+1, 0x1.c7b6e6p+0, 0x1.e6988ap+0, -0x1.029156p+0, 0x1.fa442ep-1, -0x1.bc5eb4p+0, -0x1.9dd2ecp-2, -0x1.6e465ep-4, 0x1.412a6ep-2, -0x1.0ed34ep+1, 0x1.2fb394p-1, 0x1.f925e8p+0, 0x1.bfb882p-3, -0x1.ec4feap+0, -0x1.7923e6p+0, 0x1.1a2c9ap+0, 0x1.e03f76p-1, 0x1.4d6caep-2, 0x1.00b746p-5, -0x1.d0a11p-1, -0x1.c65fe6p+0, -0x1.a5b00ep-1, 0x1.f2f0a8p+0, -0x1.7e7858p-1, -0x1.a970b4p+0, 0x1.08d83ep+0, -0x1.a0b156p-3, -0x1.12ea12p-1, -0x1.8c68e4p-3, 0x1.d7ac4ep-1, -0x1.ba4b5p+0, 0x1.70d17p+0, -0x1.91a2e6p+0, 0x1.31fd0cp-3, 0x1.7522c2p+0, 0x1.d2f6ecp-4, 0x1.96efa6p-7, -0x1.6e59e8p-3, -0x1.b6cb06p-1, -0x1.071ceep+1, -0x1.4f7eb6p+0, -0x1.c1eep+0, 0x1.341766p+0, 0x1.9a086ep-4, -0x1.967d1ep-2, -0x1.bc1962p+0, 0x1.035412p+1, -0x1.f9a166p+0, 0x1.efc758p+0, 0x1.3a823cp+0, -0x1.8c3882p+0, 0x1.a4b05ap-1, -0x1.500998p-2], [0x1.cadedep+0, 0x1.0ac3d8p+1, 0x1.21d578p-1, 0x1.1003c2p+1, 0x1.71faf2p-1, 0x1.48e93ep+0, -0x1.beda52p+0, 0x1.8ffa0ap+0, -0x1.668fd6p+0, -0x1.10addp-1, -0x1.294fcap+0, -0x1.223098p+0, 0x1.ed0dc8p-1, -0x1.5324c8p-1, 0x1.1b5f0cp-3, 0x1.e68e9ep+0, 0x1.adaf5ap+0, -0x1.ef3374p+0, 0x1.cf762p+0, 0x1.c16a96p-3, 0x1.d3adc6p-1, -0x1.0ec20ep+1, -0x1.a682dcp-1, 0x1.aaf402p-3, -0x1.adc77ap+0, 0x1.0df338p+1, 0x1.bb9e86p-2, 0x1.d5413ap+0, -0x1.ec8e84p+0, 0x1.0e53e8p+1, 0x1.6d038ep+0, -0x1.9db86p-1, 0x1.2566eep+0, -0x1.230a46p+0, 0x1.6479d6p-4, 0x1.9dabccp-2, -0x1.62daa2p+0, 0x1.3f2fb4p-1, 0x1.863f8ep-1, 0x1.988208p+0, -0x1.ec586cp+0, 0x1.ef1386p+0, 0x1.0c5612p+0, 0x1.e7888p-4, -0x1.5b67eap+0, -0x1.129eep+1, 0x1.a5a91p+0, -0x1.033fc4p+1, 0x1.c72d1cp+0, 0x1.11b5ccp+1, 0x1.6efeb8p-4, -0x1.573184p-1, 0x1.ef6accp+0, 0x1.a10e18p-3, 0x1.5dbe38p-1, 0x1.3eebf6p+0, 0x1.0b1c6cp+1, -0x1.7ea1c6p-2, -0x1.0e2ed2p-1, -0x1.9b8f12p-1, 0x1.5ae7e2p+0, -0x1.e7c43ap+0, 0x1.b8370ap+0, -0x1.0ec8eap+1, 0x1.69612ap-1, -0x1.7c30d6p-1, 0x1.af77ep-1, 0x1.080996p+0, -0x1.e23eecp-1, 0x1.b64b1cp-4, -0x1.8cd9e6p-5, -0x1.75a4aap-2, 0x1.0b60b2p+1, 0x1.8cb13cp-2, 0x1.5fcbc6p+0, 0x1.99576ep-1, -0x1.2f4942p-2, -0x1.3c90bap-1, 0x1.1dd254p-4, 0x1.a7b6cp+0, -0x1.f4861ap-1, -0x1.8649eap-1, -0x1.186136p-1, -0x1.66524ep+0, 0x1.974534p+0, 0x1.819c62p+0, 0x1.3401b8p+0, -0x1.4ab936p+0, -0x1.83d6bcp-1, -0x1.cef94ep-1, 0x1.8f1048p+0, 0x1.b780ecp+0, 0x1.2deb44p-1, 0x1.585e08p+0, -0x1.0e53ep+1, 0x1.5eb91p-3, 0x1.30a93ap-1, 0x1.cb5bep+0, 0x1.025982p+1, 0x1.2c7d92p-2, -0x1.3d61fap-3, 0x1.759a74p-2, 0x1.5c5acp+0, -0x1.400a3p+0, 0x1.9ece3ap+0, 0x1.d8be54p-5, 0x1.41d16ap+0, -0x1.0dcb3ep+0, -0x1.6f43c8p-3, 0x1.8cd336p-4, 0x1.bdbc06p+0, 0x1.daf6e4p+0, 0x1.d131ep+0, 0x1.5c2c6ep-1, -0x1.60e448p-1, -0x1.e61f4ep-1, 0x1.9bec04p-1, -0x1.aebc8ap+0, -0x1.a51d2ep+0, 0x1.da4d2cp-1, -0x1.a61f1ep-1, 0x1.79f8e8p+0, -0x1.1659b4p-3, -0x1.3e845p-2, -0x1.f77f02p-1, 0x1.467122p+0, 0x1.06e4bcp+1, 0x1.5a5b2p+0], [-0x1.1f77c4p+0, 0x1.8f742ep-2, -0x1.b78094p-1, 0x1.d32f44p-8, -0x1.d058e6p+0, -0x1.4ec016p+0, -0x1.de99e4p+0, -0x1.b5c924p+0, -0x1.5a175cp+0, -0x1.4d32b2p-1, -0x1.09ee14p+1, 0x1.a132dap+0, -0x1.046e0cp+1, 0x1.ce52a4p-1, -0x1.07e56cp+1, -0x1.695538p+0, 0x1.3d4684p+0, 0x1.b781f6p-1, -0x1.28f704p+0, -0x1.6d772ap-1, -0x1.e4fabep-1, -0x1.d88e7ap+0, -0x1.a3bc66p-3, 0x1.56e09p+0, 0x1.ddb34ap-1, 0x1.38d94cp-1, -0x1.06bfdap-2, 0x1.e68b06p-2, 0x1.d79022p+0, -0x1.917e7p+0, -0x1.caa67ap+0, 0x1.a587cp+0, 0x1.53861p-5, 0x1.eee482p-7, -0x1.43e4fap+0, -0x1.c035c6p+0, 0x1.e70f4ep+0, 0x1.fc523cp+0, 0x1.d744acp+0, 0x1.10a8e2p+0, 0x1.1d56c4p+0, 0x1.758ac8p-2, 0x1.105ba4p+0, -0x1.fac5ap+0, 0x1.102dfcp+1, -0x1.cdfaap+0, 0x1.ae3e8ap-1, 0x1.3e8284p-2, 0x1.8aab1p+0, 0x1.049cdcp+1, -0x1.04148p+1, 0x1.ec3daap-2, 0x1.2b19a8p-2, 0x1.6c71a6p-2, 0x1.907dfap+0, -0x1.e2f5cap+0, -0x1.fc34aep-1, -0x1.121c34p+1, 0x1.6b6236p-2, 0x1.a1d606p-1, 0x1.0cd18ep+1, -0x1.ec59a8p+0, 0x1.659208p+0, -0x1.45558ep+0, -0x1.00062ap+0, -0x1.55983p-3, 0x1.282318p-3, 0x1.1395f4p+0, -0x1.fcca3ep+0, -0x1.dc2108p-3, -0x1.ccda54p-1, 0x1.7cdfa4p-1, -0x1.2b17p+0, 0x1.654116p+0, -0x1.47b7eep-1, 0x1.bf2af4p+0, -0x1.911e66p-1, -0x1.56bceap-6, 0x1.df4f3cp-1, -0x1.8e453ep-2, -0x1.716f56p-1, -0x1.5f24e6p-1, 0x1.c906a4p+0, 0x1.cd242ap+0, 0x1.625904p-4, 0x1.ef241ap+0, 0x1.f3017ep-2, -0x1.e6cd5ep+0, -0x1.6c6452p+0, -0x1.def72ap-1, 0x1.e18fe2p+0, -0x1.9f0058p+0, 0x1.73ffd2p-1, -0x1.005e52p-2, -0x1.fce34p+0, 0x1.0024f6p+1, -0x1.91ce1p-3, -0x1.006cdep+0, -0x1.de195p-1, 0x1.63caap+0, -0x1.14ce04p-2, -0x1.ab758p-2, -0x1.0cbc56p+1, 0x1.bd66b4p-1, 0x1.736678p-1, -0x1.2654f4p+0, 0x1.923ap+0, 0x1.5223acp-2, 0x1.520be2p-1, 0x1.93667p-1, 0x1.61322p-1, 0x1.03555ap+1, 0x1.c57424p-1, 0x1.22dd0cp+0, 0x1.41bf68p-2, -0x1.09b8aap-3, 0x1.b760f2p+0, 0x1.97953ep-3, -0x1.ebfec6p+0, -0x1.65e376p-1, -0x1.9fa238p-4, 0x1.07e14ap-1, 0x1.33661p-1, 0x1.ca08bcp+0, 0x1.8f679ep-2, -0x1.8ee846p-1, 0x1.ab5e9p+0, -0x1.011d24p-1], [0x1.61c11ep-1, 0x1.10fee8p+1, 0x1.0f7b44p+1, 0x1.933346p-3, -0x1.9eac8cp+0, -0x1.3fcd64p-5, -0x1.911822p-2, -0x1.29ef46p+0, -0x1.aed506p+0, -0x1.d9efp-1, 0x1.a9e52ap-2, -0x1.b319f4p+0, -0x1.04ec84p+1, 0x1.7c42d4p+0, -0x1.bc3bf4p-2, -0x1.3018d4p+0, -0x1.bcd5a4p+0, 0x1.e3136p-4, 0x1.625064p-2, -0x1.244f7cp+0, -0x1.016d1p-1, -0x1.f63982p+0, 0x1.56669ap+0, 0x1.23e4cp+0, 0x1.41becep+0, -0x1.78b82cp+0, -0x1.8f9a08p-1, 0x1.5290f4p-1, 0x1.8deeeap-1, -0x1.754b48p-1, 0x1.72c5eap+0, -0x1.279b1p-1, -0x1.c6c8e4p-1, -0x1.e757e4p-1, -0x1.4cf956p+0, -0x1.da063ap+0, 0x1.51fd72p+0, -0x1.8fb89ap+0, 0x1.d17ee6p+0, 0x1.e4c44p+0, -0x1.72311ap-1, -0x1.030c9p+0, -0x1.a8f4a2p+0, 0x1.36eb44p-1, 0x1.56e5b6p-4, 0x1.cdef1p+0, -0x1.33af6p+0, 0x1.3cf6b4p+0, 0x1.782b42p-5, -0x1.ff5882p-1, -0x1.6ee744p-1, -0x1.b7c69cp-1, -0x1.e9cf6ap-1, -0x1.51b7p+0, 0x1.422c28p+0, -0x1.9c64e2p-1, 0x1.2bca7cp+0, 0x1.0f7a9ap+1, 0x1.07efep+0, -0x1.de257p-2, 0x1.6fbc42p-5, -0x1.44070ap-3, -0x1.ab8998p+0, -0x1.d96fcap+0, -0x1.3d645cp-2, 0x1.bc0386p-1, -0x1.5c0e24p-3, -0x1.c85064p+0, 0x1.1d3d7p-1, 0x1.36cc04p-1, -0x1.91dbeep-1, -0x1.ef3942p-2, 0x1.439282p-2, 0x1.ab4aa6p+0, 0x1.c5a026p+0, -0x1.355b34p-2, 0x1.1c449cp+0, -0x1.f8bf92p-5, 0x1.506adcp-2, -0x1.ec1a02p+0, -0x1.75da86p-3, -0x1.9fca68p+0, -0x1.33db1cp-3, -0x1.cfe92ep-2, 0x1.5eea84p+0, -0x1.d5acdcp-1, 0x1.cf07c4p+0, -0x1.37d48ep+0, -0x1.a8cff4p+0, 0x1.71e1dp+0, 0x1.38fcd6p+0, -0x1.87e8a6p-2, 0x1.e3fc64p+0, 0x1.9fc3b8p-1, -0x1.0db5fep+1, 0x1.19f99cp-2, -0x1.f4b3f4p+0, -0x1.6eb54p+0, 0x1.4f21p+0, -0x1.e3591p-7, -0x1.2eb426p-1, 0x1.ef583p-2, 0x1.f55318p-1, -0x1.7fca44p+0, 0x1.739d4ap+0, -0x1.eeacf2p+0, 0x1.07654cp+1, -0x1.a0bd3p-5, 0x1.ac179cp-1, 0x1.ce7a6cp-1, 0x1.351408p+0, -0x1.30c14ap+0, 0x1.d29528p+0, 0x1.e38a1cp-1, 0x1.3cce38p-2, 0x1.049568p+1, 0x1.b9c06p+0, -0x1.204f44p+0, -0x1.a794ccp+0, -0x1.2d8568p+0, 0x1.c95d4ep+0, 0x1.fbfb54p-1, -0x1.8ea2acp-2, -0x1.4defd2p+0, 0x1.7d650ep+0, 0x1.0ae0dp-4, -0x1.aa2ecap+0, -0x1.3d8f88p+0], [-0x1.9b7d4ep+0, -0x1.f1f2dcp-1, 0x1.46ccbap-2, -0x1.8a87bep+0, 0x1.ce9402p-1, -0x1.40784ep-2, 0x1.0afa3ep+1, -0x1.9df3p-2, 0x1.db21cp+0, 0x1.8e7734p+0, 0x1.9a2c84p-2, 0x1.09059ep-2, -0x1.17dfe2p+0, 0x1.2f6192p+0, -0x1.8d6e6p-1, 0x1.7dc6c2p+0, 0x1.a3f904p-1, 0x1.b2fa6p+0, 0x1.c158a4p+0, -0x1.7bbfd2p+0, -0x1.d7cabap+0, 0x1.851288p-1, 0x1.08c4dap-1, 0x1.e85b1ep+0, 0x1.c356bcp-1, -0x1.f0bcc2p-1, 0x1.d421d2p+0, -0x1.ffec9p+0, 0x1.ed6002p-1, -0x1.1025bp+0, -0x1.0d2bfap-2, -0x1.78ee2ep-1, -0x1.066f72p+1, 0x1.481452p+0, -0x1.b23c48p-1, 0x1.25af0cp+0, -0x1.68abbcp-1, 0x1.b3def6p-1, 0x1.678d38p+0, -0x1.defd5ap-1, 0x1.03bdp+0, -0x1.05013p+1, 0x1.fefb52p+0, -0x1.3461c6p+0, -0x1.1013f4p-1, 0x1.a179b4p+0, 0x1.efbc9cp+0, 0x1.a78088p-2, 0x1.8e0d62p+0, 0x1.f2c178p-1, 0x1.12d858p+0, -0x1.0cd2f6p+0, 0x1.118f6cp+0, 0x1.14491ap-5, 0x1.fd5bap-2, -0x1.14cb9cp+0, 0x1.c23218p+0, -0x1.479cfp-1, 0x1.ce7fc4p-1, -0x1.b61736p-1, -0x1.b19cc6p+0, -0x1.ce9a6ep-1, 0x1.3f5fc8p-1, -0x1.856bc8p-1, 0x1.1655a8p-3, 0x1.66fa1ep+0, 0x1.b450cep-1, -0x1.0392dap+0, -0x1.4f28c2p-2, 0x1.95ae54p-2, 0x1.0980c8p+1, 0x1.d862acp-1, 0x1.50486ap+0, 0x1.0cc318p+1, 0x1.2f0b02p-1, -0x1.11f316p+1, -0x1.d8696p-3, -0x1.4f132cp+0, -0x1.a1a42ep-2, -0x1.042cbcp+1, 0x1.284a1ap-1, 0x1.98cd8cp+0, -0x1.101626p+0, 0x1.7e96eep+0, 0x1.aa0a5ap+0, -0x1.d0923p+0, 0x1.be9364p+0, -0x1.7edff6p-1, -0x1.33b2a2p+0, 0x1.dbe246p-1, -0x1.d5c84ap-2, 0x1.1fd6ep+0, -0x1.04e354p+1, 0x1.1bedd4p+0, 0x1.e3a89cp-3, 0x1.bc2f9cp-1, -0x1.d73948p-1, -0x1.90a688p-1, 0x1.54199cp-2, 0x1.7ebf1cp-2, 0x1.bf0936p+0, -0x1.50d632p-1, 0x1.76e75cp-2, -0x1.4fd11ep-1, -0x1.b8a6a6p+0, -0x1.7b9706p-4, -0x1.bdb79ap+0, -0x1.07919ap+1, 0x1.035cf2p+1, -0x1.c4d358p+0, -0x1.34f02ap+0, 0x1.860f14p-2, 0x1.418f4cp-3, -0x1.7137p+0, 0x1.c7c74ep+0, 0x1.f065ecp+0, 0x1.0bddaep-1, -0x1.61fc2p-2, 0x1.20e01ep-2, -0x1.cd136p+0, -0x1.05298cp+1, 0x1.1bb206p-1, 0x1.035f82p-1, -0x1.94fa88p+0, -0x1.88f688p+0, 0x1.b6d62ap-1, 0x1.fa9f52p-2, -0x1.205da2p+0], [-0x1.37f17cp-1, 0x1.662484p-1, -0x1.d7ef3cp-2, 0x1.9c0ed4p+0, 0x1.bb3f9p+0, -0x1.df1a0cp-4, 0x1.dd8618p+0, 0x1.368318p-2, -0x1.f3206p-3, 0x1.424aecp-1, 0x1.a24b9ep-2, 0x1.09a8b8p+0, -0x1.54d2e2p-2, -0x1.6e617p-2, -0x1.81922ap+0, -0x1.a375f2p-1, 0x1.e6552ap-1, -0x1.f96126p+0, -0x1.9b1c52p+0, -0x1.e76eaap-2, 0x1.0adfbp+1, 0x1.07b27p+1, 0x1.3586dp-3, -0x1.b4d834p-4, 0x1.0938f8p+1, -0x1.f4345cp-1, 0x1.2e9148p-1, 0x1.4a28aap-1, 0x1.6bcddap-1, -0x1.53e3e8p+0, -0x1.8af43p-1, -0x1.02818cp+1, -0x1.e20234p-2, -0x1.317c2ep+0, 0x1.066ceap+1, 0x1.e51e5cp+0, -0x1.bfcd6cp-4, 0x1.9e3feap+0, -0x1.eb64aep-2, 0x1.ca00e8p+0, -0x1.bc5feap-1, -0x1.7d5bf2p-3, -0x1.03f27p+1, -0x1.3f637cp-2, -0x1.0e92f4p+0, 0x1.c2db94p+0, 0x1.722d82p-2, -0x1.0b5638p-1, -0x1.e86726p-2, 0x1.f360d8p-2, 0x1.5e7622p+0, -0x1.9bfd32p-1, -0x1.1b839p-1, 0x1.45455ep+0, -0x1.1aa54ep-3, 0x1.705ed8p+0, 0x1.5f646p+0, 0x1.765902p+0, -0x1.a2486ap-1, 0x1.b6f55ep-2, 0x1.9ac13cp+0, 0x1.8f806cp+0, -0x1.45a6dap+0, -0x1.7b4e34p-1, -0x1.bcb45ap+0, 0x1.aeb5cep+0, -0x1.5c5372p+0, 0x1.2e2dap-1, -0x1.df4ddap-5, 0x1.7b2db2p-4, 0x1.076c54p+1, 0x1.3b7c54p+0, -0x1.b25364p-3, 0x1.874cd2p+0, -0x1.b351dap-2, -0x1.2304ecp+0, -0x1.c3485p+0, -0x1.aec99p-2, 0x1.aeeddep-5, -0x1.df1962p-1, -0x1.128452p+1, -0x1.d590cep+0, 0x1.8f741ap+0, 0x1.eaecc8p-4, -0x1.7640eap+0, -0x1.b8ccbep-1, 0x1.9950aep-4, -0x1.3ded6cp+0, 0x1.1f68aap-2, 0x1.dc0de2p+0, -0x1.895c78p-4, -0x1.565014p-3, 0x1.4d704ep+0, 0x1.78531cp+0, 0x1.99a208p-1, 0x1.b5c9c6p-1, 0x1.52ad04p-1, -0x1.77cf5ep-2, -0x1.9e44bp-1, 0x1.2411c6p-5, -0x1.6b192ap+0, -0x1.180466p+0, -0x1.72d68ap-1, 0x1.aa982p+0, -0x1.1bcd26p-3, 0x1.a36c8cp+0, 0x1.d7b23ap-2, -0x1.faf538p+0, 0x1.4fb942p+0, -0x1.ad2106p+0, 0x1.84fa8cp+0, -0x1.69707p+0, 0x1.8c066p-1, 0x1.499246p-2, 0x1.249ebcp-1, 0x1.9398ecp-8, 0x1.55e8a8p+0, 0x1.e8322ep-1, -0x1.5cbb3ap-1, 0x1.a56e92p-2, 0x1.a85274p-1, -0x1.a2ebe4p-1, -0x1.fa6aecp-1, 0x1.4fa5b2p+0, 0x1.15737p-2, -0x1.2bb416p-1, 0x1.a86c5ap+0, -0x1.fcf028p-6], [-0x1.a4e2cep-1, -0x1.659bf8p-3, 0x1.ee5df8p-3, 0x1.fe8b7cp-1, 0x1.bd70dcp+0, 0x1.0e58eap+1, 0x1.cc5e78p-3, 0x1.152588p+0, -0x1.ec3ae2p+0, -0x1.ee66b2p+0, -0x1.6d2008p+0, 0x1.1ce38ap+0, -0x1.2a202ep+0, -0x1.5d8222p+0, -0x1.692dfep-1, 0x1.65159ep+0, -0x1.e98532p+0, 0x1.c13bdp+0, -0x1.f9a8f8p+0, 0x1.4708b2p+0, 0x1.bcc4eap-1, 0x1.0de016p-3, -0x1.c6dee8p+0, -0x1.9ffc86p+0, -0x1.03d662p+1, -0x1.e244cp+0, 0x1.ca3dc4p-4, -0x1.e9208p+0, 0x1.2a67a6p+0, -0x1.6a2bf6p+0, -0x1.2e2426p-2, 0x1.2fbe86p-4, -0x1.07151p-1, -0x1.7666f8p-2, -0x1.92b6c8p+0, 0x1.f189c8p-5, 0x1.5278fp+0, 0x1.f6d83ap+0, 0x1.0adc08p+1, -0x1.263144p-1, 0x1.bb251p+0, -0x1.3791f2p+0, 0x1.ea75f6p+0, -0x1.6dff54p-1, -0x1.0e2e7p+0, -0x1.9c8eb8p-2, 0x1.9f5576p-2, 0x1.89cd86p+0, 0x1.1e9d3cp+0, 0x1.f53722p+0, -0x1.1f44d6p-1, -0x1.502a6cp+0, -0x1.a4464p+0, -0x1.e4f88ap-2, -0x1.28af9ap+0, -0x1.ab54ccp-1, 0x1.36e846p+0, 0x1.c736b4p+0, -0x1.3f208cp-1, 0x1.b2d7b6p+0, 0x1.1965b6p+0, -0x1.02bd56p+0, -0x1.055766p-1, -0x1.c7a5f2p-4, 0x1.00e718p+1, -0x1.b8c05ep-2, -0x1.38574ep-1, 0x1.c7db88p+0, 0x1.9d4896p+0, -0x1.f76e76p+0, -0x1.e4ea3ep+0, -0x1.54c32ap+0, -0x1.1d1e7cp+0, 0x1.50859ep-3, -0x1.8d1524p+0, -0x1.6a0014p-2, -0x1.faa79cp-2, -0x1.1bbcfp+0, 0x1.590d6p+0, 0x1.1169aep+0, 0x1.e35a9p+0, -0x1.70a1eap-1, -0x1.0eaa5ep-1, 0x1.810e68p+0, -0x1.fc81c8p+0, 0x1.6aacacp+0, 0x1.5a068cp-1, 0x1.115434p+1, 0x1.f869e6p-1, 0x1.3170a4p-1, 0x1.0fe3f8p+0, -0x1.d04c3ep-2, -0x1.3092e8p-2, 0x1.a0927p-1, 0x1.a47a82p-3, 0x1.bf1f84p+0, 0x1.15f314p+0, -0x1.709c2p+0, 0x1.fb6908p-2, 0x1.ef7dap-4, 0x1.23842ap+0, -0x1.469c5ep-6, 0x1.dfaf76p+0, 0x1.005618p+0, 0x1.91538p+0, -0x1.e862aap-1, -0x1.28bbaep-1, 0x1.7ac876p-8, -0x1.ec8e62p+0, -0x1.f71698p-1, 0x1.f9f14ap+0, 0x1.40304cp+0, -0x1.d6c3c4p-1, 0x1.6b85a2p-2, -0x1.f95c6ep-2, 0x1.2af2c8p-1, 0x1.0810f8p+0, -0x1.9623e8p+0, 0x1.b486ecp-1, 0x1.989388p+0, -0x1.165b04p+0, -0x1.ad4bdp-3, -0x1.2e13b6p+0, 0x1.498794p+0, -0x1.705bdap+0, 0x1.0b2ab8p+0, 0x1.68f0e8p+0, -0x1.d49e6ep-1], [0x1.352942p-1, -0x1.282afp-1, -0x1.01f394p+1, -0x1.9a18cep-5, 0x1.9ef74cp-1, 0x1.303e92p+0, -0x1.029cc8p+0, -0x1.14b4bep-1, -0x1.468fdp-2, 0x1.97cee2p+0, -0x1.fde1e2p-1, -0x1.5c127cp-1, 0x1.954428p-4, 0x1.8b7aacp-1, 0x1.a7c954p-3, -0x1.fbaddep-1, 0x1.c0025ep-3, 0x1.ccbaa4p+0, -0x1.0525dp-8, -0x1.9eb818p+0, 0x1.f69cd6p-1, 0x1.8c9c4ap+0, 0x1.8f87acp+0, -0x1.85b308p+0, 0x1.be65d2p+0, 0x1.3dd4e4p+0, 0x1.78954ap-1, 0x1.47e64cp-7, -0x1.398e3p-4, -0x1.2217ap-1, 0x1.8f443ap-2, -0x1.5b0e5ep-1, -0x1.4d4c7cp-1, -0x1.abee0ep+0, 0x1.1e340cp-2, 0x1.f719ecp+0, -0x1.10bdc6p-5, -0x1.8dedf6p-2, -0x1.f5ae64p+0, -0x1.1a3b48p+0, 0x1.509c1cp-3, -0x1.0498p+1, 0x1.40149ep+0, -0x1.9b4086p-3, 0x1.429acp+0, 0x1.dc665cp-3, 0x1.9d8cd2p+0, 0x1.ca9d04p+0, 0x1.aeaf3p+0, 0x1.fde2b6p-1, 0x1.79af16p-2, 0x1.d54084p-1, -0x1.b28d4ep+0, -0x1.c41062p+0, -0x1.8669ep-1, 0x1.2d3f5ap-1, -0x1.29ae8ap+0, -0x1.09d0f8p+1, 0x1.3979ap+0, 0x1.58afbp+0, -0x1.cf50ccp+0, -0x1.05fd66p-2, 0x1.ef0198p-1, 0x1.6c0886p+0, 0x1.22cbbep-1, 0x1.0eabeep+0, -0x1.26823cp-1, 0x1.3c27bp-2, 0x1.2f69d4p-1, 0x1.08c3fep+1, -0x1.dc5b12p-4, 0x1.12ce88p+0, -0x1.e28b2cp-3, 0x1.6c5bf8p-2, -0x1.8b7c2p+0, 0x1.8d74f8p+0, 0x1.4d53f6p-2, 0x1.054366p-2, 0x1.4120eep+0, -0x1.67dbfp+0, -0x1.eb833ep+0, 0x1.fdce06p+0, -0x1.bb0abp-1, -0x1.065e0ep+1, -0x1.02f0a4p+0, -0x1.0334e6p-3, 0x1.a30c44p-2, -0x1.20bdf4p-1, -0x1.7c554ep-2, -0x1.3002c6p-1, -0x1.fca048p+0, 0x1.072f7ep+1, -0x1.5193ap-2, -0x1.eecb6p-1, 0x1.5403c4p-1, 0x1.cad266p-1, -0x1.846e38p-4, 0x1.b099aap-9, -0x1.bfd00ap-2, -0x1.194b4ep+0, 0x1.2a6a76p-1, -0x1.9072fep-3, 0x1.001b2ap-1, 0x1.f392eep-1, -0x1.9ff1acp+0, -0x1.25c3eep-2, -0x1.08a0c6p-2, -0x1.66990ap-2, -0x1.739bfap-1, 0x1.06d7b8p+1, -0x1.ab7246p-1, 0x1.1ac68ap+0, -0x1.b943cp+0, 0x1.d6f664p+0, -0x1.4fcf9cp+0, 0x1.926414p+0, 0x1.471f1ap-1, -0x1.254502p+0, -0x1.1eaf12p-2, 0x1.f998c8p-2, -0x1.e552d2p+0, 0x1.494df8p+0, 0x1.3aafb6p-3, -0x1.0b4d32p+0, -0x1.b65006p+0, 0x1.b0b19ep+0, -0x1.5a7ee8p-2, 0x1.069aa2p+1], [-0x1.ece6c8p-2, 0x1.e2f532p+0, 0x1.c2bbcep-1, -0x1.cf8524p-1, -0x1.e42a04p-2, 0x1.3aefdep-2, 0x1.533f38p+0, -0x1.637246p+0, -0x1.f4bdc8p+0, -0x1.07afbep+1, -0x1.556d98p+0, 0x1.a8a41ep-1, -0x1.128b94p+0, -0x1.9e5ddp+0, 0x1.01f344p+0, 0x1.440186p+0, -0x1.059bbap+0, -0x1.f649c4p-1, 0x1.acb1bp+0, -0x1.ce86d8p+0, -0x1.da4f1ep-1, 0x1.baa048p-4, 0x1.e74b9ap-3, 0x1.fa227p-2, -0x1.7ab1fp-1, 0x1.cb04dcp-2, 0x1.b0e532p+0, 0x1.cd450cp+0, -0x1.c459f8p+0, -0x1.e066aep-3, 0x1.afaa36p+0, 0x1.3d354cp-6, 0x1.4eee24p+0, -0x1.d0e0e4p+0, -0x1.a90c3ap+0, -0x1.08875ap+1, 0x1.0c0456p+1, -0x1.863bdap-2, 0x1.edff0ep+0, -0x1.235814p+0, -0x1.d0b86cp-1, 0x1.236e16p+0, 0x1.9b0464p+0, 0x1.3fddccp+0, -0x1.5b1d8ep+0, 0x1.4ae69ep+0, 0x1.54c73ep-2, 0x1.044276p+1, -0x1.575d0cp-3, 0x1.0139fcp-5, -0x1.443736p+0, 0x1.b7de6p+0, 0x1.fbdf2ep+0, 0x1.5de58ap-1, 0x1.24e89p-1, -0x1.987454p+0, -0x1.a6d01ep-4, 0x1.eef464p+0, 0x1.0d11cep+1, 0x1.8b95a4p-1, -0x1.cb596p-1, 0x1.4350dep-1, -0x1.4422acp+0, 0x1.9444bap-1, 0x1.15c4a2p+0, 0x1.4b45c2p-2, 0x1.25f92ap+0, 0x1.228e22p+0, 0x1.2180b2p-1, -0x1.0dca76p+1, -0x1.5cdc74p+0, -0x1.1861d8p+0, -0x1.55b024p+0, -0x1.2fe59p+0, -0x1.309e28p-2, -0x1.522558p-2, 0x1.f1be8p-1, 0x1.3b72e8p+0, 0x1.d6ea98p+0, -0x1.69ddd4p+0, -0x1.9a0962p+0, 0x1.d82674p+0, -0x1.a6218p-2, 0x1.141a82p+0, -0x1.863064p+0, -0x1.8aeb2ep-4, 0x1.c934c6p+0, 0x1.65300ap-2, -0x1.97f838p-1, -0x1.4b444ap+0, -0x1.4a87b6p-2, -0x1.623a08p-1, 0x1.fc7488p+0, -0x1.44bdc8p+0, 0x1.0c8a38p+0, -0x1.da3236p+0, 0x1.ebf978p+0, 0x1.c571cp-2, 0x1.685d44p-2, 0x1.e02c78p-1, 0x1.ff2a02p-1, -0x1.3f9cdep-4, 0x1.cc82b2p+0, 0x1.c23c4ep-1, 0x1.2b37ap-7, 0x1.93a06ap+0, 0x1.2c01dep+0, -0x1.9028c6p+0, 0x1.0fdea2p+1, -0x1.59edfcp+0, -0x1.11ea7ep+1, 0x1.50dd4ep-5, -0x1.2d1a96p+0, 0x1.9c651ap-1, 0x1.abd702p+0, -0x1.05223p+1, -0x1.d86346p+0, -0x1.08e6f8p-1, 0x1.549ac2p+0, 0x1.164d3cp+0, 0x1.e4ad04p+0, -0x1.67528ap-2, 0x1.792efep-3, -0x1.62822p-1, -0x1.0f441ap+1, 0x1.c021a6p+0, -0x1.ecbbe2p-1, 0x1.e1f74ap+0], [0x1.bff5cap+0, 0x1.22b0ccp+0, 0x1.5e461cp-3, -0x1.eff394p+0, 0x1.a8ab2p-2, -0x1.3fd988p+0, 0x1.1a223p+0, -0x1.0cd974p-1, 0x1.5be036p+0, -0x1.cf58a4p+0, -0x1.6f64b6p+0, 0x1.686544p+0, -0x1.a324cap+0, -0x1.c968bcp+0, -0x1.3c771ap+0, 0x1.06d24p+1, 0x1.b35a1p-1, -0x1.363876p-2, -0x1.aa582cp+0, 0x1.6d5fa8p+0, 0x1.0e7102p+1, -0x1.6698d4p-6, 0x1.034dbep+1, 0x1.35bd8p+0, 0x1.e91efcp+0, -0x1.52ecfp+0, -0x1.002948p+1, -0x1.f2e628p-3, 0x1.bb96c6p-1, -0x1.3848f6p-2, -0x1.d7a5fp-1, -0x1.0a7ecap+0, -0x1.0715a6p+1, 0x1.bc8902p+0, 0x1.c14562p-1, -0x1.610bc2p-2, 0x1.d37894p-1, -0x1.d38b4ep-2, 0x1.72104ap-2, 0x1.0b69b6p+1, 0x1.cdaa44p+0, -0x1.bb91f6p-1, -0x1.1144aep+1, 0x1.510768p-4, -0x1.045754p+1, -0x1.d6da1cp+0, -0x1.11cd88p+0, 0x1.9c9164p-3, -0x1.064342p+1, -0x1.7e295cp+0, 0x1.04526p+1, 0x1.876c6ep-1, -0x1.873814p+0, -0x1.e6dcbp+0, 0x1.d0f396p-1, 0x1.c7636ep-1, -0x1.9cb25ep-1, 0x1.ce0184p+0, -0x1.56b16p-3, 0x1.caa204p+0, -0x1.0364b6p+1, 0x1.7a6912p+0, -0x1.8e0bdep+0, 0x1.8774acp-2, -0x1.de837p+0, 0x1.72af38p-1, 0x1.bb3d64p+0, -0x1.2968ecp-1, -0x1.a099ap-1, 0x1.a18a46p-1, 0x1.067a4ep+1, 0x1.7e8e9ap-1, 0x1.ac70d2p+0, -0x1.44e5ap+0, -0x1.1321f6p-1, 0x1.584d04p+0, 0x1.6c219ep+0, 0x1.06b006p+1, 0x1.0066b8p+0, -0x1.9a0446p+0, -0x1.2f0b18p+0, 0x1.283f92p+0, 0x1.11d7e6p-1, 0x1.4ad562p-1, 0x1.038664p+0, -0x1.3432d6p+0, 0x1.d0f41ap+0, 0x1.8a8964p+0, -0x1.085fdp-1, 0x1.b1c9d6p-2, -0x1.9ca296p-3, -0x1.3ea9acp-1, 0x1.004a8cp-2, -0x1.bc92ccp-4, -0x1.247432p-1, -0x1.149046p+0, -0x1.8b7bc8p-1, -0x1.2d72d4p-1, -0x1.1c7304p+0, 0x1.b3f174p+0, 0x1.89acfep-1, 0x1.c3d3dp-2, 0x1.0c7922p+1, 0x1.513924p+0, 0x1.9cc652p+0, -0x1.b18d06p-2, 0x1.60f046p+0, 0x1.2314bcp-2, 0x1.0125bep+1, 0x1.ae8fb8p-2, -0x1.23947p+0, 0x1.21979ap+0, -0x1.58671ep-1, -0x1.f3b78ep-2, -0x1.3947f2p-1, 0x1.f481fcp+0, -0x1.74bc5p+0, -0x1.108b16p-1, -0x1.cf8f1ap-1, -0x1.c7db7p+0, -0x1.9234cap-3, -0x1.1d054cp-2, 0x1.9640eap+0, 0x1.d85ddep-1, 0x1.249c6p+0, 0x1.aea086p+0, -0x1.3d88a4p+0, -0x1.4110d2p-1], [-0x1.1114ecp+0, 0x1.fc6342p+0, 0x1.d8f682p+0, -0x1.d29a4cp-1, 0x1.52e07ap-1, 0x1.0bda16p+1, 0x1.090e84p-5, 0x1.bcaa6ap-1, 0x1.9193d6p+0, -0x1.c84f16p-1, 0x1.193ad8p+0, -0x1.0c47ecp+1, -0x1.63e63ap+0, -0x1.3c6ee2p+0, 0x1.cbf76ep+0, -0x1.9e5176p+0, -0x1.edba52p-1, -0x1.b97794p-2, -0x1.7bc308p+0, -0x1.375792p-7, 0x1.b596fep-2, -0x1.67d89p-5, -0x1.6c9124p+0, -0x1.7eb754p+0, -0x1.bd8346p+0, 0x1.c5c13ap-1, 0x1.bcff52p+0, -0x1.90a572p+0, 0x1.30c3d4p-1, 0x1.1b4c2p+0, -0x1.8caee2p-3, -0x1.c7942p-2, 0x1.9cd1aap-2, -0x1.f27baap+0, -0x1.15142ep-1, -0x1.7e456ap+0, 0x1.135902p+0, -0x1.271fd4p+0, 0x1.d9e5dap-2, 0x1.a54d0ep-6, -0x1.6b4fa2p+0, 0x1.4d45c2p-1, -0x1.b27b62p-1, 0x1.cc0804p+0, 0x1.e08cc2p-4, -0x1.34f3fp-1, -0x1.e1399ap-3, 0x1.2b23d2p-1, 0x1.715ad6p+0, -0x1.04421p+0, -0x1.d09deep-5, 0x1.dc131ap-1, -0x1.a6487ap-1, -0x1.10ec52p+1, -0x1.53514p-1, 0x1.6a1aa8p-2, 0x1.0ca70ap-2, 0x1.a84f28p+0, 0x1.bdbf8ep+0, 0x1.32d3dap+0, 0x1.05d396p-1, 0x1.68633ap-1, 0x1.abd54ep-1, 0x1.2e452cp-2, 0x1.1c9abep+0, 0x1.0d2e84p+1, -0x1.ff98bap+0, 0x1.1aadd8p+0, 0x1.747648p-2, 0x1.8a6646p-2, 0x1.024d24p-1, 0x1.bc8bfap-1, 0x1.d92b58p+0, 0x1.8d6a32p+0, 0x1.106a64p-1, -0x1.83310ap-1, 0x1.aca302p+0, 0x1.039674p-1, 0x1.08c59p-13, 0x1.fa1272p-3, -0x1.063a6ap+1, -0x1.8c5246p+0, -0x1.bcf9cep+0, 0x1.0cb1eep+1, -0x1.93dbd6p+0, 0x1.97bcbp-2, 0x1.0f593p+0, 0x1.46c36ep+0, 0x1.30ba1p-2, -0x1.3c3614p-1, 0x1.94b19cp-2, -0x1.4451dcp+0, -0x1.554414p+0, -0x1.3a6e98p+0, -0x1.5fa026p-1, -0x1.87f8d4p-1, 0x1.196fe2p-1, 0x1.c0eeeap+0, -0x1.ba0466p-1, 0x1.e004bp+0, 0x1.a6a39ap-3, 0x1.20f82cp-1, -0x1.86c69ap+0, 0x1.210c6ap-1, 0x1.5c807p-1, 0x1.9a5c54p+0, -0x1.7a4cf8p-1, 0x1.0e5fdap+1, 0x1.6d7b98p-2, -0x1.e8c8dcp+0, -0x1.129a16p+1, 0x1.2ecfe6p+0, 0x1.83927p-1, 0x1.279768p-1, 0x1.164ab2p+0, 0x1.8e6c28p-1, -0x1.7c1228p+0, -0x1.5854ecp-1, -0x1.1e77dcp+0, 0x1.b14ebap-2, -0x1.0f73bep+0, 0x1.bd7594p+0, -0x1.4380dcp-2, 0x1.b99384p-1, 0x1.461872p+0, -0x1.6fa42p-1, 0x1.04a772p+1, -0x1.071f66p-3], [-0x1.c63d14p+0, 0x1.84f65p-1, -0x1.af7e18p-2, -0x1.fe40cap+0, -0x1.a7f9b2p+0, 0x1.c3893ap+0, 0x1.915p+0, 0x1.ba58f4p+0, 0x1.11cbf6p-1, 0x1.42dee4p-1, -0x1.9352bcp+0, 0x1.ddacd8p+0, -0x1.7fa3e8p-2, 0x1.90fd2cp-3, 0x1.ebe684p+0, -0x1.55e3e8p-1, -0x1.ceef98p+0, -0x1.18855cp-2, -0x1.c43764p-2, -0x1.d6ecc6p-1, 0x1.8e64d8p+0, 0x1.a1620cp+0, 0x1.50b7d8p+0, 0x1.a00a6p+0, -0x1.aa5fb8p+0, 0x1.00dc1p+0, -0x1.fad56ep+0, 0x1.2c2f48p-5, -0x1.4be77p-1, -0x1.9ce97p+0, -0x1.9688aap+0, 0x1.52d1f4p-1, -0x1.d2cc9cp+0, 0x1.08607ep+0, -0x1.7952bcp-2, 0x1.1101cap+1, 0x1.f35bc8p-1, 0x1.c233e2p-1, 0x1.e2f5eap-2, 0x1.e1481p-1, 0x1.9a39d6p+0, -0x1.6dd89cp+0, 0x1.dddb4cp-1, -0x1.46f2cp+0, 0x1.a2a724p+0, -0x1.9e25e2p-1, 0x1.904276p+0, 0x1.157df8p-3, 0x1.1b300ep-3, 0x1.c5883cp+0, 0x1.4cfbbep-3, -0x1.cb5778p+0, 0x1.9e23bap+0, 0x1.0186a4p-3, 0x1.5471a4p-1, 0x1.9f85b2p+0, 0x1.06aa26p+0, 0x1.79275ap+0, 0x1.d548c8p+0, -0x1.ee95f6p+0, -0x1.6b810cp+0, 0x1.60633cp-2, -0x1.a6c0b8p+0, -0x1.d9107p+0, -0x1.2a3e2cp-3, 0x1.bb6e6cp-5, -0x1.05f0d4p-1, -0x1.0f4c0ap+1, 0x1.a9fc0cp+0, -0x1.e4b9dcp+0, -0x1.95f582p+0, 0x1.c4c11cp+0, 0x1.bfe86ap-1, -0x1.c4c0ecp+0, 0x1.12eefap-3, 0x1.b5c0eap-2, -0x1.d9fe78p+0, 0x1.76e6dap+0, 0x1.be2984p+0, 0x1.2e5d94p-2, 0x1.03559ap-3, 0x1.7a2e6cp-2, -0x1.b508cap-6, -0x1.f38c24p-2, 0x1.0649f8p+1, 0x1.58c48ap+0, -0x1.1eecb2p+0, -0x1.bca25ap-2, -0x1.15473ep+0, -0x1.f2701ep-3, -0x1.e6cc7ep+0, -0x1.03fdd8p+1, -0x1.f038f6p+0, -0x1.01191ap+1, -0x1.54e7b4p+0, -0x1.ac957cp+0, 0x1.100484p+0, 0x1.5f00d4p+0, 0x1.b9115cp+0, -0x1.d6abacp+0, 0x1.9b384cp+0, -0x1.0e5e5ap-1, 0x1.af1b1cp+0, 0x1.7ccbc6p+0, 0x1.564b6ep-1, 0x1.2fb31ap-1, -0x1.52ea32p-1, -0x1.d8e544p+0, 0x1.2a9d5ap-3, 0x1.f4933ep-1, 0x1.013434p+1, -0x1.325664p-1, 0x1.ac5768p+0, 0x1.b713b2p+0, 0x1.25df58p+0, 0x1.af63e8p-1, -0x1.d9b4d2p+0, -0x1.357064p-1, 0x1.af7baep-1, -0x1.d8aa02p+0, 0x1.956ecep-2, -0x1.6acc5p-2, 0x1.08507ep-2, 0x1.802c6ep-1, 0x1.fa3c96p+0, -0x1.87e294p-4, -0x1.2859acp+0, 0x1.cc0428p+0], [-0x1.e0fbfp-1, -0x1.7e872ap+0, 0x1.29800cp+0, -0x1.3f52a8p-2, -0x1.a4523cp-3, -0x1.58fd72p-2, -0x1.70ccdcp-1, -0x1.d1c16ep-2, -0x1.38929cp-1, 0x1.213fb8p-1, -0x1.8c7d6ap-2, -0x1.27231ep+0, 0x1.d187e4p-5, -0x1.fdfb72p+0, -0x1.6c2bdp-7, -0x1.e7fd6cp+0, -0x1.e7722p+0, 0x1.413e46p+0, 0x1.2501aap+0, 0x1.c5adc4p+0, 0x1.c99e58p-1, 0x1.31a14cp+0, 0x1.8f3c1p+0, -0x1.bc79a2p+0, -0x1.6de71cp-1, 0x1.b64f8cp+0, -0x1.2f314ep-1, -0x1.45eb6cp-4, -0x1.0de77cp+1, 0x1.05c654p+0, 0x1.e80b4ep+0, 0x1.6da8fcp+0, 0x1.5b9f28p+0, -0x1.54f17ap-2, 0x1.1cf846p+0, 0x1.a7592p+0, 0x1.0d2d48p+1, 0x1.863ba2p+0, -0x1.0887d8p+0, 0x1.41ec04p+0, -0x1.f08298p+0, -0x1.0565cp+0, -0x1.711c84p-1, 0x1.87aa54p+0, 0x1.67caeap+0, -0x1.0a2a5cp-2, -0x1.382d3ep+0, 0x1.a61f96p-1, 0x1.18c216p+0, -0x1.40ff56p-1, -0x1.ba56dap+0, -0x1.94220cp-1, 0x1.cf1b22p+0, -0x1.9fbd16p+0, 0x1.5b2624p+0, 0x1.8fd4dcp+0, 0x1.e5bfd2p+0, 0x1.63b798p-1, -0x1.67d232p-2, -0x1.6d4fep-1, -0x1.5f257p-1, 0x1.bbd058p+0, 0x1.1bb1bep+0, -0x1.9c7b38p-1, 0x1.0766e4p+1, -0x1.77b71cp-3, -0x1.611c1ep+0, -0x1.0054bp+1, 0x1.4065ccp-2, -0x1.905cdcp-1, -0x1.f07b8ap-2, -0x1.4a1b4ap-4, -0x1.8946acp+0, 0x1.56888ep+0, -0x1.729a7cp+0, -0x1.d5a7eep+0, -0x1.d0ec7ap+0, 0x1.787d3ap-1, 0x1.76ab0ep-2, -0x1.005cd4p+1, -0x1.ce29fp-1, -0x1.5f6b1p+0, 0x1.413a32p+0, -0x1.bb154cp+0, -0x1.9e924ap-1, -0x1.3406d2p+0, 0x1.395f8cp+0, -0x1.26b04ep-1, -0x1.6d68bp-1, -0x1.b1fef8p-1, -0x1.a83a34p+0, -0x1.798214p-1, -0x1.0b1002p+1, 0x1.baf1e2p-2, 0x1.c9fa14p-1, -0x1.708038p+0, 0x1.282452p-1, 0x1.57a94p-1, 0x1.ac9f54p-2, 0x1.25c628p-1, -0x1.03ad26p+1, 0x1.ff296p-3, -0x1.708816p-5, 0x1.a6a1fep+0, 0x1.cdea72p+0, -0x1.8582b2p-5, 0x1.2245f6p-1, 0x1.5b8edcp-1, -0x1.d5df1cp+0, 0x1.0bc702p+0, 0x1.abad54p-2, -0x1.dc9abap-1, -0x1.103662p+1, -0x1.f075aep+0, -0x1.b8eb7ap+0, 0x1.0b23fp+1, 0x1.436d5p+0, 0x1.caea46p-5, -0x1.703ba4p-1, 0x1.789d0cp-2, -0x1.9fcd2ap+0, -0x1.d72044p+0, -0x1.2dcce4p-3, -0x1.d3808ap-2, -0x1.1ccf0ap+0, -0x1.4a7c16p-1, 0x1.ee9ebp+0, 0x1.0dafdp+0], [-0x1.d1f506p-1, -0x1.01ac04p+1, 0x1.a88f2ap+0, 0x1.e53a02p-2, -0x1.65bef8p+0, -0x1.18bd62p+0, -0x1.1611cap+0, 0x1.2a3c84p-1, -0x1.258eeep+0, -0x1.7457d8p-1, -0x1.a81cap+0, 0x1.0ee806p+1, 0x1.a914d8p+0, 0x1.cb1b5p+0, -0x1.43e856p-1, -0x1.35edap-5, 0x1.31734ep+0, -0x1.879fbep+0, 0x1.936ab6p+0, 0x1.be92p+0, 0x1.5523cep+0, 0x1.f296bep+0, 0x1.68dcaap+0, 0x1.667c12p+0, 0x1.cf097ep+0, 0x1.12fecp+0, 0x1.c1d56ap+0, -0x1.c6cbap-2, 0x1.bd2f4p+0, 0x1.1a0c5cp-1, 0x1.ffbefep+0, -0x1.ca28c6p-1, -0x1.9ac08cp+0, -0x1.ef2618p-1, 0x1.082cf2p+0, 0x1.06fafcp+0, -0x1.40b44p+0, 0x1.8ff1dp+0, 0x1.4c18dep-2, 0x1.8dc114p+0, -0x1.de0506p+0, -0x1.7c73e6p-2, 0x1.180f4cp-1, -0x1.b0b258p+0, 0x1.6fc9aep-4, 0x1.47339ap-2, 0x1.a49b38p+0, -0x1.ab1a62p-1, 0x1.ac6192p+0, -0x1.a6b768p-1, -0x1.ea037ep+0, 0x1.0b3a2ep-2, -0x1.5ca6fcp-4, -0x1.bd54e8p+0, 0x1.d4417ap-3, -0x1.7cd014p-2, -0x1.cd3ca8p+0, -0x1.b14c8ep+0, 0x1.331efap+0, 0x1.e29764p-3, 0x1.ef2aa4p+0, -0x1.2ba762p+0, -0x1.b77b18p+0, 0x1.53f9e2p-1, 0x1.6a589p+0, 0x1.f6c904p-3, 0x1.b119fp+0, -0x1.6c5afep-2, 0x1.2712aap+0, -0x1.24608ap-3, -0x1.d3e44ep+0, 0x1.cbfd88p+0, 0x1.92c5b2p+0, 0x1.b7ca96p-2, -0x1.0473c2p+1, 0x1.acb486p-1, 0x1.a0b94ap+0, 0x1.cfc004p+0, 0x1.4cca88p+0, -0x1.ac00c6p+0, -0x1.2f84e8p+0, 0x1.349fbcp-1, 0x1.aec0ap-3, -0x1.843e9ap-6, 0x1.baedf8p+0, 0x1.b6407ap-1, -0x1.75d202p+0, -0x1.effd2ap-1, -0x1.777252p-1, -0x1.2aee06p+0, 0x1.0e27c4p+1, 0x1.2173d2p+0, 0x1.0702aap+1, -0x1.c4a0a8p+0, 0x1.0f1456p+0, -0x1.64c74ep-2, 0x1.eed756p+0, -0x1.3cb0f8p-2, -0x1.abfee8p-3, 0x1.88c25p+0, -0x1.d1041ep+0, -0x1.eef426p+0, -0x1.46cdbp+0, -0x1.4758ap-1, 0x1.200122p+0, 0x1.f88cb2p-2, 0x1.92d792p-3, -0x1.c35558p+0, 0x1.57341ep-2, 0x1.a33af2p+0, 0x1.2e9c3p-1, 0x1.41450cp-1, -0x1.e52606p-4, -0x1.deed1cp-1, -0x1.18e726p+0, -0x1.75b8cep-2, 0x1.80054ap-1, 0x1.11140ap+1, 0x1.1499fap+0, 0x1.9b9026p-2, -0x1.bd4654p+0, -0x1.e2efa4p-3, 0x1.0e47b6p+1, 0x1.73c8d4p+0, -0x1.b2b9dp-1, -0x1.030c8ap+1, -0x1.a055d2p-1, 0x1.262282p+0], [-0x1.bea14ap-3, 0x1.909b6ep-10, -0x1.c42876p+0, 0x1.aca584p-2, -0x1.c79244p-3, 0x1.039aap+1, 0x1.a3274p+0, 0x1.987d06p+0, -0x1.d4d204p+0, -0x1.730288p-3, 0x1.f0fdaap+0, 0x1.970af2p+0, -0x1.bd4d18p+0, 0x1.505f7ep-3, -0x1.0455d6p+1, 0x1.9e1146p+0, 0x1.9cc556p+0, -0x1.99b4e6p-1, -0x1.3a8feep+0, -0x1.2f1652p-2, 0x1.ad03acp-1, -0x1.5bc54ep+0, 0x1.9ceae4p-8, -0x1.cf53f6p+0, 0x1.1d67fcp-1, 0x1.821d72p-3, 0x1.d9c844p-1, 0x1.dcf4b2p-1, 0x1.016e9cp+0, 0x1.08c90ap-1, -0x1.fc53d8p+0, -0x1.588bdcp-2, 0x1.afbabcp+0, 0x1.7445e4p-4, -0x1.6f7268p-1, -0x1.aa405p-2, 0x1.e828aep-4, -0x1.d1fed2p+0, -0x1.ee874cp-3, 0x1.2b7962p+0, -0x1.060e78p+1, 0x1.10f38p+1, 0x1.47dda4p+0, -0x1.78a42p+0, 0x1.697516p+0, -0x1.4d47bep+0, 0x1.bf58c2p-4, -0x1.6fcc16p+0, -0x1.0f783p+1, -0x1.c8df7ep-3, 0x1.702b7cp+0, -0x1.30b226p-1, -0x1.e5e7fap-3, 0x1.51391cp+0, 0x1.25e10cp-4, -0x1.991c2p-1, 0x1.8ec93ep-2, 0x1.5aec0cp-1, -0x1.c4787ap+0, -0x1.b64af4p-1, 0x1.b2007ap-4, 0x1.ec3b98p+0, 0x1.68ef9cp+0, 0x1.a3ab92p-2, 0x1.7f1662p+0, 0x1.0a7814p+1, 0x1.be0848p-1, -0x1.c800eap-3, 0x1.525ab6p+0, -0x1.ed633ap+0, -0x1.463a68p+0, -0x1.e2403ep-4, -0x1.d7cb46p+0, -0x1.0128e6p+1, 0x1.3a2328p-1, 0x1.675b12p-2, 0x1.97f39p+0, -0x1.1e17b8p-1, -0x1.50165cp-1, 0x1.fbbd1ep-1, -0x1.40c73ap+0, 0x1.0a9a8p-2, 0x1.91a8b2p+0, -0x1.dd2ed2p-2, -0x1.71e00cp+0, -0x1.14346cp-1, 0x1.d709fep-3, -0x1.0c6cf4p+0, -0x1.3dddaap-1, -0x1.7185cap-3, 0x1.00b138p-3, 0x1.c034fp+0, -0x1.7de6fap+0, -0x1.cc8234p+0, -0x1.14c88p-1, -0x1.8f9ad4p+0, -0x1.4e585ep+0, 0x1.0c6e8ep-1, -0x1.4453c8p+0, -0x1.b88f62p+0, -0x1.07a19ap+0, -0x1.c2b602p+0, -0x1.24feaap-1, 0x1.254f2p+0, -0x1.0377cap+1, -0x1.2e731cp+0, 0x1.391aaap-2, 0x1.7fb696p-4, 0x1.01b92p-1, 0x1.e658f4p+0, -0x1.99421ep+0, 0x1.bdb696p+0, 0x1.99865p-4, -0x1.c9289cp+0, 0x1.001b26p+0, -0x1.b6e724p+0, 0x1.f28b26p-1, 0x1.88e8f6p+0, -0x1.2a8264p+0, -0x1.9d5a1p+0, -0x1.aaca22p+0, -0x1.5d6ee8p+0, 0x1.f96e7cp+0, -0x1.42437ep+0, -0x1.e4a8b8p+0, 0x1.5f624ep+0, -0x1.1316p+0, 0x1.a21ee6p+0], [-0x1.57c32cp-1, 0x1.b91a9p+0, 0x1.1fffc2p-8, 0x1.913a5ep-1, -0x1.2011d6p-1, -0x1.0baacap+1, 0x1.1ed976p-1, 0x1.95c652p+0, 0x1.c73c34p+0, 0x1.fd1426p+0, 0x1.03c9b6p+1, -0x1.66f76ep-2, 0x1.535c9ap+0, -0x1.d65ec6p-1, 0x1.9f7c02p-1, 0x1.ab861ap+0, -0x1.b7abd8p-1, 0x1.c9bd6ep+0, 0x1.aafa26p-1, -0x1.0b1718p+0, 0x1.ef5adp-6, 0x1.84fc64p-1, 0x1.a220bcp-4, 0x1.2884d4p+0, 0x1.3b1712p-1, 0x1.c4054p-3, -0x1.108f76p+1, -0x1.01252ep+1, 0x1.ebf0aap+0, 0x1.cb6f46p-2, -0x1.fbd8dcp+0, 0x1.ee5d1ep-1, 0x1.280016p+0, -0x1.b8e152p+0, -0x1.0751ap+1, -0x1.babf6ap-1, -0x1.da91p-2, 0x1.4425a8p+0, 0x1.4e8186p-6, -0x1.84c76p-4, -0x1.32f1e2p-3, 0x1.bedcdcp-2, -0x1.063184p+0, 0x1.5471c8p+0, -0x1.58daaep+0, -0x1.0518cap+0, 0x1.211888p+0, -0x1.7ced8cp-4, -0x1.7eebbp+0, 0x1.e7a98ep-1, -0x1.fece5p+0, 0x1.28006p+0, -0x1.93605cp+0, -0x1.44f566p-1, 0x1.73281ap-1, -0x1.ef609cp+0, 0x1.0af8f8p+0, 0x1.2d2ca4p+0, -0x1.44c04cp-1, 0x1.180bbcp-1, 0x1.ca63aap+0, -0x1.0c0b8cp-4, -0x1.974a28p+0, -0x1.f5651ep+0, 0x1.6f8886p+0, 0x1.0486acp-2, -0x1.10c73ap-1, -0x1.deac54p+0, -0x1.1f5f94p-1, 0x1.4d13c2p+0, -0x1.0425c2p+0, 0x1.820e2ap+0, -0x1.e4a69ap-1, -0x1.c13c54p-3, -0x1.c1e4c4p+0, -0x1.46fadap+0, 0x1.425832p-1, 0x1.71cbeap+0, 0x1.2e355ep+0, 0x1.870506p-1, 0x1.162f9cp-3, -0x1.082484p-1, -0x1.96b98cp+0, 0x1.59892ap+0, 0x1.422dc8p+0, -0x1.6de624p+0, 0x1.a9428ap+0, 0x1.56195cp+0, -0x1.8b8ac6p-1, 0x1.cc2dfap-2, 0x1.9b5066p-1, 0x1.503b82p-1, -0x1.94f77ap-4, 0x1.d79a02p-2, 0x1.b3f47p-4, 0x1.378286p+0, -0x1.b929a4p-6, -0x1.4909e8p-2, 0x1.11dadp-1, -0x1.c4fa2p+0, -0x1.504866p+0, -0x1.daa70ep+0, -0x1.05485ep-1, -0x1.fd7e82p-1, 0x1.325cccp+0, -0x1.3d8cfp-3, 0x1.87bf14p-2, 0x1.09f3aap+1, 0x1.16c15p-1, -0x1.1b2b42p-2, -0x1.040ebap+1, -0x1.926754p+0, 0x1.d3a84ep+0, 0x1.58b7cp+0, 0x1.dafabcp+0, -0x1.b85a4cp-2, 0x1.c76ae8p-2, -0x1.fe964ep+0, -0x1.03e57ap+1, 0x1.451566p+0, 0x1.ce12fap-4, 0x1.6396a6p+0, -0x1.9b4a48p+0, 0x1.a0c96ap-1, -0x1.036c94p-1, 0x1.db315ap+0, 0x1.363384p+0, 0x1.e6c508p+0], [-0x1.a985f8p-1, -0x1.07162ep-2, -0x1.e15e52p-1, -0x1.f23a38p+0, -0x1.12a7aap+1, 0x1.173338p-3, -0x1.61fe8p-2, -0x1.f8732ap-1, -0x1.399872p-4, 0x1.71afc2p+0, -0x1.fee7c2p-1, -0x1.d1071cp-1, -0x1.851288p-2, -0x1.2a1eeep+0, -0x1.0f87ap+1, -0x1.0abfa6p+1, 0x1.47790cp-5, 0x1.cb39f6p-3, -0x1.0d7e8cp-1, -0x1.1297f6p-6, 0x1.faa6ap-3, -0x1.593966p+0, 0x1.2104f6p+0, -0x1.c6a51cp+0, 0x1.c72132p-2, 0x1.31f57cp-4, 0x1.4523c4p+0, 0x1.11eeb2p+1, -0x1.0b797ep+0, 0x1.ea1f9ap-1, -0x1.52fbdcp+0, -0x1.968c78p+0, -0x1.d6e278p+0, -0x1.6e356ep-1, -0x1.a69f1ap-2, -0x1.3c974cp-2, -0x1.6b6e76p+0, -0x1.087fb4p-3, 0x1.51491cp-3, 0x1.c2e8eep-1, 0x1.a1fa9ep-3, -0x1.9d4eb4p-3, -0x1.b0c89p-4, -0x1.c22d8ap+0, -0x1.906caep+0, -0x1.8049d2p+0, -0x1.fdc9cap+0, -0x1.1f1d78p+0, -0x1.b3c08cp+0, -0x1.a118bep+0, -0x1.5ae5cep+0, -0x1.236302p-1, 0x1.8b6ecp-1, -0x1.3ef988p-1, 0x1.55f7e8p+0, 0x1.9b1ae4p-1, 0x1.85bcc8p-1, -0x1.4d0a1cp+0, 0x1.f8f4eep+0, 0x1.f33e06p+0, -0x1.98868cp+0, 0x1.6b20bcp+0, -0x1.8c50d6p-1, -0x1.84486cp-4, -0x1.955fdp-3, 0x1.8e4256p+0, 0x1.921f38p-1, -0x1.d2c9f8p-1, -0x1.e6005ap-3, -0x1.5db1dap+0, -0x1.77de8cp+0, 0x1.90362ap+0, -0x1.c51748p+0, 0x1.d69c24p-1, 0x1.35091ep-1, 0x1.04707ap+0, -0x1.cfcf58p-4, 0x1.427264p+0, -0x1.9c841ep+0, 0x1.a85f9ap+0, -0x1.4a98ecp-1, 0x1.c9a01p-1, 0x1.8b4c1p-1, 0x1.8a282ap+0, -0x1.02b8e2p+0, 0x1.960264p+0, 0x1.a75756p-3, -0x1.05278ap-1, -0x1.5e905ap-1, -0x1.f2520ap+0, -0x1.fdc5dap+0, 0x1.7c2738p+0, -0x1.09d038p+0, 0x1.b0c058p+0, -0x1.0b7484p+0, -0x1.ff0a88p-3, -0x1.9c4338p+0, 0x1.1a1dbap+0, -0x1.813a6ep+0, 0x1.6e58d6p+0, 0x1.ea00f4p+0, 0x1.936928p-4, 0x1.236b52p+0, 0x1.b4c216p+0, -0x1.f854d4p-5, -0x1.1d13bep+0, -0x1.051a7ep+1, 0x1.0e84fep+0, -0x1.633876p-1, -0x1.4dabf8p+0, 0x1.b50146p-2, -0x1.766c7cp+0, -0x1.fb601cp-1, 0x1.16f078p-2, 0x1.b5bdp-3, -0x1.94a2eap+0, -0x1.0d138ep-2, -0x1.9486f2p-1, -0x1.6feea4p-2, -0x1.22a068p+0, 0x1.34caf6p-1, 0x1.66fb02p-6, 0x1.c045aap+0, 0x1.338b54p-1, -0x1.e1e908p+0, -0x1.b595f8p-1, -0x1.39ada4p+0, 0x1.923618p+0], [-0x1.1af56cp+0, 0x1.008ca2p-1, 0x1.fc439ep+0, -0x1.5cc8ap+0, -0x1.af7022p-1, -0x1.123874p+1, -0x1.d10648p-3, -0x1.577342p+0, 0x1.029d46p+0, 0x1.ff36bcp-1, -0x1.7e0f2p-1, 0x1.bab4eap+0, -0x1.021b26p-1, -0x1.bc8f36p+0, -0x1.0b7f0ep+1, -0x1.f2e57ep-3, 0x1.df4de4p-1, -0x1.6573c4p+0, 0x1.4fb05cp+0, 0x1.00a702p+0, 0x1.36bb98p+0, -0x1.04ac86p-2, 0x1.8bea2ep-1, 0x1.cee5b6p+0, 0x1.f8114ep+0, 0x1.afd1a6p+0, -0x1.df4e18p+0, 0x1.6e2d14p+0, -0x1.1e5e6p-2, -0x1.b4a6ap+0, 0x1.05fbccp-2, -0x1.6d685p+0, -0x1.afef4p-7, -0x1.21536ep+0, 0x1.76d146p-1, -0x1.4f0caap-1, 0x1.b8593cp-1, 0x1.c32738p+0, -0x1.0abccp-3, 0x1.442dd4p-4, 0x1.47ad3ep+0, 0x1.e8bc66p-3, -0x1.4e1076p+0, 0x1.7aa7a4p-4, 0x1.7688a2p-1, -0x1.35a59ep-1, 0x1.42ecb6p+0, 0x1.3cd74ep+0, 0x1.df11cap-1, 0x1.235944p-3, 0x1.223288p+0, 0x1.8016ccp+0, -0x1.29b85ap-1, -0x1.426312p-4, -0x1.1a9b56p-1, -0x1.b48eb2p-5, -0x1.d07af8p-1, 0x1.ed78b4p+0, -0x1.55d834p-3, 0x1.7a62b2p-1, -0x1.b52beep-3, -0x1.f56472p+0, 0x1.d44ebap+0, 0x1.010f3ap-1, 0x1.c843e2p-9, 0x1.a751e4p+0, -0x1.d39912p-3, 0x1.3b129ep+0, -0x1.04c42cp+0, -0x1.5021b6p-1, -0x1.f81534p+0, 0x1.0ed7fep-1, -0x1.068c3ep+1, 0x1.e2c27cp-2, 0x1.e24c44p-2, -0x1.3202eep+0, 0x1.e6b0e6p-2, -0x1.9b67aep+0, -0x1.26131ep+0, 0x1.6797aap-2, -0x1.057836p+0, 0x1.32c864p-1, -0x1.7da2dap-7, -0x1.10f96cp+0, -0x1.d8ef3ep-1, -0x1.5c7ebep-1, 0x1.7ad0d6p-1, -0x1.b789a2p-1, 0x1.a50eb8p-3, 0x1.c178aap+0, -0x1.2e97f8p-1, 0x1.47e8fap+0, -0x1.7372f6p+0, -0x1.5f5838p-4, 0x1.1475ecp+0, -0x1.b8db72p-2, 0x1.fb3eap+0, 0x1.0847aep+0, 0x1.046d02p+1, 0x1.60eacep+0, -0x1.c449e4p+0, 0x1.0367a6p+1, -0x1.cd90f4p-2, -0x1.bb0754p+0, 0x1.9f52f2p+0, 0x1.b49776p-2, 0x1.117da8p+1, 0x1.34397ep-1, -0x1.d43ad2p+0, 0x1.20ce84p-2, 0x1.877e82p-1, -0x1.490b9p+0, 0x1.c1a54p+0, 0x1.c55094p+0, 0x1.f618eap+0, 0x1.6ea4a4p-1, 0x1.a705ap-1, 0x1.5886ccp+0, 0x1.4c5e04p-5, 0x1.53d77p-3, 0x1.560632p+0, -0x1.7ebde2p+0, -0x1.12293ap+1, 0x1.2fc63p+0, -0x1.7630f6p+0, -0x1.6eab8p+0, -0x1.05d802p-1, 0x1.e6f55ap-4], [0x1.8d19e4p+0, 0x1.10ce72p+1, -0x1.10f39ap+1, 0x1.19ab3p+0, -0x1.c60a88p+0, 0x1.10b926p+1, -0x1.c8d59p-2, 0x1.62374cp-1, 0x1.42927ep-2, -0x1.f63198p+0, -0x1.6a10d6p+0, -0x1.266058p+0, 0x1.55df68p-2, -0x1.2ea2bep+0, -0x1.805952p+0, -0x1.aa7e48p+0, -0x1.6cbccep-1, -0x1.0c3788p+0, 0x1.a39274p+0, -0x1.628ad8p+0, -0x1.2593bcp+0, 0x1.7eb1ap-4, 0x1.4c99b2p+0, 0x1.11d5dp+1, 0x1.176324p+0, -0x1.265bbp-3, 0x1.225b42p-2, 0x1.1107d8p+1, 0x1.12c46cp-3, 0x1.1b6808p+0, 0x1.698f06p+0, 0x1.1205e8p-1, 0x1.430004p+0, -0x1.e3e592p+0, -0x1.dd529ap+0, 0x1.07674ep+0, 0x1.b1e70ep+0, -0x1.8c08dep+0, -0x1.a06dd8p+0, -0x1.95d834p-2, 0x1.5f3e74p-2, -0x1.50107p+0, -0x1.bad894p-1, 0x1.3f373ep-1, 0x1.7a1f08p-5, 0x1.4733fep-2, -0x1.a761b8p+0, -0x1.5a5e26p+0, 0x1.0efc1ap+1, -0x1.b73dd4p-1, 0x1.f22012p-2, 0x1.286b5cp+0, -0x1.0f7a9cp+1, -0x1.a92f4p-1, 0x1.5cfaa2p-2, 0x1.9570fap+0, -0x1.c6c10ep+0, 0x1.1931bep-1, 0x1.53007ep+0, -0x1.bfe0dp+0, -0x1.ec2b26p+0, -0x1.7d56a6p-1, -0x1.44c09p-1, -0x1.2264d8p+0, 0x1.2b664ap-1, 0x1.6f63d8p+0, -0x1.176152p-1, -0x1.4dd408p+0, -0x1.c5576cp-1, -0x1.623cfcp+0, -0x1.5ce1c2p+0, 0x1.ce5a9cp+0, 0x1.34d67ep-1, -0x1.3a119ep-5, 0x1.115f38p-2, -0x1.a4327cp+0, 0x1.790356p-2, 0x1.7a7654p-1, 0x1.24df4ep+0, 0x1.afd25cp+0, -0x1.8cca8ap+0, 0x1.83536p-1, -0x1.d2d478p+0, -0x1.161e38p+0, -0x1.502fbep-1, -0x1.0b4b26p-3, -0x1.c5f968p+0, 0x1.17f7e8p+0, -0x1.c456d6p-2, -0x1.108cd6p+0, 0x1.0fab4cp-8, -0x1.c6e372p-1, 0x1.94bc2cp-1, -0x1.980b0ap-1, -0x1.64c36cp+0, 0x1.1dfadep-3, 0x1.c052ecp+0, -0x1.1c3afap+0, 0x1.88a25cp-1, -0x1.a43acp+0, 0x1.9a1e58p+0, -0x1.48777cp+0, -0x1.ebaaep+0, -0x1.f2c746p+0, 0x1.f4994ap-3, -0x1.0ef6eap+0, 0x1.8ea486p-2, 0x1.eff366p+0, -0x1.ff1de8p+0, 0x1.158cecp+0, 0x1.dbcedap+0, 0x1.1d5418p-1, 0x1.8eaf7ap-1, -0x1.539a3p+0, -0x1.9cd962p-3, -0x1.544918p-7, -0x1.9e6b7p+0, 0x1.08abfp-1, -0x1.e8f83ap+0, -0x1.ebc07ap-2, 0x1.9b4088p-2, 0x1.3c3138p+0, -0x1.0a4334p+1, -0x1.005a58p+1, 0x1.94736ap+0, -0x1.f45dd8p+0, -0x1.08501ep+1, -0x1.8a71a8p+0], [-0x1.914e78p-3, 0x1.f34f8ap+0, 0x1.83c52ap-1, 0x1.3b8362p-3, -0x1.bc74p+0, 0x1.809252p+0, -0x1.24dfbap+0, 0x1.f1e9fap-2, 0x1.880654p+0, -0x1.fa149cp+0, -0x1.b93716p-2, -0x1.a83e7ep-1, 0x1.459032p-3, -0x1.b58adap+0, 0x1.6146b6p-2, 0x1.38dfb4p-3, 0x1.c52f2ep-1, -0x1.15a6b6p-1, -0x1.674566p-5, -0x1.967c6p-3, 0x1.ec79fep-1, 0x1.4d2caap+0, -0x1.43b304p-2, -0x1.83f638p-1, 0x1.0fda96p+1, -0x1.062f5ap+1, -0x1.24aa9ap-3, 0x1.8900f4p-1, 0x1.1aff1p-1, -0x1.de0fd2p-1, 0x1.f29f7ep-4, -0x1.9c7f66p-1, 0x1.852b1p-5, 0x1.e15042p-1, -0x1.a7efe4p-4, -0x1.44f65ap+0, 0x1.20bc7p-6, 0x1.b00f9cp-4, 0x1.72025ep+0, 0x1.8d49cap-4, -0x1.dcbc9ap-2, -0x1.8295a8p-2, -0x1.dbd13ep-1, -0x1.0ba6eap-2, -0x1.0bc6fcp-2, 0x1.01f15ep+0, 0x1.bc0e6ep+0, -0x1.0b6ed4p+1, 0x1.0639ccp+1, -0x1.b67108p+0, 0x1.78026cp+0, -0x1.bad2eep+0, 0x1.8fbe7p-3, -0x1.817028p+0, -0x1.7f4976p+0, -0x1.5bb0fep-1, -0x1.7df3e2p+0, 0x1.33c146p-1, -0x1.726bd4p+0, -0x1.35aa7ep-1, -0x1.85ed0ep+0, -0x1.c80f4p-1, -0x1.0ee78ap+0, 0x1.0bbda8p+0, 0x1.053fp+0, 0x1.e1986p-1, 0x1.2e2fe8p+0, 0x1.5a1638p+0, -0x1.67df0ap-3, 0x1.03dff2p+1, 0x1.098934p+1, -0x1.8cdbd4p-2, 0x1.102918p+1, 0x1.63cedcp+0, 0x1.05c9eap+1, 0x1.caf77p+0, 0x1.17fb04p-2, -0x1.6e6f44p+0, -0x1.aacd4cp+0, 0x1.b57248p-3, -0x1.8ce83cp-1, 0x1.a98106p+0, 0x1.30c03ep-2, -0x1.dcc3b6p-4, 0x1.eb91cp-6, -0x1.08bc66p-8, -0x1.ea2ba4p+0, -0x1.0f7754p-1, 0x1.dff592p-2, -0x1.b380dep+0, 0x1.31e5aep-3, 0x1.cd3d1ep-1, -0x1.30437ep+0, -0x1.8d0cc2p-3, 0x1.1659bep-3, -0x1.ae6052p+0, -0x1.f2e3fep-5, -0x1.c22cb2p+0, 0x1.afbcbep-3, -0x1.0e0cc4p+1, 0x1.1de96ep-1, 0x1.2ec0a4p-1, -0x1.9d7894p-2, -0x1.a85358p-3, 0x1.adb08cp-5, 0x1.c68ddep+0, -0x1.0b9c3ep-1, 0x1.1aa0f8p-5, 0x1.d00afcp-1, -0x1.0e40d8p+1, -0x1.000a8cp+0, -0x1.3ddcb8p-4, 0x1.0f0822p-3, 0x1.b03acap+0, 0x1.d9358cp-2, 0x1.d735a8p+0, -0x1.0b32cap+1, -0x1.1b6ffep+0, -0x1.b35c0cp-1, -0x1.1f8f38p-3, -0x1.f12b7ap+0, 0x1.891a9p-2, -0x1.1659c4p+0, 0x1.a623d4p-1, -0x1.10ea32p+1, 0x1.cf988ap-1, -0x1.586566p-2, 0x1.b65a8ep-1], [-0x1.4f8346p-1, -0x1.0b7006p+1, -0x1.7f79e6p-2, -0x1.0b9c2cp+1, -0x1.18686ap-1, 0x1.4b21b2p+0, 0x1.f1dd6p-1, 0x1.c95bc8p+0, 0x1.7ffabep+0, 0x1.d2c0c8p-1, -0x1.05203p+0, -0x1.cfdcd4p+0, 0x1.e734f2p+0, -0x1.a626dep+0, 0x1.cdfe9p+0, -0x1.fc746ap+0, -0x1.ad2b42p-1, 0x1.7f677cp+0, 0x1.fc0f74p+0, 0x1.6eb8fep-1, 0x1.263db2p+0, -0x1.c6cae2p+0, 0x1.824fc4p-1, 0x1.505e5ap-2, 0x1.ae4e0cp-1, 0x1.46771cp-1, 0x1.aa6da8p+0, 0x1.e0f238p-1, -0x1.003986p+0, 0x1.01cfdap+1, 0x1.44e4cep+0, 0x1.214224p-2, 0x1.eaf1e6p+0, 0x1.ece8a2p-1, -0x1.0f4828p+0, 0x1.b9826cp+0, -0x1.52928ep+0, 0x1.459cbep+0, -0x1.b831aep+0, 0x1.8c495ep-1, -0x1.9b6aaep+0, -0x1.c38b74p+0, 0x1.b1faaep-2, -0x1.1d0c34p+0, 0x1.59206ap+0, 0x1.e0d67ep-1, 0x1.2ab532p+0, -0x1.0f6846p+0, 0x1.368bd8p-1, 0x1.424a2p+0, -0x1.13170ep-1, -0x1.51e894p+0, 0x1.e7b966p+0, 0x1.9dd8ccp-5, 0x1.fc45d2p-2, -0x1.ed4abp+0, -0x1.7ab7f6p-1, 0x1.097d6ap+1, -0x1.6f1b98p-2, 0x1.ece14ap+0, 0x1.75eb22p+0, -0x1.d9ef96p+0, 0x1.080a28p+0, -0x1.80b3cap+0, 0x1.084588p+1, -0x1.50581ep-1, -0x1.8078f4p-1, -0x1.b5c45cp-1, 0x1.77a7p-1, -0x1.b077e2p-3, -0x1.f7dfd4p-1, -0x1.36a35ep+0, 0x1.8f07c6p-2, -0x1.27a69cp+0, 0x1.adcc72p-6, -0x1.647dap-2, 0x1.d4da1p+0, -0x1.3b7b88p+0, -0x1.2a1a94p+0, -0x1.a84248p-1, -0x1.a40296p-1, 0x1.d66336p+0, -0x1.2c8eecp-1, -0x1.2a4e6ep-1, 0x1.0fb9b8p-6, -0x1.115138p-1, 0x1.d5a51cp+0, -0x1.c0e9acp+0, 0x1.942d4cp+0, 0x1.ec604cp+0, -0x1.c355eep-4, 0x1.b23ccep+0, 0x1.a90688p+0, -0x1.111e26p+1, 0x1.0d9338p-1, 0x1.33bc36p-1, 0x1.8bfb9cp-1, 0x1.0cd10ep-1, 0x1.a886bcp-1, 0x1.44f234p+0, 0x1.5ae1e4p-3, -0x1.3b7942p-2, 0x1.a64674p-3, -0x1.44104ap-2, 0x1.5473fep-1, -0x1.04ec8ap+1, -0x1.8684ccp-1, 0x1.b46986p-2, 0x1.201a1cp-3, -0x1.22b17cp+0, -0x1.08bce6p-3, -0x1.5d8c86p-1, -0x1.71f368p+0, 0x1.809bcep+0, 0x1.3fbdcap+0, -0x1.b5ac9ep-8, 0x1.2daa3p+0, -0x1.fea596p-3, -0x1.e28d8ep+0, 0x1.35de5cp+0, -0x1.70580ap-1, -0x1.a02572p-1, 0x1.e01abap-1, -0x1.9d3134p-2, -0x1.02cad8p+0, 0x1.5d6526p+0, -0x1.8be2fap-4, -0x1.9f85c6p+0], [-0x1.88b524p+0, -0x1.a67f78p-2, 0x1.0782fp+0, -0x1.656eb4p-1, -0x1.0e2d2ep+1, -0x1.0c486ep+0, 0x1.45ad5p+0, -0x1.491768p+0, -0x1.361deep+0, 0x1.da97ecp+0, 0x1.acc668p+0, -0x1.06f49p+0, -0x1.3efdd8p-1, -0x1.7cec96p+0, 0x1.cbb642p-6, -0x1.0a8d54p+1, -0x1.1cc7e8p-3, -0x1.ea8c0cp+0, 0x1.bd8cdep-4, -0x1.3b4432p-1, 0x1.c74e98p+0, 0x1.da0bfap-3, -0x1.f81b36p+0, -0x1.d778aep+0, 0x1.1bd34ep+0, -0x1.9e1296p-1, 0x1.65ae2cp-7, 0x1.71a5a8p-2, 0x1.5973e6p-1, 0x1.fdfcccp+0, 0x1.5ecfbep+0, -0x1.b6c8bp+0, -0x1.5674b4p-2, -0x1.238e2ap+0, -0x1.83fa5ap-2, 0x1.6149cap-1, -0x1.032f22p+1, 0x1.a34424p-2, -0x1.eae1p-1, 0x1.29923ep+0, -0x1.82af66p-2, -0x1.1064bap+0, 0x1.b38174p+0, 0x1.5218aep+0, -0x1.da0aap-2, -0x1.e1f06p-1, 0x1.04b564p+0, 0x1.6fde7cp+0, 0x1.7bddc8p+0, 0x1.6abdaap+0, -0x1.0cbdf4p+0, 0x1.704b18p+0, 0x1.5bda52p-4, 0x1.05c234p+0, -0x1.c7d7dp-2, 0x1.564d6ep-3, 0x1.0c8ff8p+0, -0x1.3b5afcp+0, 0x1.272d0cp-3, -0x1.f92ffap-2, 0x1.6a13bep+0, 0x1.7a0bd2p+0, 0x1.64c16ap-3, -0x1.edd904p+0, 0x1.319f86p+0, -0x1.46b742p-1, 0x1.f4057cp+0, -0x1.110a94p+1, 0x1.6819fcp+0, 0x1.8a9094p-1, 0x1.124cdap+1, 0x1.da5998p-2, 0x1.f38964p+0, 0x1.8489f2p-1, 0x1.fd7c8ep+0, -0x1.c3f622p-1, -0x1.532ee8p+0, 0x1.c1a54ap+0, 0x1.d6baa6p-2, 0x1.c48cfap-1, -0x1.b73bb8p+0, 0x1.9821f4p-3, -0x1.62af3p+0, 0x1.4a88dp+0, -0x1.43902ap-1, 0x1.db8f3ep-1, 0x1.849b08p+0, 0x1.8221fp+0, -0x1.c0501ap-2, -0x1.b3afb4p-1, 0x1.aaf3e2p-3, -0x1.a3336cp-2, -0x1.8654b2p+0, 0x1.b31794p+0, -0x1.0e728ep+0, -0x1.a5cf2ap-2, -0x1.66f6dep+0, -0x1.7e28c6p+0, -0x1.c223fp+0, -0x1.0b4452p-1, 0x1.a5255ap+0, 0x1.85af68p+0, -0x1.31acaap+0, -0x1.cff5f4p+0, 0x1.f681c8p-14, 0x1.da7c9ep-3, -0x1.689054p+0, -0x1.6b9d94p-1, 0x1.b28cbcp+0, 0x1.53b814p-1, -0x1.181b38p+0, -0x1.3030c8p+0, 0x1.870004p+0, 0x1.4927e4p+0, -0x1.02a768p+1, 0x1.2620fep+0, -0x1.f4e73p+0, -0x1.9f1d54p+0, -0x1.bc928cp+0, 0x1.880e3p-4, 0x1.ce818ap-1, 0x1.b23cc8p-1, 0x1.ee16bcp-2, 0x1.20dfb6p+0, -0x1.1f95c4p-1, 0x1.35dacap+0, -0x1.225766p+0, 0x1.fdd026p-1], [0x1.a7a412p+0, -0x1.39ea52p-3, 0x1.d1e0a6p+0, -0x1.52f8bep+0, -0x1.7a7ccep-2, 0x1.3c364ep+0, 0x1.7623c2p+0, -0x1.ffed54p+0, 0x1.c75912p-1, 0x1.f331ap-3, 0x1.5122b8p+0, 0x1.36fcdap+0, -0x1.5b4b14p-1, 0x1.634d7p-1, -0x1.88f09ep-1, 0x1.893a14p+0, 0x1.67a4acp+0, -0x1.06ef3p+1, 0x1.7f7f2p+0, 0x1.04a77ep+1, 0x1.15483p-1, -0x1.72a0a6p+0, 0x1.e5a438p-4, 0x1.c739e2p+0, 0x1.370b3cp+0, -0x1.533532p-1, -0x1.b189d2p-1, -0x1.01ba44p+1, 0x1.574836p+0, -0x1.ba2b92p+0, -0x1.ca62aep+0, 0x1.892c94p+0, -0x1.0cc4cap+1, 0x1.91017p+0, -0x1.9bcfdp-1, -0x1.53d596p+0, 0x1.2a3ee2p-3, -0x1.74026ap+0, 0x1.c75772p-2, -0x1.5aa12ep+0, -0x1.6bcf4cp+0, -0x1.24e4c6p+0, -0x1.4115aap-1, 