program(1.3)
[buildInfo = dict<string, string>({{"coremlc-component-MIL", "3510.2.1"}, {"coremlc-version", "3500.32.1"}})]
{
    func main<ios19>(tensor<fp32, [1, 64]> x) {
            tensor<fp32, [64, 64]> wa_0 = const()[name = string("wa_0"), val = tensor<fp32, [64, 64]>([[0x1p+0, 0x1p+1, 0x1.8p+1, 0x1p+2, 0x1.4p+2, 0x1.8p+2, 0x1.cp+2, 0x1p+3, 0x1.2p+3, 0x1.4p+3, 0x1.6p+3, 0x1.8p+3, 0x1.ap+3, 0x1.cp+3, 0x1.ep+3, 0x1p+4, 0x1.1p+4, 0x1.2p+4, 0x1.3p+4, 0x1.4p+4, 0x1.5p+4, 0x1.6p+4, 0x1.7p+4, 0x1.8p+4, 0x1.9p+4, 0x1.ap+4, 0x1.bp+4, 0x1.cp+4, 0x1.dp+4, 0x1.ep+4, 0x1.fp+4, 0x1p+5, 0x1.08p+5, 0x1.1p+5, 0x1.18p+5, 0x1.2p+5, 0x1.28p+5, 0x1.3p+5, 0x1.38p+5, 0x1.4p+5, 0x1.48p+5, 0x1.5p+5, 0x1.58p+5, 0x1.6p+5, 0x1.68p+5, 0x1.7p+5, 0x1.78p+5, 0x1.8p+5, 0x1.88p+5, 0x1.9p+5, 0x1.98p+5, 0x1.ap+5, 0x1.a8p+5, 0x1.bp+5, 0x1.b8p+5, 0x1.cp+5, 0x1.c8p+5, 0x1.dp+5, 0x1.d8p+5, 0x1.ep+5, 0x1.e8p+5, 0x1.fp+5, 0x1.f8p+5, 0x1p+6], [0x1.04p+6, 0x1.08p+6, 0x1.0cp+6, 0x1.1p+6, 0x1.14p+6, 0x1.18p+6, 0x1.1cp+6, 0x1.2p+6, 0x1.24p+6, 0x1.28p+6, 0x1.2cp+6, 0x1.3p+6, 0x1.34p+6, 0x1.38p+6, 0x1.3cp+6, 0x1.4p+6, 0x1.44p+6, 0x1.48p+6, 0x1.4cp+6, 0x1.5p+6, 0x1.54p+6, 0x1.58p+6, 0x1.5cp+6, 0x1.6p+6, 0x1.64p+6, 0x1.68p+6, 0x1.6cp+6, 0x1.7p+6, 0x1.74p+6, 0x1.78p+6, 0x1.7cp+6, 0x1.8p+6, 0x1.84p+6, 0x1.88p+6, 0x1.8cp+6, 0x1.9p+6, 0x1.94p+6, 0x1.98p+6, 0x1.9cp+6, 0x1.ap+6, 0x1.a4p+6, 0x1.a8p+6, 0x1.acp+6, 0x1.bp+6, 0x1.b4p+6, 0x1.b8p+6, 0x1.bcp+6, 0x1.cp+6, 0x1.c4p+6, 0x1.c8p+6, 0x1.ccp+6, 0x1.dp+6, 0x1.d4p+6, 0x1.d8p+6, 0x1.dcp+6, 0x1.ep+6, 0x1.e4p+6, 0x1.e8p+6, 0x1.ecp+6, 0x1.fp+6, 0x1.f4p+6, 0x1.f8p+6, 0x1.fcp+6, 0x1p+7], [0x1.02p+7, 0x1.04p+7, 0x1.06p+7, 0x1.08p+7, 0x1.0ap+7, 0x1.0cp+7, 0x1.0ep+7, 0x1.1p+7, 0x1.12p+7, 0x1.14p+7, 0x1.16p+7, 0x1.18p+7, 0x1.1ap+7, 0x1.1cp+7, 0x1.1ep+7, 0x1.2p+7, 0x1.22p+7, 0x1.24p+7, 0x1.26p+7, 0x1.28p+7, 0x1.2ap+7, 0x1.2cp+7, 0x1.2ep+7, 0x1.3p+7, 0x1.32p+7, 0x1.34p+7, 0x1.36p+7, 0x1.38p+7, 0x1.3ap+7, 0x1.3cp+7, 0x1.3ep+7, 0x1.4p+7, 0x1.42p+7, 0x1.44p+7, 0x1.46p+7, 0x1.48p+7, 0x1.4ap+7, 0x1.4cp+7, 0x1.4ep+7, 0x1.5p+7, 0x1.52p+7, 0x1.54p+7, 0x1.56p+7, 0x1.58p+7, 0x1.5ap+7, 0x1.5cp+7, 0x1.5ep+7, 0x1.6p+7, 0x1.62p+7, 0x1.64p+7, 0x1.66p+7, 0x1.68p+7, 0x1.6ap+7, 0x1.6cp+7, 0x1.6ep+7, 0x1.7p+7, 0x1.72p+7, 0x1.74p+7, 0x1.76p+7, 0x1.78p+7, 0x1.7ap+7, 0x1.7cp+7, 0x1.7ep+7, 0x1.8p+7], [0x1.82p+7, 0x1.84p+7, 0x1.86p+7, 0x1.88p+7, 0x1.8ap+7, 0x1.8cp+7, 0x1.8ep+7, 0x1.9p+7, 0x1.92p+7, 0x1.94p+7, 0x1.96p+7, 0x1.98p+7, 0x1.9ap+7, 0x1.9cp+7, 0x1.9ep+7, 0x1.ap+7, 0x1.a2p+7, 0x1.a4p+7, 0x1.a6p+7, 0x1.a8p+7, 0x1.aap+7, 0x1.acp+7, 0x1.aep+7, 0x1.bp+7, 0x1.b2p+7, 0x1.b4p+7, 0x1.b6p+7, 0x1.b8p+7, 0x1.bap+7, 0x1.bcp+7, 0x1.bep+7, 0x1.cp+7, 0x1.c2p+7, 0x1.c4p+7, 0x1.c6p+7, 0x1.c8p+7, 0x1.cap+7, 0x1.ccp+7, 0x1.cep+7, 0x1.dp+7, 0x1.d2p+7, 0x1.d4p+7, 0x1.d6p+7, 0x1.d8p+7, 0x1.dap+7, 0x1.dcp+7, 0x1.dep+7, 0x1.ep+7, 0x1.e2p+7, 0x1.e4p+7, 0x1.e6p+7, 0x1.e8p+7, 0x1.eap+7, 0x1.ecp+7, 0x1.eep+7, 0x1.fp+7, 0x1.f2p+7, 0x1.f4p+7, 0x1.f6p+7, 0x1.f8p+7, 0x1.fap+7, 0x1.fcp+7, 0x1.fep+7, 0x1p+8], [0x1.01p+8, 0x1.02p+8, 0x1.03p+8, 0x1.04p+8, 0x1.05p+8, 0x1.06p+8, 0x1.07p+8, 0x1.08p+8, 0x1.09p+8, 0x1.0ap+8, 0x1.0bp+8, 0x1.0cp+8, 0x1.0dp+8, 0x1.0ep+8, 0x1.0fp+8, 0x1.1p+8, 0x1.11p+8, 0x1.12p+8, 0x1.13p+8, 0x1.14p+8, 0x1.15p+8, 0x1.16p+8, 0x1.17p+8, 0x1.18p+8, 0x1.19p+8, 0x1.1ap+8, 0x1.1bp+8, 0x1.1cp+8, 0x1.1dp+8, 0x1.1ep+8, 0x1.1fp+8, 0x1.2p+8, 0x1.21p+8, 0x1.22p+8, 0x1.23p+8, 0x1.24p+8, 0x1.25p+8, 0x1.26p+8, 0x1.27p+8, 0x1.28p+8, 0x1.29p+8, 0x1.2ap+8, 0x1.2bp+8, 0x1.2cp+8, 0x1.2dp+8, 0x1.2ep+8, 0x1.2fp+8, 0x1.3p+8, 0x1.31p+8, 0x1.32p+8, 0x1.33p+8, 0x1.34p+8, 0x1.35p+8, 0x1.36p+8, 0x1.37p+8, 0x1.38p+8, 0x1.39p+8, 0x1.3ap+8, 0x1.3bp+8, 0x1.3cp+8, 0x1.3dp+8, 0x1.3ep+8, 0x1.3fp+8, 0x1.4p+8], [0x1.41p+8, 0x1.42p+8, 0x1.43p+8, 0x1.44p+8, 0x1.45p+8, 0x1.46p+8, 0x1.47p+8, 0x1.48p+8, 0x1.49p+8, 0x1.4ap+8, 0x1.4bp+8, 0x1.4cp+8, 0x1.4dp+8, 0x1.4ep+8, 0x1.4fp+8, 0x1.5p+8, 0x1.51p+8, 0x1.52p+8, 0x1.53p+8, 0x1.54p+8, 0x1.55p+8, 0x1.56p+8, 0x1.57p+8, 0x1.58p+8, 0x1.59p+8, 0x1.5ap+8, 0x1.5bp+8, 0x1.5cp+8, 0x1.5dp+8, 0x1.5ep+8, 0x1.5fp+8, 0x1.6p+8, 0x1.61p+8, 0x1.62p+8, 0x1.63p+8, 0x1.64p+8, 0x1.65p+8, 0x1.66p+8, 0x1.67p+8, 0x1.68p+8, 0x1.69p+8, 0x1.6ap+8, 0x1.6bp+8, 0x1.6cp+8, 0x1.6dp+8, 0x1.6ep+8, 0x1.6fp+8, 0x1.7p+8, 0x1.71p+8, 0x1.72p+8, 0x1.73p+8, 0x1.74p+8, 0x1.75p+8, 0x1.76p+8, 0x1.77p+8, 0x1.78p+8, 0x1.79p+8, 0x1.7ap+8, 0x1.7bp+8, 0x1.7cp+8, 0x1.7dp+8, 0x1.7ep+8, 0x1.7fp+8, 0x1.8p+8], [0x1.81p+8, 0x1.82p+8, 0x1.83p+8, 0x1.84p+8, 0x1.85p+8, 0x1.86p+8, 0x1.87p+8, 0x1.88p+8, 0x1.89p+8, 0x1.8ap+8, 0x1.8bp+8, 0x1.8cp+8, 0x1.8dp+8, 0x1.8ep+8, 0x1.8fp+8, 0x1.9p+8, 0x1.91p+8, 0x1.92p+8, 0x1.93p+8, 0x1.94p+8, 0x1.95p+8, 0x1.96p+8, 0x1.97p+8, 0x1.98p+8, 0x1.99p+8, 0x1.9ap+8, 0x1.9bp+8, 0x1.9cp+8, 0x1.9dp+8, 0x1.9ep+8, 0x1.9fp+8, 0x1.ap+8, 0x1.a1p+8, 0x1.a2p+8, 0x1.a3p+8, 0x1.a4p+8, 0x1.a5p+8, 0x1.a6p+8, 0x1.a7p+8, 0x1.a8p+8, 0x1.a9p+8, 0x1.aap+8, 0x1.abp+8, 0x1.acp+8, 0x1.adp+8, 0x1.aep+8, 0x1.afp+8, 0x1.bp+8, 0x1.b1p+8, 0x1.b2p+8, 0x1.b3p+8, 0x1.b4p+8, 0x1.b5p+8, 0x1.b6p+8, 0x1.b7p+8, 0x1.b8p+8, 0x1.b9p+8, 0x1.bap+8, 0x1.bbp+8, 0x1.bcp+8, 0x1.bdp+8, 0x1.bep+8, 0x1.bfp+8, 0x1.cp+8], [0x1.c1p+8, 0x1.c2p+8, 0x1.c3p+8, 0x1.c4p+8, 0x1.c5p+8, 0x1.c6p+8, 0x1.c7p+8, 0x1.c8p+8, 0x1.c9p+8, 0x1.cap+8, 0x1.cbp+8, 0x1.ccp+8, 0x1.cdp+8, 0x1.cep+8, 0x1.cfp+8, 0x1.dp+8, 0x1.d1p+8, 0x1.d2p+8, 0x1.d3p+8, 0x1.d4p+8, 0x1.d5p+8, 0x1.d6p+8, 0x1.d7p+8, 0x1.d8p+8, 0x1.d9p+8, 0x1.dap+8, 0x1.dbp+8, 0x1.dcp+8, 0x1.ddp+8, 0x1.dep+8, 0x1.dfp+8, 0x1.ep+8, 0x1.e1p+8, 0x1.e2p+8, 0x1.e3p+8, 0x1.e4p+8, 0x1.e5p+8, 0x1.e6p+8, 0x1.e7p+8, 0x1.e8p+8, 0x1.e9p+8, 0x1.eap+8, 0x1.ebp+8, 0x1.ecp+8, 0x1.edp+8, 0x1.eep+8, 0x1.efp+8, 0x1.fp+8, 0x1.f1p+8, 0x1.f2p+8, 0x1.f3p+8, 0x1.f4p+8, 0x1.f5p+8, 0x1.f6p+8, 0x1.f7p+8, 0x1.f8p+8, 0x1.f9p+8, 0x1.fap+8, 0x1.fbp+8, 0x1.fcp+8, 0x1.fdp+8, 0x1.fep+8, 0x1.ffp+8, 0x1p+9], [0x1.008p+9, 0x1.01p+9, 0x1.018p+9, 0x1.02p+9, 0x1.028p+9, 0x1.03p+9, 0x1.038p+9, 0x1.04p+9, 0x1.048p+9, 0x1.05p+9, 0x1.058p+9, 0x1.06p+9, 0x1.068p+9, 0x1.07p+9, 0x1.078p+9, 0x1.08p+9, 0x1.088p+9, 0x1.09p+9, 0x1.098p+9, 0x1.0ap+9, 0x1.0a8p+9, 0x1.0bp+9, 0x1.0b8p+9, 0x1.0cp+9, 0x1.0c8p+9, 0x1.0dp+9, 0x1.0d8p+9, 0x1.0ep+9, 0x1.0e8p+9, 0x1.0fp+9, 0x1.0f8p+9, 0x1.1p+9, 0x1.108p+9, 0x1.11p+9, 0x1.118p+9, 0x1.12p+9, 0x1.128p+9, 0x1.13p+9, 0x1.138p+9, 0x1.14p+9, 0x1.148p+9, 0x1.15p+9, 0x1.158p+9, 0x1.16p+9, 0x1.168p+9, 0x1.17p+9, 0x1.178p+9, 0x1.18p+9, 0x1.188p+9, 0x1.19p+9, 0x1.198p+9, 0x1.1ap+9, 0x1.1a8p+9, 0x1.1bp+9, 0x1.1b8p+9, 0x1.1cp+9, 0x1.1c8p+9, 0x1.1dp+9, 0x1.1d8p+9, 0x1.1ep+9, 0x1.1e8p+9, 0x1.1fp+9, 0x1.1f8p+9, 0x1.2p+9], [0x1.208p+9, 0x1.21p+9, 0x1.218p+9, 0x1.22p+9, 0x1.228p+9, 0x1.23p+9, 0x1.238p+9, 0x1.24p+9, 0x1.248p+9, 0x1.25p+9, 0x1.258p+9, 0x1.26p+9, 0x1.268p+9, 0x1.27p+9, 0x1.278p+9, 0x1.28p+9, 0x1.288p+9, 0x1.29p+9, 0x1.298p+9, 0x1.2ap+9, 0x1.2a8p+9, 0x1.2bp+9, 0x1.2b8p+9, 0x1.2cp+9, 0x1.2c8p+9, 0x1.2dp+9, 0x1.2d8p+9, 0x1.2ep+9, 0x1.2e8p+9, 0x1.2fp+9, 0x1.2f8p+9, 0x1.3p+9, 0x1.308p+9, 0x1.31p+9, 0x1.318p+9, 0x1.32p+9, 0x1.328p+9, 0x1.33p+9, 0x1.338p+9, 0x1.34p+9, 0x1.348p+9, 0x1.35p+9, 0x1.358p+9, 0x1.36p+9, 0x1.368p+9, 0x1.37p+9, 0x1.378p+9, 0x1.38p+9, 0x1.388p+9, 0x1.39p+9, 0x1.398p+9, 0x1.3ap+9, 0x1.3a8p+9, 0x1.3bp+9, 0x1.3b8p+9, 0x1.3cp+9, 0x1.3c8p+9, 0x1.3dp+9, 0x1.3d8p+9, 0x1.3ep+9, 0x1.3e8p+9, 0x1.3fp+9, 0x1.3f8p+9, 0x1.4p+9], [0x1.408p+9, 0x1.41p+9, 0x1.418p+9, 0x1.42p+9, 0x1.428p+9, 0x1.43p+9, 0x1.438p+9, 0x1.44p+9, 0x1.448p+9, 0x1.45p+9, 0x1.458p+9, 0x1.46p+9, 0x1.468p+9, 0x1.47p+9, 0x1.478p+9, 0x1.48p+9, 0x1.488p+9, 0x1.49p+9, 0x1.498p+9, 0x1.4ap+9, 0x1.4a8p+9, 0x1.4bp+9, 0x1.4b8p+9, 0x1.4cp+9, 0x1.4c8p+9, 0x1.4dp+9, 0x1.4d8p+9, 0x1.4ep+9, 0x1.4e8p+9, 0x1.4fp+9, 0x1.4f8p+9, 0x1.5p+9, 0x1.508p+9, 0x1.51p+9, 0x1.518p+9, 0x1.52p+9, 0x1.528p+9, 0x1.53p+9, 0x1.538p+9, 0x1.54p+9, 0x1.548p+9, 0x1.55p+9, 0x1.558p+9, 0x1.56p+9, 0x1.568p+9, 0x1.57p+9, 0x1.578p+9, 0x1.58p+9, 0x1.588p+9, 0x1.59p+9, 0x1.598p+9, 0x1.5ap+9, 0x1.5a8p+9, 0x1.5bp+9, 0x1.5b8p+9, 0x1.5cp+9, 0x1.5c8p+9, 0x1.5dp+9, 0x1.5d8p+9, 0x1.5ep+9, 0x1.5e8p+9, 0x1.5fp+9, 0x1.5f8p+9, 0x1.6p+9], [0x1.608p+9, 0x1.61p+9, 0x1.618p+9, 0x1.62p+9, 0x1.628p+9, 0x1.63p+9, 0x1.638p+9, 0x1.64p+9, 0x1.648p+9, 0x1.65p+9, 0x1.658p+9, 0x1.66p+9, 0x1.668p+9, 0x1.67p+9, 0x1.678p+9, 0x1.68p+9, 0x1.688p+9, 0x1.69p+9, 0x1.698p+9, 0x1.6ap+9, 0x1.6a8p+9, 0x1.6bp+9, 0x1.6b8p+9, 0x1.6cp+9, 0x1.6c8p+9, 0x1.6dp+9, 0x1.6d8p+9, 0x1.6ep+9, 0x1.6e8p+9, 0x1.6fp+9, 0x1.6f8p+9, 0x1.7p+9, 0x1.708p+9, 0x1.71p+9, 0x1.718p+9, 0x1.72p+9, 0x1.728p+9, 0x1.73p+9, 0x1.738p+9, 0x1.74p+9, 0x1.748p+9, 0x1.75p+9, 0x1.758p+9, 0x1.76p+9, 0x1.768p+9, 0x1.77p+9, 0x1.778p+9, 0x1.78p+9, 0x1.788p+9, 0x1.79p+9, 0x1.798p+9, 0x1.7ap+9, 0x1.7a8p+9, 0x1.7bp+9, 0x1.7b8p+9, 0x1.7cp+9, 0x1.7c8p+9, 0x1.7dp+9, 0x1.7d8p+9, 0x1.7ep+9, 0x1.7e8p+9, 0x1.7fp+9, 0x1.7f8p+9, 0x1.8p+9], [0x1.808p+9, 0x1.81p+9, 0x1.818p+9, 0x1.82p+9, 0x1.828p+9, 0x1.83p+9, 0x1.838p+9, 0x1.84p+9, 0x1.848p+9, 0x1.85p+9, 0x1.858p+9, 0x1.86p+9, 0x1.868p+9, 0x1.87p+9, 0x1.878p+9, 0x1.88p+9, 0x1.888p+9, 0x1.89p+9, 0x1.898p+9, 0x1.8ap+9, 0x1.8a8p+9, 0x1.8bp+9, 0x1.8b8p+9, 0x1.8cp+9, 0x1.8c8p+9, 0x1.8dp+9, 0x1.8d8p+9, 0x1.8ep+9, 0x1.8e8p+9, 0x1.8fp+9, 0x1.8f8p+9, 0x1.9p+9, 0x1.908p+9, 0x1.91p+9, 0x1.918p+9, 0x1.92p+9, 0x1.928p+9, 0x1.93p+9, 0x1.938p+9, 0x1.94p+9, 0x1.948p+9, 0x1.95p+9, 0x1.958p+9, 0x1.96p+9, 0x1.968p+9, 0x1.97p+9, 0x1.978p+9, 0x1.98p+9, 0x1.988p+9, 0x1.99p+9, 0x1.998p+9, 0x1.9ap+9, 0x1.9a8p+9, 0x1.9bp+9, 0x1.9b8p+9, 0x1.9cp+9, 0x1.9c8p+9, 0x1.9dp+9, 0x1.9d8p+9, 0x1.9ep+9, 0x1.9e8p+9, 0x1.9fp+9, 0x1.9f8p+9, 0x1.ap+9], [0x1.a08p+9, 0x1.a1p+9, 0x1.a18p+9, 0x1.a2p+9, 0x1.a28p+9, 0x1.a3p+9, 0x1.a38p+9, 0x1.a4p+9, 0x1.a48p+9, 0x1.a5p+9, 0x1.a58p+9, 0x1.a6p+9, 0x1.a68p+9, 0x1.a7p+9, 0x1.a78p+9, 0x1.a8p+9, 0x1.a88p+9, 0x1.a9p+9, 0x1.a98p+9, 0x1.aap+9, 0x1.aa8p+9, 0x1.abp+9, 0x1.ab8p+9, 0x1.acp+9, 0x1.ac8p+9, 0x1.adp+9, 0x1.ad8p+9, 0x1.aep+9, 0x1.ae8p+9, 0x1.afp+9, 0x1.af8p+9, 0x1.bp+9, 0x1.b08p+9, 0x1.b1p+9, 0x1.b18p+9, 0x1.b2p+9, 0x1.b28p+9, 0x1.b3p+9, 0x1.b38p+9, 0x1.b4p+9, 0x1.b48p+9, 0x1.b5p+9, 0x1.b58p+9, 0x1.b6p+9, 0x1.b68p+9, 0x1.b7p+9, 0x1.b78p+9, 0x1.b8p+9, 0x1.b88p+9, 0x1.b9p+9, 0x1.b98p+9, 0x1.bap+9, 0x1.ba8p+9, 0x1.bbp+9, 0x1.bb8p+9, 0x1.bcp+9, 0x1.bc8p+9, 0x1.bdp+9, 0x1.bd8p+9, 0x1.bep+9, 0x1.be8p+9, 0x1.bfp+9, 0x1.bf8p+9, 0x1.cp+9], [0x1.c08p+9, 0x1.c1p+9, 0x1.c18p+9, 0x1.c2p+9, 0x1.c28p+9, 0x1.c3p+9, 0x1.c38p+9, 0x1.c4p+9, 0x1.c48p+9, 0x1.c5p+9, 0x1.c58p+9, 0x1.c6p+9, 0x1.c68p+9, 0x1.c7p+9, 0x1.c78p+9, 0x1.c8p+9, 0x1.c88p+9, 0x1.c9p+9, 0x1.c98p+9, 0x1.cap+9, 0x1.ca8p+9, 0x1.cbp+9, 0x1.cb8p+9, 0x1.ccp+9, 0x1.cc8p+9, 0x1.cdp+9, 0x1.cd8p+9, 0x1.cep+9, 0x1.ce8p+9, 0x1.cfp+9, 0x1.cf8p+9, 0x1.dp+9, 0x1.d08p+9, 0x1.d1p+9, 0x1.d18p+9, 0x1.d2p+9, 0x1.d28p+9, 0x1.d3p+9, 0x1.d38p+9, 0x1.d4p+9, 0x1.d48p+9, 0x1.d5p+9, 0x1.d58p+9, 0x1.d6p+9, 0x1.d68p+9, 0x1.d7p+9, 0x1.d78p+9, 0x1.d8p+9, 0x1.d88p+9, 0x1.d9p+9, 0x1.d98p+9, 0x1.dap+9, 0x1.da8p+9, 0x1.dbp+9, 0x1.db8p+9, 0x1.dcp+9, 0x1.dc8p+9, 0x1.ddp+9, 0x1.dd8p+9, 0x1.dep+9, 0x1.de8p+9, 0x1.dfp+9, 0x1.df8p+9, 0x1.ep+9], [0x1.e08p+9, 0x1.e1p+9, 0x1.e18p+9, 0x1.e2p+9, 0x1.e28p+9, 0x1.e3p+9, 0x1.e38p+9, 0x1.e4p+9, 0x1.e48p+9, 0x1.e5p+9, 0x1.e58p+9, 0x1.e6p+9, 0x1.e68p+9, 0x1.e7p+9, 0x1.e78p+9, 0x1.e8p+9, 0x1.e88p+9, 0x1.e9p+9, 0x1.e98p+9, 0x1.eap+9, 0x1.ea8p+9, 0x1.ebp+9, 0x1.eb8p+9, 0x1.ecp+9, 0x1.ec8p+9, 0x1.edp+9, 0x1.ed8p+9, 0x1.eep+9, 0x1.ee8p+9, 0x1.efp+9, 0x1.ef8p+9, 0x1.fp+9, 0x1.f08p+9, 0x1.f1p+9, 0x1.f18p+9, 0x1.f2p+9, 0x1.f28p+9, 0x1.f3p+9, 0x1.f38p+9, 0x1.f4p+9, 0x1.f48p+9, 0x1.f5p+9, 0x1.f58p+9, 0x1.f6p+9, 0x1.f68p+9, 0x1.f7p+9, 0x1.f78p+9, 0x1.f8p+9, 0x1.f88p+9, 0x1.f9p+9, 0x1.f98p+9, 0x1.fap+9, 0x1.fa8p+9, 0x1.fbp+9, 0x1.fb8p+9, 0x1.fcp+9, 0x1.fc8p+9, 0x1.fdp+9, 0x1.fd8p+9, 0x1.fep+9, 0x1.fe8p+9, 0x1.ffp+9, 0x1.ff8p+9, 0x1p+10], [0x1.004p+10, 0x1.008p+10, 0x1.00cp+10, 0x1.01p+10, 0x1.014p+10, 0x1.018p+10, 0x1.01cp+10, 0x1.02p+10, 0x1.024p+10, 0x1.028p+10, 0x1.02cp+10, 0x1.03p+10, 0x1.034p+10, 0x1.038p+10, 0x1.03cp+10, 0x1.04p+10, 0x1.044p+10, 0x1.048p+10, 0x1.04cp+10, 0x1.05p+10, 0x1.054p+10, 0x1.058p+10, 0x1.05cp+10, 0x1.06p+10, 0x1.064p+10, 0x1.068p+10, 0x1.06cp+10, 0x1.07p+10, 0x1.074p+10, 0x1.078p+10, 0x1.07cp+10, 0x1.08p+10, 0x1.084p+10, 0x1.088p+10, 0x1.08cp+10, 0x1.09p+10, 0x1.094p+10, 0x1.098p+10, 0x1.09cp+10, 0x1.0ap+10, 0x1.0a4p+10, 0x1.0a8p+10, 0x1.0acp+10, 0x1.0bp+10, 0x1.0b4p+10, 0x1.0b8p+10, 0x1.0bcp+10, 0x1.0cp+10, 0x1.0c4p+10, 0x1.0c8p+10, 0x1.0ccp+10, 0x1.0dp+10, 0x1.0d4p+10, 0x1.0d8p+10, 0x1.0dcp+10, 0x1.0ep+10, 0x1.0e4p+10, 0x1.0e8p+10, 0x1.0ecp+10, 0x1.0fp+10, 0x1.0f4p+10, 0x1.0f8p+10, 0x1.0fcp+10, 0x1.1p+10], [0x1.104p+10, 0x1.108p+10, 0x1.10cp+10, 0x1.11p+10, 0x1.114p+10, 0x1.118p+10, 0x1.11cp+10, 0x1.12p+10, 0x1.124p+10, 0x1.128p+10, 0x1.12cp+10, 0x1.13p+10, 0x1.134p+10, 0x1.138p+10, 0x1.13cp+10, 0x1.14p+10, 0x1.144p+10, 0x1.148p+10, 0x1.14cp+10, 0x1.15p+10, 0x1.154p+10, 0x1.158p+10, 0x1.15cp+10, 0x1.16p+10, 0x1.164p+10, 0x1.168p+10, 0x1.16cp+10, 0x1.17p+10, 0x1.174p+10, 0x1.178p+10, 0x1.17cp+10, 0x1.18p+10, 0x1.184p+10, 0x1.188p+10, 0x1.18cp+10, 0x1.19p+10, 0x1.194p+10, 0x1.198p+10, 0x1.19cp+10, 0x1.1ap+10, 0x1.1a4p+10, 0x1.1a8p+10, 0x1.1acp+10, 0x1.1bp+10, 0x1.1b4p+10, 0x1.1b8p+10, 0x1.1bcp+10, 0x1.1cp+10, 0x1.1c4p+10, 0x1.1c8p+10, 0x1.1ccp+10, 0x1.1dp+10, 0x1.1d4p+10, 0x1.1d8p+10, 0x1.1dcp+10, 0x1.1ep+10, 0x1.1e4p+10, 0x1.1e8p+10, 0x1.1ecp+10, 0x1.1fp+10, 0x1.1f4p+10, 0x1.1f8p+10, 0x1.1fcp+10, 0x1.2p+10], [0x1.204p+10, 0x1.208p+10, 0x1.20cp+10, 0x1.21p+10, 0x1.214p+10, 0x1.218p+10, 0x1.21cp+10, 0x1.22p+10, 0x1.224p+10, 0x1.228p+10, 0x1.22cp+10, 0x1.23p+10, 0x1.234p+10, 0x1.238p+10, 0x1.23cp+10, 0x1.24p+10, 0x1.244p+10, 0x1.248p+10, 0x1.24cp+10, 0x1.25p+10, 0x1.254p+10, 0x1.258p+10, 0x1.25cp+10, 0x1.26p+10, 0x1.264p+10, 0x1.268p+10, 0x1.26cp+10, 0x1.27p+10, 0x1.274p+10, 0x1.278p+10, 0x1.27cp+10, 0x1.28p+10, 0x1.284p+10, 0x1.288p+10, 0x1.28cp+10, 0x1.29p+10, 0x1.294p+10, 0x1.298p+10, 0x1.29cp+10, 0x1.2ap+10, 0x1.2a4p+10, 0x1.2a8p+10, 0x1.2acp+10, 0x1.2bp+10, 0x1.2b4p+10, 0x1.2b8p+10, 0x1.2bcp+10, 0x1.2cp+10, 0x1.2c4p+10, 0x1.2c8p+10, 0x1.2ccp+10, 0x1.2dp+10, 0x1.2d4p+10, 0x1.2d8p+10, 0x1.2dcp+10, 0x1.2ep+10, 0x1.2e4p+10, 0x1.2e8p+10, 0x1.2ecp+10, 0x1.2fp+10, 0x1.2f4p+10, 0x1.2f8p+10, 0x1.2fcp+10, 0x1.3p+10], [0x1.304p+10, 0x1.308p+10, 0x1.30cp+10, 0x1.31p+10, 0x1.314p+10, 0x1.318p+10, 0x1.31cp+10, 0x1.32p+10, 0x1.324p+10, 0x1.328p+10, 0x1.32cp+10, 0x1.33p+10, 0x1.334p+10, 0x1.338p+10, 0x1.33cp+10, 0x1.34p+10, 0x1.344p+10, 0x1.348p+10, 0x1.34cp+10, 0x1.35p+10, 0x1.354p+10, 0x1.358p+10, 0x1.35cp+10, 0x1.36p+10, 0x1.364p+10, 0x1.368p+10, 0x1.36cp+10, 0x1.37p+10, 0x1.374p+10, 0x1.378p+10, 0x1.37cp+10, 0x1.38p+10, 0x1.384p+10, 0x1.388p+10, 0x1.38cp+10, 0x1.39p+10, 0x1.394p+10, 0x1.398p+10, 0x1.39cp+10, 0x1.3ap+10, 0x1.3a4p+10, 0x1.3a8p+10, 0x1.3acp+10, 0x1.3bp+10, 0x1.3b4p+10, 0x1.3b8p+10, 0x1.3bcp+10, 0x1.3cp+10, 0x1.3c4p+10, 0x1.3c8p+10, 0x1.3ccp+10, 0x1.3dp+10, 0x1.3d4p+10, 0x1.3d8p+10, 0x1.3dcp+10, 0x1.3ep+10, 0x1.3e4p+10, 0x1.3e8p+10, 0x1.3ecp+10, 0x1.3fp+10, 0x1.3f4p+10, 0x1.3f8p+10, 0x1.3fcp+10, 0x1.4p+10], [0x1.404p+10, 0x1.408p+10, 0x1.40cp+10, 0x1.41p+10, 0x1.414p+10, 0x1.418p+10, 0x1.41cp+10, 0x1.42p+10, 0x1.424p+10, 0x1.428p+10, 0x1.42cp+10, 0x1.43p+10, 0x1.434p+10, 0x1.438p+10, 0x1.43cp+10, 0x1.44p+10, 0x1.444p+10, 0x1.448p+10, 0x1.44cp+10, 0x1.45p+10, 0x1.454p+10, 0x1.458p+10, 0x1.45cp+10, 0x1.46p+10, 0x1.464p+10, 0x1.468p+10, 0x1.46cp+10, 0x1.47p+10, 0x1.474p+10, 0x1.478p+10, 0x1.47cp+10, 0x1.48p+10, 0x1.484p+10, 0x1.488p+10, 0x1.48cp+10, 0x1.49p+10, 0x1.494p+10, 0x1.498p+10, 0x1.49cp+10, 0x1.4ap+10, 0x1.4a4p+10, 0x1.4a8p+10, 0x1.4acp+10, 0x1.4bp+10, 0x1.4b4p+10, 0x1.4b8p+10, 0x1.4bcp+10, 0x1.4cp+10, 0x1.4c4p+10, 0x1.4c8p+10, 0x1.4ccp+10, 0x1.4dp+10, 0x1.4d4p+10, 0x1.4d8p+10, 0x1.4dcp+10, 0x1.4ep+10, 0x1.4e4p+10, 0x1.4e8p+10, 0x1.4ecp+10, 0x1.4fp+10, 0x1.4f4p+10, 0x1.4f8p+10, 0x1.4fcp+10, 0x1.5p+10], [0x1.504p+10, 0x1.508p+10, 0x1.50cp+10, 0x1.51p+10, 0x1.514p+10, 0x1.518p+10, 0x1.51cp+10, 0x1.52p+10, 0x1.524p+10, 0x1.528p+10, 0x1.52cp+10, 0x1.53p+10, 0x1.534p+10, 0x1.538p+10, 0x1.53cp+10, 0x1.54p+10, 0x1.544p+10, 0x1.548p+10, 0x1.54cp+10, 0x1.55p+10, 0x1.554p+10, 0x1.558p+10, 0x1.55cp+10, 0x1.56p+10, 0x1.564p+10, 0x1.568p+10, 0x1.56cp+10, 0x1.57p+10, 0x1.574p+10, 0x1.578p+10, 0x1.57cp+10, 0x1.58p+10, 0x1.584p+10, 0x1.588p+10, 0x1.58cp+10, 0x1.59p+10, 0x1.594p+10, 0x1.598p+10, 0x1.59cp+10, 0x1.5ap+10, 0x1.5a4p+10, 0x1.5a8p+10, 0x1.5acp+10, 0x1.5bp+10, 0x1.5b4p+10, 0x1.5b8p+10, 0x1.5bcp+10, 0x1.5cp+10, 0x1.5c4p+10, 0x1.5c8p+10, 0x1.5ccp+10, 0x1.5dp+10, 0x1.5d4p+10, 0x1.5d8p+10, 0x1.5dcp+10, 0x1.5ep+10, 0x1.5e4p+10, 0x1.5e8p+10, 0x1.5ecp+10, 0x1.5fp+10, 0x1.5f4p+10, 0x1.5f8p+10, 0x1.5fcp+10, 0x1.6p+10], [0x1.604p+10, 0x1.608p+10, 0x1.60cp+10, 0x1.61p+10, 0x1.614p+10, 0x1.618p+10, 0x1.61cp+10, 0x1.62p+10, 0x1.624p+10, 0x1.628p+10, 0x1.62cp+10, 0x1.63p+10, 0x1.634p+10, 0x1.638p+10, 0x1.63cp+10, 0x1.64p+10, 0x1.644p+10, 0x1.648p+10, 0x1.64cp+10, 0x1.65p+10, 0x1.654p+10, 0x1.658p+10, 0x1.65cp+10, 0x1.66p+10, 0x1.664p+10, 0x1.668p+10, 0x1.66cp+10, 0x1.67p+10, 0x1.674p+10, 0x1.678p+10, 0x1.67cp+10, 0x1.68p+10, 0x1.684p+10, 0x1.688p+10, 0x1.68cp+10, 0x1.69p+10, 0x1.694p+10, 0x1.698p+10, 0x1.69cp+10, 0x1.6ap+10, 0x1.6a4p+10, 0x1.6a8p+10, 0x1.6acp+10, 0x1.6bp+10, 0x1.6b4p+10, 0x1.6b8p+10, 0x1.6bcp+10, 0x1.6cp+10, 0x1.6c4p+10, 0x1.6c8p+10, 0x1.6ccp+10, 0x1.6dp+10, 0x1.6d4p+10, 0x1.6d8p+10, 0x1.6dcp+10, 0x1.6ep+10, 0x1.6e4p+10, 0x1.6e8p+10, 0x1.6ecp+10, 0x1.6fp+10, 0x1.6f4p+10, 0x1.6f8p+10, 0x1.6fcp+10, 0x1.7p+10], [0x1.704p+10, 0x1.708p+10, 0x1.70cp+10, 0x1.71p+10, 0x1.714p+10, 0x1.718p+10, 0x1.71cp+10, 0x1.72p+10, 0x1.724p+10, 0x1.728p+10, 0x1.72cp+10, 0x1.73p+10, 0x1.734p+10, 0x1.738p+10, 0x1.73cp+10, 0x1.74p+10, 0x1.744p+10, 0x1.748p+10, 0x1.74cp+10, 0x1.75p+10, 0x1.754p+10, 0x1.758p+10, 0x1.75cp+10, 0x1.76p+10, 0x1.764p+10, 0x1.768p+10, 0x1.76cp+10, 0x1.77p+10, 0x1.774p+10, 0x1.778p+10, 0x1.77cp+10, 0x1.78p+10, 0x1.784p+10, 0x1.788p+10, 0x1.78cp+10, 0x1.79p+10, 0x1.794p+10, 0x1.798p+10, 0x1.79cp+10, 0x1.7ap+10, 0x1.7a4p+10, 0x1.7a8p+10, 0x1.7acp+10, 0x1.7bp+10, 0x1.7b4p+10, 0x1.7b8p+10, 0x1.7bcp+10, 0x1.7cp+10, 0x1.7c4p+10, 0x1.7c8p+10, 0x1.7ccp+10, 0x1.7dp+10, 0x1.7d4p+10, 0x1.7d8p+10, 0x1.7dcp+10, 0x1.7ep+10, 0x1.7e4p+10, 0x1.7e8p+10, 0x1.7ecp+10, 0x1.7fp+10, 0x1.7f4p+10, 0x1.7f8p+10, 0x1.7fcp+10, 0x1.8p+10], [0x1.804p+10, 0x1.808p+10, 0x1.80cp+10, 0x1.81p+10, 0x1.814p+10, 0x1.818p+10, 0x1.81cp+10, 0x1.82p+10, 0x1.824p+10, 0x1.828p+10, 0x1.82cp+10, 0x1.83p+10, 0x1.834p+10, 0x1.838p+10, 0x1.83cp+10, 0x1.84p+10, 0x1.844p+10, 0x1.848p+10, 0x1.84cp+10, 0x1.85p+10, 0x1.854p+10, 0x1.858p+10, 0x1.85cp+10, 0x1.86p+10, 0x1.864p+10, 0x1.868p+10, 0x1.86cp+10, 0x1.87p+10, 0x1.874p+10, 0x1.878p+10, 0x1.87cp+10, 0x1.88p+10, 0x1.884p+10, 0x1.888p+10, 0x1.88cp+10, 0x1.89p+10, 0x1.894p+10, 0x1.898p+10, 0x1.89cp+10, 0x1.8ap+10, 0x1.8a4p+10, 0x1.8a8p+10, 0x1.8acp+10, 0x1.8bp+10, 0x1.8b4p+10, 0x1.8b8p+10, 0x1.8bcp+10, 0x1.8cp+10, 0x1.8c4p+10, 0x1.8c8p+10, 0x1.8ccp+10, 0x1.8dp+10, 0x1.8d4p+10, 0x1.8d8p+10, 0x1.8dcp+10, 0x1.8ep+10, 0x1.8e4p+10, 0x1.8e8p+10, 0x1.8ecp+10, 0x1.8fp+10, 0x1.8f4p+10, 0x1.8f8p+10, 0x1.8fcp+10, 0x1.9p+10], [0x1.904p+10, 0x1.908p+10, 0x1.90cp+10, 0x1.91p+10, 0x1.914p+10, 0x1.918p+10, 0x1.91cp+10, 0x1.92p+10, 0x1.924p+10, 0x1.928p+10, 0x1.92cp+10, 0x1.93p+10, 0x1.934p+10, 0x1.938p+10, 0x1.93cp+10, 0x1.94p+10, 0x1.944p+10, 0x1.948p+10, 0x1.94cp+10, 0x1.95p+10, 0x1.954p+10, 0x1.958p+10, 0x1.95cp+10, 0x1.96p+10, 0x1.964p+10, 0x1.968p+10, 0x1.96cp+10, 0x1.97p+10, 0x1.974p+10, 0x1.978p+10, 0x1.97cp+10, 0x1.98p+10, 0x1.984p+10, 0x1.988p+10, 0x1.98cp+10, 0x1.99p+10, 0x1.994p+10, 0x1.998p+10, 0x1.99cp+10, 0x1.9ap+10, 0x1.9a4p+10, 0x1.9a8p+10, 0x1.9acp+10, 0x1.9bp+10, 0x1.9b4p+10, 0x1.9b8p+10, 0x1.9bcp+10, 0x1.9cp+10, 0x1.9c4p+10, 0x1.9c8p+10, 0x1.9ccp+10, 0x1.9dp+10, 0x1.9d4p+10, 0x1.9d8p+10, 0x1.9dcp+10, 0x1.9ep+10, 0x1.9e4p+10, 0x1.9e8p+10, 0x1.9ecp+10, 0x1.9fp+10, 0x1.9f4p+10, 0x1.9f8p+10, 0x1.9fcp+10, 0x1.ap+10], [0x1.a04p+10, 0x1.a08p+10, 0x1.a0cp+10, 0x1.a1p+10, 0x1.a14p+10, 0x1.a18p+10, 0x1.a1cp+10, 0x1.a2p+10, 0x1.a24p+10, 0x1.a28p+10, 0x1.a2cp+10, 0x1.a3p+10, 0x1.a34p+10, 0x1.a38p+10, 0x1.a3cp+10, 0x1.a4p+10, 0x1.a44p+10, 0x1.a48p+10, 0x1.a4cp+10, 0x1.a5p+10, 0x1.a54p+10, 0x1.a58p+10, 0x1.a5cp+10, 0x1.a6p+10, 0x1.a64p+10, 0x1.a68p+10, 0x1.a6cp+10, 0x1.a7p+10, 0x1.a74p+10, 0x1.a78p+10, 0x1.a7cp+10, 0x1.a8p+10, 0x1.a84p+10, 0x1.a88p+10, 0x1.a8cp+10, 0x1.a9p+10, 0x1.a94p+10, 0x1.a98p+10, 0x1.a9cp+10, 0x1.aap+10, 0x1.aa4p+10, 0x1.aa8p+10, 0x1.aacp+10, 0x1.abp+10, 0x1.ab4p+10, 0x1.ab8p+10, 0x1.abcp+10, 0x1.acp+10, 0x1.ac4p+10, 0x1.ac8p+10, 0x1.accp+10, 0x1.adp+10, 0x1.ad4p+10, 0x1.ad8p+10, 0x1.adcp+10, 0x1.aep+10, 0x1.ae4p+10, 0x1.ae8p+10, 0x1.aecp+10, 0x1.afp+10, 0x1.af4p+10, 0x1.af8p+10, 0x1.afcp+10, 0x1.bp+10], [0x1.b04p+10, 0x1.b08p+10, 0x1.b0cp+10, 0x1.b1p+10, 0x1.b14p+10, 0x1.b18p+10, 0x1.b1cp+10, 0x1.b2p+10, 0x1.b24p+10, 0x1.b28p+10, 0x1.b2cp+10, 0x1.b3p+10, 0x1.b34p+10, 0x1.b38p+10, 0x1.b3cp+10, 0x1.b4p+10, 0x1.b44p+10, 0x1.b48p+10, 0x1.b4cp+10, 0x1.b5p+10, 0x1.b54p+10, 0x1.b58p+10, 0x1.b5cp+10, 0x1.b6p+10, 0x1.b64p+10, 0x1.b68p+10, 0x1.b6cp+10, 0x1.b7p+10, 0x1.b74p+10, 0x1.b78p+10, 0x1.b7cp+10, 0x1.b8p+10, 0x1.b84p+10, 0x1.b88p+10, 0x1.b8cp+10, 0x1.b9p+10, 0x1.b94p+10, 0x1.b98p+10, 0x1.b9cp+10, 0x1.bap+10, 0x1.ba4p+10, 0x1.ba8p+10, 0x1.bacp+10, 0x1.bbp+10, 0x1.bb4p+10, 0x1.bb8p+10, 0x1.bbcp+10, 0x1.bcp+10, 0x1.bc4p+10, 0x1.bc8p+10, 0x1.bccp+10, 0x1.bdp+10, 0x1.bd4p+10, 0x1.bd8p+10, 0x1.bdcp+10, 0x1.bep+10, 0x1.be4p+10, 0x1.be8p+10, 0x1.becp+10, 0x1.bfp+10, 0x1.bf4p+10, 0x1.bf8p+10, 0x1.bfcp+10, 0x1.cp+10], [0x1.c04p+10, 0x1.c08p+10, 0x1.c0cp+10, 0x1.c1p+10, 0x1.c14p+10, 0x1.c18p+10, 0x1.c1cp+10, 0x1.c2p+10, 0x1.c24p+10, 0x1.c28p+10, 0x1.c2cp+10, 0x1.c3p+10, 0x1.c34p+10, 0x1.c38p+10, 0x1.c3cp+10, 0x1.c4p+10, 0x1.c44p+10, 0x1.c48p+10, 0x1.c4cp+10, 0x1.c5p+10, 0x1.c54p+10, 0x1.c58p+10, 0x1.c5cp+10, 0x1.c6p+10, 0x1.c64p+10, 0x1.c68p+10, 0x1.c6cp+10, 0x1.c7p+10, 0x1.c74p+10, 0x1.c78p+10, 0x1.c7cp+10, 0x1.c8p+10, 0x1.c84p+10, 0x1.c88p+10, 0x1.c8cp+10, 0x1.c9p+10, 0x1.c94p+10, 0x1.c98p+10, 0x1.c9cp+10, 0x1.cap+10, 0x1.ca4p+10, 0x1.ca8p+10, 0x1.cacp+10, 0x1.cbp+10, 0x1.cb4p+10, 0x1.cb8p+10, 0x1.cbcp+10, 0x1.ccp+10, 0x1.cc4p+10, 0x1.cc8p+10, 0x1.cccp+10, 0x1.cdp+10, 0x1.cd4p+10, 0x1.cd8p+10, 0x1.cdcp+10, 0x1.cep+10, 0x1.ce4p+10, 0x1.ce8p+10, 0x1.cecp+10, 0x1.cfp+10, 0x1.cf4p+10, 0x1.cf8p+10, 0x1.cfcp+10, 0x1.dp+10], [0x1.d04p+10, 0x1.d08p+10, 0x1.d0cp+10, 0x1.d1p+10, 0x1.d14p+10, 0x1.d18p+10, 0x1.d1cp+10, 0x1.d2p+10, 0x1.d24p+10, 0x1.d28p+10, 0x1.d2cp+10, 0x1.d3p+10, 0x1.d34p+10, 0x1.d38p+10, 0x1.d3cp+10, 0x1.d4p+10, 0x1.d44p+10, 0x1.d48p+10, 0x1.d4cp+10, 0x1.d5p+10, 0x1.d54p+10, 0x1.d58p+10, 0x1.d5cp+10, 0x1.d6p+10, 0x1.d64p+10, 0x1.d68p+10, 0x1.d6cp+10, 0x1.d7p+10, 0x1.d74p+10, 0x1.d78p+10, 0x1.d7cp+10, 0x1.d8p+10, 0x1.d84p+10, 0x1.d88p+10, 0x1.d8cp+10, 0x1.d9p+10, 0x1.d94p+10, 0x1.d98p+10, 0x1.d9cp+10, 0x1.dap+10, 0x1.da4p+10, 0x1.da8p+10, 0x1.dacp+10, 0x1.dbp+10, 0x1.db4p+10, 0x1.db8p+10, 0x1.dbcp+10, 0x1.dcp+10, 0x1.dc4p+10, 0x1.dc8p+10, 0x1.dccp+10, 0x1.ddp+10, 0x1.dd4p+10, 0x1.dd8p+10, 0x1.ddcp+10, 0x1.dep+10, 0x1.de4p+10, 0x1.de8p+10, 0x1.decp+10, 0x1.dfp+10, 0x1.df4p+10, 0x1.df8p+10, 0x1.dfcp+10, 0x1.ep+10], [0x1.e04p+10, 0x1.e08p+10, 0x1.e0cp+10, 0x1.e1p+10, 0x1.e14p+10, 0x1.e18p+10, 0x1.e1cp+10, 0x1.e2p+10, 0x1.e24p+10, 0x1.e28p+10, 0x1.e2cp+10, 0x1.e3p+10, 0x1.e34p+10, 0x1.e38p+10, 0x1.e3cp+10, 0x1.e4p+10, 0x1.e44p+10, 0x1.e48p+10, 0x1.e4cp+10, 0x1.e5p+10, 0x1.e54p+10, 0x1.e58p+10, 0x1.e5cp+10, 0x1.e6p+10, 0x1.e64p+10, 0x1.e68p+10, 0x1.e6cp+10, 0x1.e7p+10, 0x1.e74p+10, 0x1.e78p+10, 0x1.e7cp+10, 0x1.e8p+10, 0x1.e84p+10, 0x1.e88p+10, 0x1.e8cp+10, 0x1.e9p+10, 0x1.e94p+10, 0x1.e98p+10, 0x1.e9cp+10, 0x1.eap+10, 0x1.ea4p+10, 0x1.ea8p+10, 0x1.eacp+10, 0x1.ebp+10, 0x1.eb4p+10, 0x1.eb8p+10, 0x1.ebcp+10, 0x1.ecp+10, 0x1.ec4p+10, 0x1.ec8p+10, 0x1.eccp+10, 0x1.edp+10, 0x1.ed4p+10, 0x1.ed8p+10, 0x1.edcp+10, 0x1.eep+10, 0x1.ee4p+10, 0x1.ee8p+10, 0x1.eecp+10, 0x1.efp+10, 0x1.ef4p+10, 0x1.ef8p+10, 0x1.efcp+10, 0x1.fp+10], [0x1.f04p+10, 0x1.f08p+10, 0x1.f0cp+10, 0x1.f1p+10, 0x1.f14p+10, 0x1.f18p+10, 0x1.f1cp+10, 0x1.f2p+10, 0x1.f24p+10, 0x1.f28p+10, 0x1.f2cp+10, 0x1.f3p+10, 0x1.f34p+10, 0x1.f38p+10, 0x1.f3cp+10, 0x1.f4p+10, 0x1.f44p+10, 0x1.f48p+10, 0x1.f4cp+10, 0x1.f5p+10, 0x1.f54p+10, 0x1.f58p+10, 0x1.f5cp+10, 0x1.f6p+10, 0x1.f64p+10, 0x1.f68p+10, 0x1.f6cp+10, 0x1.f7p+10, 0x1.f74p+10, 0x1.f78p+10, 0x1.f7cp+10, 0x1.f8p+10, 0x1.f84p+10, 0x1.f88p+10, 0x1.f8cp+10, 0x1.f9p+10, 0x1.f94p+10, 0x1.f98p+10, 0x1.f9cp+10, 0x1.fap+10, 0x1.fa4p+10, 0x1.fa8p+10, 0x1.facp+10, 0x1.fbp+10, 0x1.fb4p+10, 0x1.fb8p+10, 0x1.fbcp+10, 0x1.fcp+10, 0x1.fc4p+10, 0x1.fc8p+10, 0x1.fccp+10, 0x1.fdp+10, 0x1.fd4p+10, 0x1.fd8p+10, 0x1.fdcp+10, 0x1.fep+10, 0x1.fe4p+10, 0x1.fe8p+10, 0x1.fecp+10, 0x1.ffp+10, 0x1.ff4p+10, 0x1.ff8p+10, 0x1.ffcp+10, 0x1p+11], [0x1.002p+11, 0x1.004p+11, 0x1.006p+11, 0x1.008p+11, 0x1.00ap+11, 0x1.00cp+11, 0x1.00ep+11, 0x1.01p+11, 0x1.012p+11, 0x1.014p+11, 0x1.016p+11, 0x1.018p+11, 0x1.01ap+11, 0x1.01cp+11, 0x1.01ep+11, 0x1.02p+11, 0x1.022p+11, 0x1.024p+11, 0x1.026p+11, 0x1.028p+11, 0x1.02ap+11, 0x1.02cp+11, 0x1.02ep+11, 0x1.03p+11, 0x1.032p+11, 0x1.034p+11, 0x1.036p+11, 0x1.038p+11, 0x1.03ap+11, 0x1.03cp+11, 0x1.03ep+11, 0x1.04p+11, 0x1.042p+11, 0x1.044p+11, 0x1.046p+11, 0x1.048p+11, 0x1.04ap+11, 0x1.04cp+11, 0x1.04ep+11, 0x1.05p+11, 0x1.052p+11, 0x1.054p+11, 0x1.056p+11, 0x1.058p+11, 0x1.05ap+11, 0x1.05cp+11, 0x1.05ep+11, 0x1.06p+11, 0x1.062p+11, 0x1.064p+11, 0x1.066p+11, 0x1.068p+11, 0x1.06ap+11, 0x1.06cp+11, 0x1.06ep+11, 0x1.07p+11, 0x1.072p+11, 0x1.074p+11, 0x1.076p+11, 0x1.078p+11, 0x1.07ap+11, 0x1.07cp+11, 0x1.07ep+11, 0x1.08p+11], [0x1.082p+11, 0x1.084p+11, 0x1.086p+11, 0x1.088p+11, 0x1.08ap+11, 0x1.08cp+11, 0x1.08ep+11, 0x1.09p+11, 0x1.092p+11, 0x1.094p+11, 0x1.096p+11, 0x1.098p+11, 0x1.09ap+11, 0x1.09cp+11, 0x1.09ep+11, 0x1.0ap+11, 0x1.0a2p+11, 0x1.0a4p+11, 0x1.0a6p+11, 0x1.0a8p+11, 0x1.0aap+11, 0x1.0acp+11, 0x1.0aep+11, 0x1.0bp+11, 0x1.0b2p+11, 0x1.0b4p+11, 0x1.0b6p+11, 0x1.0b8p+11, 0x1.0bap+11, 0x1.0bcp+11, 0x1.0bep+11, 0x1.0cp+11, 0x1.0c2p+11, 0x1.0c4p+11, 0x1.0c6p+11, 0x1.0c8p+11, 0x1.0cap+11, 0x1.0ccp+11, 0x1.0cep+11, 0x1.0dp+11, 0x1.0d2p+11, 0x1.0d4p+11, 0x1.0d6p+11, 0x1.0d8p+11, 0x1.0dap+11, 0x1.0dcp+11, 0x1.0dep+11, 0x1.0ep+11, 0x1.0e2p+11, 0x1.0e4p+11, 0x1.0e6p+11, 0x1.0e8p+11, 0x1.0eap+11, 0x1.0ecp+11, 0x1.0eep+11, 0x1.0fp+11, 0x1.0f2p+11, 0x1.0f4p+11, 0x1.0f6p+11, 0x1.0f8p+11, 0x1.0fap+11, 0x1.0fcp+11, 0x1.0fep+11, 0x1.1p+11], [0x1.102p+11, 0x1.104p+11, 0x1.106p+11, 0x1.108p+11, 0x1.10ap+11, 0x1.10cp+11, 0x1.10ep+11, 0x1.11p+11, 0x1.112p+11, 0x1.114p+11, 0x1.116p+11, 0x1.118p+11, 0x1.11ap+11, 0x1.11cp+11, 0x1.11ep+11, 0x1.12p+11, 0x1.122p+11, 0x1.124p+11, 0x1.126p+11, 0x1.128p+11, 0x1.12ap+11, 0x1.12cp+11, 0x1.12ep+11, 0x1.13p+11, 0x1.132p+11, 0x1.134p+11, 0x1.136p+11, 0x1.138p+11, 0x1.13ap+11, 0x1.13cp+11, 0x1.13ep+11, 0x1.14p+11, 0x1.142p+11, 0x1.144p+11, 0x1.146p+11, 0x1.148p+11, 0x1.14ap+11, 0x1.14cp+11, 0x1.14ep+11, 0x1.15p+11, 0x1.152p+11, 0x1.154p+11, 0x1.156p+11, 0x1.158p+11, 0x1.15ap+11, 0x1.15cp+11, 0x1.15ep+11, 0x1.16p+11, 0x1.162p+11, 0x1.164p+11, 0x1.166p+11, 0x1.168p+11, 0x1.16ap+11, 0x1.16cp+11, 0x1.16ep+11, 0x1.17p+11, 0x1.172p+11, 0x1.174p+11, 0x1.176p+11, 0x1.178p+11, 0x1.17ap+11, 0x1.17cp+11, 0x1.17ep+11, 0x1.18p+11], [0x1.182p+11, 0x1.184p+11, 0x1.186p+11, 0x1.188p+11, 0x1.18ap+11, 0x1.18cp+11, 0x1.18ep+11, 0x1.19p+11, 0x1.192p+11, 0x1.194p+11, 0x1.196p+11, 0x1.198p+11, 0x1.19ap+11, 0x1.19cp+11, 0x1.19ep+11, 0x1.1ap+11, 0x1.1a2p+11, 0x1.1a4p+11, 0x1.1a6p+11, 0x1.1a8p+11, 0x1.1aap+11, 0x1.1acp+11, 0x1.1aep+11, 0x1.1bp+11, 0x1.1b2p+11, 0x1.1b4p+11, 0x1.1b6p+11, 0x1.1b8p+11, 0x1.1bap+11, 0x1.1bcp+11, 0x1.1bep+11, 0x1.1cp+11, 0x1.1c2p+11, 0x1.1c4p+11, 0x1.1c6p+11, 0x1.1c8p+11, 0x1.1cap+11, 0x1.1ccp+11, 0x1.1cep+11, 0x1.1dp+11, 0x1.1d2p+11, 0x1.1d4p+11, 0x1.1d6p+11, 0x1.1d8p+11, 0x1.1dap+11, 0x1.1dcp+11, 0x1.1dep+11, 0x1.1ep+11, 0x1.1e2p+11, 0x1.1e4p+11, 0x1.1e6p+11, 0x1.1e8p+11, 0x1.1eap+11, 0x1.1ecp+11, 0x1.1eep+11, 0x1.1fp+11, 0x1.1f2p+11, 0x1.1f4p+11, 0x1.1f6p+11, 0x1.1f8p+11, 0x1.1fap+11, 0x1.1fcp+11, 0x1.1fep+11, 0x1.2p+11], [0x1.202p+11, 0x1.204p+11, 0x1.206p+11, 0x1.208p+11, 0x1.20ap+11, 0x1.20cp+11, 0x1.20ep+11, 0x1.21p+11, 0x1.212p+11, 0x1.214p+11, 0x1.216p+11, 0x1.218p+11, 0x1.21ap+11, 0x1.21cp+11, 0x1.21ep+11, 0x1.22p+11, 0x1.222p+11, 0x1.224p+11, 0x1.226p+11, 0x1.228p+11, 0x1.22ap+11, 0x1.22cp+11, 0x1.22ep+11, 0x1.23p+11, 0x1.232p+11, 0x1.234p+11, 0x1.236p+11, 0x1.238p+11, 0x1.23ap+11, 0x1.23cp+11, 0x1.23ep+11, 0x1.24p+11, 0x1.242p+11, 0x1.244p+11, 0x1.246p+11, 0x1.248p+11, 0x1.24ap+11, 0x1.24cp+11, 0x1.24ep+11, 0x1.25p+11, 0x1.252p+11, 0x1.254p+11, 0x1.256p+11, 0x1.258p+11, 0x1.25ap+11, 0x1.25cp+11, 0x1.25ep+11, 0x1.26p+11, 0x1.262p+11, 0x1.264p+11, 0x1.266p+11, 0x1.268p+11, 0x1.26ap+11, 0x1.26cp+11, 0x1.26ep+11, 0x1.27p+11, 0x1.272p+11, 0x1.274p+11, 0x1.276p+11, 0x1.278p+11, 0x1.27ap+11, 0x1.27cp+11, 0x1.27ep+11, 0x1.28p+11], [0x1.282p+11, 0x1.284p+11, 0x1.286p+11, 0x1.288p+11, 0x1.28ap+11, 0x1.28cp+11, 0x1.28ep+11, 0x1.29p+11, 0x1.292p+11, 0x1.294p+11, 0x1.296p+11, 0x1.298p+11, 0x1.29ap+11, 0x1.29cp+11, 0x1.29ep+11, 0x1.2ap+11, 0x1.2a2p+11, 0x1.2a4p+11, 0x1.2a6p+11, 0x1.2a8p+11, 0x1.2aap+11, 0x1.2acp+11, 0x1.2aep+11, 0x1.2bp+11, 0x1.2b2p+11, 0x1.2b4p+11, 0x1.2b6p+11, 0x1.2b8p+11, 0x1.2bap+11, 0x1.2bcp+11, 0x1.2bep+11, 0x1.2cp+11, 0x1.2c2p+11, 0x1.2c4p+11, 0x1.2c6p+11, 0x1.2c8p+11, 0x1.2cap+11, 0x1.2ccp+11, 0x1.2cep+11, 0x1.2dp+11, 0x1.2d2p+11, 0x1.2d4p+11, 0x1.2d6p+11, 0x1.2d8p+11, 0x1.2dap+11, 0x1.2dcp+11, 0x1.2dep+11, 0x1.2ep+11, 0x1.2e2p+11, 0x1.2e4p+11, 0x1.2e6p+11, 0x1.2e8p+11, 0x1.2eap+11, 0x1.2ecp+11, 0x1.2eep+11, 0x1.2fp+11, 0x1.2f2p+11, 0x1.2f4p+11, 0x1.2f6p+11, 0x1.2f8p+11, 0x1.2fap+11, 0x1.2fcp+11, 0x1.2fep+11, 0x1.3p+11], [0x1.302p+11, 0x1.304p+11, 0x1.306p+11, 0x1.308p+11, 0x1.30ap+11, 0x1.30cp+11, 0x1.30ep+11, 0x1.31p+11, 0x1.312p+11, 0x1.314p+11, 0x1.316p+11, 0x1.318p+11, 0x1.31ap+11, 0x1.31cp+11, 0x1.31ep+11, 0x1.32p+11, 0x1.322p+11, 0x1.324p+11, 0x1.326p+11, 0x1.328p+11, 0x1.32ap+11, 0x1.32cp+11, 0x1.32ep+11, 0x1.33p+11, 0x1.332p+11, 0x1.334p+11, 0x1.336p+11, 0x1.338p+11, 0x1.33ap+11, 0x1.33cp+11, 0x1.33ep+11, 0x1.34p+11, 0x1.342p+11, 0x1.344p+11, 0x1.346p+11, 0x1.348p+11, 0x1.34ap+11, 0x1.34cp+11, 0x1.34ep+11, 0x1.35p+11, 0x1.352p+11, 0x1.354p+11, 0x1.356p+11, 0x1.358p+11, 0x1.35ap+11, 0x1.35cp+11, 0x1.35ep+11, 0x1.36p+11, 0x1.362p+11, 0x1.364p+11, 0x1.366p+11, 0x1.368p+11, 0x1.36ap+11, 0x1.36cp+11, 0x1.36ep+11, 0x1.37p+11, 0x1.372p+11, 0x1.374p+11, 0x1.376p+11, 0x1.378p+11, 0x1.37ap+11, 0x1.37cp+11, 0x1.37ep+11, 0x1.38p+11], [0x1.382p+11, 0x1.384p+11, 0x1.386p+11, 0x1.388p+11, 0x1.38ap+11, 0x1.38cp+11, 0x1.38ep+11, 0x1.39p+11, 0x1.392p+11, 0x1.394p+11, 0x1.396p+11, 0x1.398p+11, 0x1.39ap+11, 0x1.39cp+11, 0x1.39ep+11, 0x1.3ap+11, 0x1.3a2p+11, 0x1.3a4p+11, 0x1.3a6p+11, 0x1.3a8p+11, 0x1.3aap+11, 0x1.3acp+11, 0x1.3aep+11, 0x1.3bp+11, 0x1.3b2p+11, 0x1.3b4p+11, 0x1.3b6p+11, 0x1.3b8p+11, 0x1.3bap+11, 0x1.3bcp+11, 0x1.3bep+11, 0x1.3cp+11, 0x1.3c2p+11, 0x1.3c4p+11, 0x1.3c6p+11, 0x1.3c8p+11, 0x1.3cap+11, 0x1.3ccp+11, 0x1.3cep+11, 0x1.3dp+11, 0x1.3d2p+11, 0x1.3d4p+11, 0x1.3d6p+11, 0x1.3d8p+11, 0x1.3dap+11, 0x1.3dcp+11, 0x1.3dep+11, 0x1.3ep+11, 0x1.3e2p+11, 0x1.3e4p+11, 0x1.3e6p+11, 0x1.3e8p+11, 0x1.3eap+11, 0x1.3ecp+11, 0x1.3eep+11, 0x1.3fp+11, 0x1.3f2p+11, 0x1.3f4p+11, 0x1.3f6p+11, 0x1.3f8p+11, 0x1.3fap+11, 0x1.3fcp+11, 0x1.3fep+11, 0x1.4p+11], [0x1.402p+11, 0x1.404p+11, 0x1.406p+11, 0x1.408p+11, 0x1.40ap+11, 0x1.40cp+11, 0x1.40ep+11, 0x1.41p+11, 0x1.412p+11, 0x1.414p+11, 0x1.416p+11, 0x1.418p+11, 0x1.41ap+11, 0x1.41cp+11, 0x1.41ep+11, 0x1.42p+11, 0x1.422p+11, 0x1.424p+11, 0x1.426p+11, 0x1.428p+11, 0x1.42ap+11, 0x1.42cp+11, 0x1.42ep+11, 0x1.43p+11, 0x1.432p+11, 0x1.434p+11, 0x1.436p+11, 0x1.438p+11, 0x1.43ap+11, 0x1.43cp+11, 0x1.43ep+11, 0x1.44p+11, 0x1.442p+11, 0x1.444p+11, 0x1.446p+11, 0x1.448p+11, 0x1.44ap+11, 0x1.44cp+11, 0x1.44ep+11, 0x1.45p+11, 0x1.452p+11, 0x1.454p+11, 0x1.456p+11, 0x1.458p+11, 0x1.45ap+11, 0x1.45cp+11, 0x1.45ep+11, 0x1.46p+11, 0x1.462p+11, 0x1.464p+11, 0x1.466p+11, 0x1.468p+11, 0x1.46ap+11, 0x1.46cp+11, 0x1.46ep+11, 0x1.47p+11, 0x1.472p+11, 0x1.474p+11, 0x1.476p+11, 0x1.478p+11, 0x1.47ap+11, 0x1.47cp+11, 0x1.47ep+11, 0x1.48p+11], [0x1.482p+11, 0x1.484p+11, 0x1.486p+11, 0x1.488p+11, 0x1.48ap+11, 0x1.48cp+11, 0x1.48ep+11, 0x1.49p+11, 0x1.492p+11, 0x1.494p+11, 0x1.496p+11, 0x1.498p+11, 0x1.49ap+11, 0x1.49cp+11, 0x1.49ep+11, 0x1.4ap+11, 0x1.4a2p+11, 0x1.4a4p+11, 0x1.4a6p+11, 0x1.4a8p+11, 0x1.4aap+11, 0x1.4acp+11, 0x1.4aep+11, 0x1.4bp+11, 0x1.4b2p+11, 0x1.4b4p+11, 0x1.4b6p+11, 0x1.4b8p+11, 0x1.4bap+11, 0x1.4bcp+11, 0x1.4bep+11, 0x1.4cp+11, 0x1.4c2p+11, 0x1.4c4p+11, 0x1.4c6p+11, 0x1.4c8p+11, 0x1.4cap+11, 0x1.4ccp+11, 0x1.4cep+11, 0x1.4dp+11, 0x1.4d2p+11, 0x1.4d4p+11, 0x1.4d6p+11, 0x1.4d8p+11, 0x1.4dap+11, 0x1.4dcp+11, 0x1.4dep+11, 0x1.4ep+11, 0x1.4e2p+11, 0x1.4e4p+11, 0x1.4e6p+11, 0x1.4e8p+11, 0x1.4eap+11, 0x1.4ecp+11, 0x1.4eep+11, 0x1.4fp+11, 0x1.4f2p+11, 0x1.4f4p+11, 0x1.4f6p+11, 0x1.4f8p+11, 0x1.4fap+11, 0x1.4fcp+11, 0x1.4fep+11, 0x1.5p+11], [0x1.502p+11, 0x1.504p+11, 0x1.506p+11, 0x1.508p+11, 0x1.50ap+11, 0x1.50cp+11, 0x1.50ep+11, 0x1.51p+11, 0x1.512p+11, 0x1.514p+11, 0x1.516p+11, 0x1.518p+11, 0x1.51ap+11, 0x1.51cp+11, 0x1.51ep+11, 0x1.52p+11, 0x1.522p+11, 0x1.524p+11, 0x1.526p+11, 0x1.528p+11, 0x1.52ap+11, 0x1.52cp+11, 0x1.52ep+11, 0x1.53p+11, 0x1.532p+11, 0x1.534p+11, 0x1.536p+11, 0x1.538p+11, 0x1.53ap+11, 0x1.53cp+11, 0x1.53ep+11, 0x1.54p+11, 0x1.542p+11, 0x1.544p+11, 0x1.546p+11, 0x1.548p+11, 0x1.54ap+11, 0x1.54cp+11, 0x1.54ep+11, 0x1.55p+11, 0x1.552p+11, 0x1.554p+11, 0x1.556p+11, 0x1.558p+11, 0x1.55ap+11, 0x1.55cp+11, 0x1.55ep+11, 0x1.56p+11, 0x1.562p+11, 0x1.564p+11, 0x1.566p+11, 0x1.568p+11, 0x1.56ap+11, 0x1.56cp+11, 0x1.56ep+11, 0x1.57p+11, 0x1.572p+11, 0x1.574p+11, 0x1.576p+11, 0x1.578p+11, 0x1.57ap+11, 0x1.57cp+11, 0x1.57ep+11, 0x1.58p+11], [0x1.582p+11, 0x1.584p+11, 0x1.586p+11, 0x1.588p+11, 0x1.58ap+11, 0x1.58cp+11, 0x1.58ep+11, 0x1.59p+11, 0x1.592p+11, 0x1.594p+11, 0x1.596p+11, 0x1.598p+11, 0x1.59ap+11, 0x1.59cp+11, 0x1.59ep+11, 0x1.5ap+11, 0x1.5a2p+11, 0x1.5a4p+11, 0x1.5a6p+11, 0x1.5a8p+11, 0x1.5aap+11, 0x1.5acp+11, 0x1.5aep+11, 0x1.5bp+11, 0x1.5b2p+11, 0x1.5b4p+11, 0x1.5b6p+11, 0x1.5b8p+11, 0x1.5bap+11, 0x1.5bcp+11, 0x1.5bep+11, 0x1.5cp+11, 0x1.5c2p+11, 0x1.5c4p+11, 0x1.5c6p+11, 0x1.5c8p+11, 0x1.5cap+11, 0x1.5ccp+11, 0x1.5cep+11, 0x1.5dp+11, 0x1.5d2p+11, 0x1.5d4p+11, 0x1.5d6p+11, 0x1.5d8p+11, 0x1.5dap+11, 0x1.5dcp+11, 0x1.5dep+11, 0x1.5ep+11, 0x1.5e2p+11, 0x1.5e4p+11, 0x1.5e6p+11, 0x1.5e8p+11, 0x1.5eap+11, 0x1.5ecp+11, 0x1.5eep+11, 0x1.5fp+11, 0x1.5f2p+11, 0x1.5f4p+11, 0x1.5f6p+11, 0x1.5f8p+11, 0x1.5fap+11, 0x1.5fcp+11, 0x1.5fep+11, 0x1.6p+11], [0x1.602p+11, 0x1.604p+11, 0x1.606p+11, 0x1.608p+11, 0x1.60ap+11, 0x1.60cp+11, 0x1.60ep+11, 0x1.61p+11, 0x1.612p+11, 0x1.614p+11, 0x1.616p+11, 0x1.618p+11, 0x1.61ap+11, 0x1.61cp+11, 0x1.61ep+11, 0x1.62p+11, 0x1.622p+11, 0x1.624p+11, 0x1.626p+11, 0x1.628p+11, 0x1.62ap+11, 0x1.62cp+11, 0x1.62ep+11, 0x1.63p+11, 0x1.632p+11, 0x1.634p+11, 0x1.636p+11, 0x1.638p+11, 0x1.63ap+11, 0x1.63cp+11, 0x1.63ep+11, 0x1.64p+11, 0x1.642p+11, 0x1.644p+11, 0x1.646p+11, 0x1.648p+11, 0x1.64ap+11, 0x1.64cp+11, 0x1.64ep+11, 0x1.65p+11, 0x1.652p+11, 0x1.654p+11, 0x1.656p+11, 0x1.658p+11, 0x1.65ap+11, 0x1.65cp+11, 0x1.65ep+11, 0x1.66p+11, 0x1.662p+11, 0x1.664p+11, 0x1.666p+11, 0x1.668p+11, 0x1.66ap+11, 0x1.66cp+11, 0x1.66ep+11, 0x1.67p+11, 0x1.672p+11, 0x1.674p+11, 0x1.676p+11, 0x1.678p+11, 0x1.67ap+11, 0x1.67cp+11, 0x1.67ep+11, 0x1.68p+11], [0x1.682p+11, 0x1.684p+11, 0x1.686p+11, 0x1.688p+11, 0x1.68ap+11, 0x1.68cp+11, 0x1.68ep+11, 0x1.69p+11, 0x1.692p+11, 0x1.694p+11, 0x1.696p+11, 0x1.698p+11, 0x1.69ap+11, 0x1.69cp+11, 0x1.69ep+11, 0x1.6ap+11, 0x1.6a2p+11, 0x1.6a4p+11, 0x1.6a6p+11, 0x1.6a8p+11, 0x1.6aap+11, 0x1.6acp+11, 0x1.6aep+11, 0x1.6bp+11, 0x1.6b2p+11, 0x1.6b4p+11, 0x1.6b6p+11, 0x1.6b8p+11, 0x1.6bap+11, 0x1.6bcp+11, 0x1.6bep+11, 0x1.6cp+11, 0x1.6c2p+11, 0x1.6c4p+11, 0x1.6c6p+11, 0x1.6c8p+11, 0x1.6cap+11, 0x1.6ccp+11, 0x1.6cep+11, 0x1.6dp+11, 0x1.6d2p+11, 0x1.6d4p+11, 0x1.6d6p+11, 0x1.6d8p+11, 0x1.6dap+11, 0x1.6dcp+11, 0x1.6dep+11, 0x1.6ep+11, 0x1.6e2p+11, 0x1.6e4p+11, 0x1.6e6p+11, 0x1.6e8p+11, 0x1.6eap+11, 0x1.6ecp+11, 0x1.6eep+11, 0x1.6fp+11, 0x1.6f2p+11, 0x1.6f4p+11, 0x1.6f6p+11, 0x1.6f8p+11, 0x1.6fap+11, 0x1.6fcp+11, 0x1.6fep+11, 0x1.7p+11], [0x1.702p+11, 0x1.704p+11, 0x1.706p+11, 0x1.708p+11, 0x1.70ap+11, 0x1.70cp+11, 0x1.70ep+11, 0x1.71p+11, 0x1.712p+11, 0x1.714p+11, 0x1.716p+11, 0x1.718p+11, 0x1.71ap+11, 0x1.71cp+11, 0x1.71ep+11, 0x1.72p+11, 0x1.722p+11, 0x1.724p+11, 0x1.726p+11, 0x1.728p+11, 0x1.72ap+11, 0x1.72cp+11, 0x1.72ep+11, 0x1.73p+11, 0x1.732p+11, 0x1.734p+11, 0x1.736p+11, 0x1.738p+11, 0x1.73ap+11, 0x1.73cp+11, 0x1.73ep+11, 0x1.74p+11, 0x1.742p+11, 0x1.744p+11, 0x1.746p+11, 0x1.748p+11, 0x1.74ap+11, 0x1.74cp+11, 0x1.74ep+11, 0x1.75p+11, 0x1.752p+11, 0x1.754p+11, 0x1.756p+11, 0x1.758p+11, 0x1.75ap+11, 0x1.75cp+11, 0x1.75ep+11, 0x1.76p+11, 0x1.762p+11, 0x1.764p+11, 0x1.766p+11, 0x1.768p+11, 0x1.76ap+11, 0x1.76cp+11, 0x1.76ep+11, 0x1.77p+11, 0x1.772p+11, 0x1.774p+11, 0x1.776p+11, 0x1.778p+11, 0x1.77ap+11, 0x1.77cp+11, 0x1.77ep+11, 0x1.78p+11], [0x1.782p+11, 0x1.784p+11, 0x1.786p+11, 0x1.788p+11, 0x1.78ap+11, 0x1.78cp+11, 0x1.78ep+11, 0x1.79p+11, 0x1.792p+11, 0x1.794p+11, 0x1.796p+11, 0x1.798p+11, 0x1.79ap+11, 0x1.79cp+11, 0x1.79ep+11, 0x1.7ap+11, 0x1.7a2p+11, 0x1.7a4p+11, 0x1.7a6p+11, 0x1.7a8p+11, 0x1.7aap+11, 0x1.7acp+11, 0x1.7aep+11, 0x1.7bp+11, 0x1.7b2p+11, 0x1.7b4p+11, 0x1.7b6p+11, 0x1.7b8p+11, 0x1.7bap+11, 0x1.7bcp+11, 0x1.7bep+11, 0x1.7cp+11, 0x1.7c2p+11, 0x1.7c4p+11, 0x1.7c6p+11, 0x1.7c8p+11, 0x1.7cap+11, 0x1.7ccp+11, 0x1.7cep+11, 0x1.7dp+11, 0x1.7d2p+11, 0x1.7d4p+11, 0x1.7d6p+11, 0x1.7d8p+11, 0x1.7dap+11, 0x1.7dcp+11, 0x1.7dep+11, 0x1.7ep+11, 0x1.7e2p+11, 0x1.7e4p+11, 0x1.7e6p+11, 0x1.7e8p+11, 0x1.7eap+11, 0x1.7ecp+11, 0x1.7eep+11, 0x1.7fp+11, 0x1.7f2p+11, 0x1.7f4p+11, 0x1.7f6p+11, 0x1.7f8p+11, 0x1.7fap+11, 0x1.7fcp+11, 0x1.7fep+11, 0x1.8p+11], [0x1.802p+11, 0x1.804p+11, 0x1.806p+11, 0x1.808p+11, 0x1.80ap+11, 0x1.80cp+11, 0x1.80ep+11, 0x1.81p+11, 0x1.812p+11, 0x1.814p+11, 0x1.816p+11, 0x1.818p+11, 0x1.81ap+11, 0x1.81cp+11, 0x1.81ep+11, 0x1.82p+11, 0x1.822p+11, 0x1.824p+11, 0x1.826p+11, 0x1.828p+11, 0x1.82ap+11, 0x1.82cp+11, 0x1.82ep+11, 0x1.83p+11, 0x1.832p+11, 0x1.834p+11, 0x1.836p+11, 0x1.838p+11, 0x1.83ap+11, 0x1.83cp+11, 0x1.83ep+11, 0x1.84p+11, 0x1.842p+11, 0x1.844p+11, 0x1.846p+11, 0x1.848p+11, 0x1.84ap+11, 0x1.84cp+11, 0x1.84ep+11, 0x1.85p+11, 0x1.852p+11, 0x1.854p+11, 0x1.856p+11, 0x1.858p+11, 0x1.85ap+11, 0x1.85cp+11, 0x1.85ep+11, 0x1.86p+11, 0x1.862p+11, 0x1.864p+11, 0x1.866p+11, 0x1.868p+11, 0x1.86ap+11, 0x1.86cp+11, 0x1.86ep+11, 0x1.87p+11, 0x1.872p+11, 0x1.874p+11, 0x1.876p+11, 0x1.878p+11, 0x1.87ap+11, 0x1.87cp+11, 0x1.87ep+11, 0x1.88p+11], [0x1.882p+11, 0x1.884p+11, 0x1.886p+11, 0x1.888p+11, 0x1.88ap+11, 0x1.88cp+11, 0x1.88ep+11, 0x1.89p+11, 0x1.892p+11, 0x1.894p+11, 0x1.896p+11, 0x1.898p+11, 0x1.89ap+11, 0x1.89cp+11, 0x1.89ep+11, 0x1.8ap+11, 0x1.8a2p+11, 0x1.8a4p+11, 0x1.8a6p+11, 0x1.8a8p+11, 0x1.8aap+11, 0x1.8acp+11, 0x1.8aep+11, 0x1.8bp+11, 0x1.8b2p+11, 0x1.8b4p+11, 0x1.8b6p+11, 0x1.8b8p+11, 0x1.8bap+11, 0x1.8bcp+11, 0x1.8bep+11, 0x1.8cp+11, 0x1.8c2p+11, 0x1.8c4p+11, 0x1.8c6p+11, 0x1.8c8p+11, 0x1.8cap+11, 0x1.8ccp+11, 0x1.8cep+11, 0x1.8dp+11, 0x1.8d2p+11, 0x1.8d4p+11, 0x1.8d6p+11, 0x1.8d8p+11, 0x1.8dap+11, 0x1.8dcp+11, 0x1.8dep+11, 0x1.8ep+11, 0x1.8e2p+11, 0x1.8e4p+11, 0x1.8e6p+11, 0x1.8e8p+11, 0x1.8eap+11, 0x1.8ecp+11, 0x1.8eep+11, 0x1.8fp+11, 0x1.8f2p+11, 0x1.8f4p+11, 0x1.8f6p+11, 0x1.8f8p+11, 0x1.8fap+11, 0x1.8fcp+11, 0x1.8fep+11, 0x1.9p+11], [0x1.902p+11, 0x1.904p+11, 0x1.906p+11, 0x1.908p+11, 0x1.90ap+11, 0x1.90cp+11, 0x1.90ep+11, 0x1.91p+11, 0x1.912p+11, 0x1.914p+11, 0x1.916p+11, 0x1.918p+11, 0x1.91ap+11, 0x1.91cp+11, 0x1.91ep+11, 0x1.92p+11, 0x1.922p+11, 0x1.924p+11, 0x1.926p+11, 0x1.928p+11, 0x1.92ap+11, 0x1.92cp+11, 0x1.92ep+11, 0x1.93p+11, 0x1.932p+11, 0x1.934p+11, 0x1.936p+11, 0x1.938p+11, 0x1.93ap+11, 0x1.93cp+11, 0x1.93ep+11, 0x1.94p+11, 0x1.942p+11, 0x1.944p+11, 0x1.946p+11, 0x1.948p+11, 0x1.94ap+11, 0x1.94cp+11, 0x1.94ep+11, 0x1.95p+11, 0x1.952p+11, 0x1.954p+11, 0x1.956p+11, 0x1.958p+11, 0x1.95ap+11, 0x1.95cp+11, 0x1.95ep+11, 0x1.96p+11, 0x1.962p+11, 0x1.964p+11, 0x1.966p+11, 0x1.968p+11, 0x1.96ap+11, 0x1.96cp+11, 0x1.96ep+11, 0x1.97p+11, 0x1.972p+11, 0x1.974p+11, 0x1.976p+11, 0x1.978p+11, 0x1.97ap+11, 0x1.97cp+11, 0x1.97ep+11, 0x1.98p+11], [0x1.982p+11, 0x1.984p+11, 0x1.986p+11, 0x1.988p+11, 0x1.98ap+11, 0x1.98cp+11, 0x1.98ep+11, 0x1.99p+11, 0x1.992p+11, 0x1.994p+11, 0x1.996p+11, 0x1.998p+11, 0x1.99ap+11, 0x1.99cp+11, 0x1.99ep+11, 0x1.9ap+11, 0x1.9a2p+11, 0x1.9a4p+11, 0x1.9a6p+11, 0x1.9a8p+11, 0x1.9aap+11, 0x1.9acp+11, 0x1.9aep+11, 0x1.9bp+11, 0x1.9b2p+11, 0x1.9b4p+11, 0x1.9b6p+11, 0x1.9b8p+11, 0x1.9bap+11, 0x1.9bcp+11, 0x1.9bep+11, 0x1.9cp+11, 0x1.9c2p+11, 0x1.9c4p+11, 0x1.9c6p+11, 0x1.9c8p+11, 0x1.9cap+11, 0x1.9ccp+11, 0x1.9cep+11, 0x1.9dp+11, 0x1.9d2p+11, 0x1.9d4p+11, 0x1.9d6p+11, 0x1.9d8p+11, 0x1.9dap+11, 0x1.9dcp+11, 0x1.9dep+11, 0x1.9ep+11, 0x1.9e2p+11, 0x1.9e4p+11, 0x1.9e6p+11, 0x1.9e8p+11, 0x1.9eap+11, 0x1.9ecp+11, 0x1.9eep+11, 0x1.9fp+11, 0x1.9f2p+11, 0x1.9f4p+11, 0x1.9f6p+11, 0x1.9f8p+11, 0x1.9fap+11, 0x1.9fcp+11, 0x1.9fep+11, 0x1.ap+11], [0x1.a02p+11, 0x1.a04p+11, 0x1.a06p+11, 0x1.a08p+11, 0x1.a0ap+11, 0x1.a0cp+11, 0x1.a0ep+11, 0x1.a1p+11, 0x1.a12p+11, 0x1.a14p+11, 0x1.a16p+11, 0x1.a18p+11, 0x1.a1ap+11, 0x1.a1cp+11, 0x1.a1ep+11, 0x1.a2p+11, 0x1.a22p+11, 0x1.a24p+11, 0x1.a26p+11, 0x1.a28p+11, 0x1.a2ap+11, 0x1.a2cp+11, 0x1.a2ep+11, 0x1.a3p+11, 0x1.a32p+11, 0x1.a34p+11, 0x1.a36p+11, 0x1.a38p+11, 0x1.a3ap+11, 0x1.a3cp+11, 0x1.a3ep+11, 0x1.a4p+11, 0x1.a42p+11, 0x1.a44p+11, 0x1.a46p+11, 0x1.a48p+11, 0x1.a4ap+11, 0x1.a4cp+11, 0x1.a4ep+11, 0x1.a5p+11, 0x1.a52p+11, 0x1.a54p+11, 0x1.a56p+11, 0x1.a58p+11, 0x1.a5ap+11, 0x1.a5cp+11, 0x1.a5ep+11, 0x1.a6p+11, 0x1.a62p+11, 0x1.a64p+11, 0x1.a66p+11, 0x1.a68p+11, 0x1.a6ap+11, 0x1.a6cp+11, 0x1.a6ep+11, 0x1.a7p+11, 0x1.a72p+11, 0x1.a74p+11, 0x1.a76p+11, 0x1.a78p+11, 0x1.a7ap+11, 0x1.a7cp+11, 0x1.a7ep+11, 0x1.a8p+11], [0x1.a82p+11, 0x1.a84p+11, 0x1.a86p+11, 0x1.a88p+11, 0x1.a8ap+11, 0x1.a8cp+11, 0x1.a8ep+11, 0x1.a9p+11, 0x1.a92p+11, 0x1.a94p+11, 0x1.a96p+11, 0x1.a98p+11, 0x1.a9ap+11, 0x1.a9cp+11, 0x1.a9ep+11, 0x1.aap+11, 0x1.aa2p+11, 0x1.aa4p+11, 0x1.aa6p+11, 0x1.aa8p+11, 0x1.aaap+11, 0x1.aacp+11, 0x1.aaep+11, 0x1.abp+11, 0x1.ab2p+11, 0x1.ab4p+11, 0x1.ab6p+11, 0x1.ab8p+11, 0x1.abap+11, 0x1.abcp+11, 0x1.abep+11, 0x1.acp+11, 0x1.ac2p+11, 0x1.ac4p+11, 0x1.ac6p+11, 0x1.ac8p+11, 0x1.acap+11, 0x1.accp+11, 0x1.acep+11, 0x1.adp+11, 0x1.ad2p+11, 0x1.ad4p+11, 0x1.ad6p+11, 0x1.ad8p+11, 0x1.adap+11, 0x1.adcp+11, 0x1.adep+11, 0x1.aep+11, 0x1.ae2p+11, 0x1.ae4p+11, 0x1.ae6p+11, 0x1.ae8p+11, 0x1.aeap+11, 0x1.aecp+11, 0x1.aeep+11, 0x1.afp+11, 0x1.af2p+11, 0x1.af4p+11, 0x1.af6p+11, 0x1.af8p+11, 0x1.afap+11, 0x1.afcp+11, 0x1.afep+11, 0x1.bp+11], [0x1.b02p+11, 0x1.b04p+11, 0x1.b06p+11, 0x1.b08p+11, 0x1.b0ap+11, 0x1.b0cp+11, 0x1.b0ep+11, 0x1.b1p+11, 0x1.b12p+11, 0x1.b14p+11, 0x1.b16p+11, 0x1.b18p+11, 0x1.b1ap+11, 0x1.b1cp+11, 0x1.b1ep+11, 0x1.b2p+11, 0x1.b22p+11, 0x1.b24p+11, 0x1.b26p+11, 0x1.b28p+11, 0x1.b2ap+11, 0x1.b2cp+11, 0x1.b2ep+11, 0x1.b3p+11, 0x1.b32p+11, 0x1.b34p+11, 0x1.b36p+11, 0x1.b38p+11, 0x1.b3ap+11, 0x1.b3cp+11, 0x1.b3ep+11, 0x1.b4p+11, 0x1.b42p+11, 0x1.b44p+11, 0x1.b46p+11, 0x1.b48p+11, 0x1.b4ap+11, 0x1.b4cp+11, 0x1.b4ep+11, 0x1.b5p+11, 0x1.b52p+11, 0x1.b54p+11, 0x1.b56p+11, 0x1.b58p+11, 0x1.b5ap+11, 0x1.b5cp+11, 0x1.b5ep+11, 0x1.b6p+11, 0x1.b62p+11, 0x1.b64p+11, 0x1.b66p+11, 0x1.b68p+11, 0x1.b6ap+11, 0x1.b6cp+11, 0x1.b6ep+11, 0x1.b7p+11, 0x1.b72p+11, 0x1.b74p+11, 0x1.b76p+11, 0x1.b78p+11, 0x1.b7ap+11, 0x1.b7cp+11, 0x1.b7ep+11, 0x1.b8p+11], [0x1.b82p+11, 0x1.b84p+11, 0x1.b86p+11, 0x1.b88p+11, 0x1.b8ap+11, 0x1.b8cp+11, 0x1.b8ep+11, 0x1.b9p+11, 0x1.b92p+11, 0x1.b94p+11, 0x1.b96p+11, 0x1.b98p+11, 0x1.b9ap+11, 0x1.b9cp+11, 0x1.b9ep+11, 0x1.bap+11, 0x1.ba2p+11, 0x1.ba4p+11, 0x1.ba6p+11, 0x1.ba8p+11, 0x1.baap+11, 0x1.bacp+11, 0x1.baep+11, 0x1.bbp+11, 0x1.bb2p+11, 0x1.bb4p+11, 0x1.bb6p+11, 0x1.bb8p+11, 0x1.bbap+11, 0x1.bbcp+11, 0x1.bbep+11, 0x1.bcp+11, 0x1.bc2p+11, 0x1.bc4p+11, 0x1.bc6p+11, 0x1.bc8p+11, 0x1.bcap+11, 0x1.bccp+11, 0x1.bcep+11, 0x1.bdp+11, 0x1.bd2p+11, 0x1.bd4p+11, 0x1.bd6p+11, 0x1.bd8p+11, 0x1.bdap+11, 0x1.bdcp+11, 0x1.bdep+11, 0x1.bep+11, 0x1.be2p+11, 0x1.be4p+11, 0x1.be6p+11, 0x1.be8p+11, 0x1.beap+11, 0x1.becp+11, 0x1.beep+11, 0x1.bfp+11, 0x1.bf2p+11, 0x1.bf4p+11, 0x1.bf6p+11, 0x1.bf8p+11, 0x1.bfap+11, 0x1.bfcp+11, 0x1.bfep+11, 0x1.cp+11], [0x1.c02p+11, 0x1.c04p+11, 0x1.c06p+11, 0x1.c08p+11, 0x1.c0ap+11, 0x1.c0cp+11, 0x1.c0ep+11, 0x1.c1p+11, 0x1.c12p+11, 0x1.c14p+11, 0x1.c16p+11, 0x1.c18p+11, 0x1.c1ap+11, 0x1.c1cp+11, 0x1.c1ep+11, 0x1.c2p+11, 0x1.c22p+11, 0x1.c24p+11, 0x1.c26p+11, 0x1.c28p+11, 0x1.c2ap+11, 0x1.c2cp+11, 0x1.c2ep+11, 0x1.c3p+11, 0x1.c32p+11, 0x1.c34p+11, 0x1.c36p+11, 0x1.c38p+11, 0x1.c3ap+11, 0x1.c3cp+11, 0x1.c3ep+11, 0x1.c4p+11, 0x1.c42p+11, 0x1.c44p+11, 0x1.c46p+11, 0x1.c48p+11, 0x1.c4ap+11, 0x1.c4cp+11, 0x1.c4ep+11, 0x1.c5p+11, 0x1.c52p+11, 0x1.c54p+11, 0x1.c56p+11, 0x1.c58p+11, 0x1.c5ap+11, 0x1.c5cp+11, 0x1.c5ep+11, 0x1.c6p+11, 0x1.c62p+11, 0x1.c64p+11, 0x1.c66p+11, 0x1.c68p+11, 0x1.c6ap+11, 0x1.c6cp+11, 0x1.c6ep+11, 0x1.c7p+11, 0x1.c72p+11, 0x1.c74p+11, 0x1.c76p+11, 0x1.c78p+11, 0x1.c7ap+11, 0x1.c7cp+11, 0x1.c7ep+11, 0x1.c8p+11], [0x1.c82p+11, 0x1.c84p+11, 0x1.c86p+11, 0x1.c88p+11, 0x1.c8ap+11, 0x1.c8cp+11, 0x1.c8ep+11, 0x1.c9p+11, 0x1.c92p+11, 0x1.c94p+11, 0x1.c96p+11, 0x1.c98p+11, 0x1.c9ap+11, 0x1.c9cp+11, 0x1.c9ep+11, 0x1.cap+11, 0x1.ca2p+11, 0x1.ca4p+11, 0x1.ca6p+11, 0x1.ca8p+11, 0x1.caap+11, 0x1.cacp+11, 0x1.caep+11, 0x1.cbp+11, 0x1.cb2p+11, 0x1.cb4p+11, 0x1.cb6p+11, 0x1.cb8p+11, 0x1.cbap+11, 0x1.cbcp+11, 0x1.cbep+11, 0x1.ccp+11, 0x1.cc2p+11, 0x1.cc4p+11, 0x1.cc6p+11, 0x1.cc8p+11, 0x1.ccap+11, 0x1.cccp+11, 0x1.ccep+11, 0x1.cdp+11, 0x1.cd2p+11, 0x1.cd4p+11, 0x1.cd6p+11, 0x1.cd8p+11, 0x1.cdap+11, 0x1.cdcp+11, 0x1.cdep+11, 0x1.cep+11, 0x1.ce2p+11, 0x1.ce4p+11, 0x1.ce6p+11, 0x1.ce8p+11, 0x1.ceap+11, 0x1.cecp+11, 0x1.ceep+11, 0x1.cfp+11, 0x1.cf2p+11, 0x1.cf4p+11, 0x1.cf6p+11, 0x1.cf8p+11, 0x1.cfap+11, 0x1.cfcp+11, 0x1.cfep+11, 0x1.dp+11], [0x1.d02p+11, 0x1.d04p+11, 0x1.d06p+11, 0x1.d08p+11, 0x1.d0ap+11, 0x1.d0cp+11, 0x1.d0ep+11, 0x1.d1p+11, 0x1.d12p+11, 0x1.d14p+11, 0x1.d16p+11, 0x1.d18p+11, 0x1.d1ap+11, 0x1.d1cp+11, 0x1.d1ep+11, 0x1.d2p+11, 0x1.d22p+11, 0x1.d24p+11, 0x1.d26p+11, 0x1.d28p+11, 0x1.d2ap+11, 0x1.d2cp+11, 0x1.d2ep+11, 0x1.d3p+11, 0x1.d32p+11, 0x1.d34p+11, 0x1.d36p+11, 0x1.d38p+11, 0x1.d3ap+11, 0x1.d3cp+11, 0x1.d3ep+11, 0x1.d4p+11, 0x1.d42p+11, 0x1.d44p+11, 0x1.d46p+11, 0x1.d48p+11, 0x1.d4ap+11, 0x1.d4cp+11, 0x1.d4ep+11, 0x1.d5p+11, 0x1.d52p+11, 0x1.d54p+11, 0x1.d56p+11, 0x1.d58p+11, 0x1.d5ap+11, 0x1.d5cp+11, 0x1.d5ep+11, 0x1.d6p+11, 0x1.d62p+11, 0x1.d64p+11, 0x1.d66p+11, 0x1.d68p+11, 0x1.d6ap+11, 0x1.d6cp+11, 0x1.d6ep+11, 0x1.d7p+11, 0x1.d72p+11, 0x1.d74p+11, 0x1.d76p+11, 0x1.d78p+11, 0x1.d7ap+11, 0x1.d7cp+11, 0x1.d7ep+11, 0x1.d8p+11], [0x1.d82p+11, 0x1.d84p+11, 0x1.d86p+11, 0x1.d88p+11, 0x1.d8ap+11, 0x1.d8cp+11, 0x1.d8ep+11, 0x1.d9p+11, 0x1.d92p+11, 0x1.d94p+11, 0x1.d96p+11, 0x1.d98p+11, 0x1.d9ap+11, 0x1.d9cp+11, 0x1.d9ep+11, 0x1.dap+11, 0x1.da2p+11, 0x1.da4p+11, 0x1.da6p+11, 0x1.da8p+11, 0x1.daap+11, 0x1.dacp+11, 0x1.daep+11, 0x1.dbp+11, 0x1.db2p+11, 0x1.db4p+11, 0x1.db6p+11, 0x1.db8p+11, 0x1.dbap+11, 0x1.dbcp+11, 0x1.dbep+11, 0x1.dcp+11, 0x1.dc2p+11, 0x1.dc4p+11, 0x1.dc6p+11, 0x1.dc8p+11, 0x1.dcap+11, 0x1.dccp+11, 0x1.dcep+11, 0x1.ddp+11, 0x1.dd2p+11, 0x1.dd4p+11, 0x1.dd6p+11, 0x1.dd8p+11, 0x1.ddap+11, 0x1.ddcp+11, 0x1.ddep+11, 0x1.dep+11, 0x1.de2p+11, 0x1.de4p+11, 0x1.de6p+11, 0x1.de8p+11, 0x1.deap+11, 0x1.decp+11, 0x1.deep+11, 0x1.dfp+11, 0x1.df2p+11, 0x1.df4p+11, 0x1.df6p+11, 0x1.df8p+11, 0x1.dfap+11, 0x1.dfcp+11, 0x1.dfep+11, 0x1.ep+11], [0x1.e02p+11, 0x1.e04p+11, 0x1.e06p+11, 0x1.e08p+11, 0x1.e0ap+11, 0x1.e0cp+11, 0x1.e0ep+11, 0x1.e1p+11, 0x1.e12p+11, 0x1.e14p+11, 0x1.e16p+11, 0x1.e18p+11, 0x1.e1ap+11, 0x1.e1cp+11, 0x1.e1ep+11, 0x1.e2p+11, 0x1.e22p+11, 0x1.e24p+11, 0x1.e26p+11, 0x1.e28p+11, 0x1.e2ap+11, 0x1.e2cp+11, 0x1.e2ep+11, 0x1.e3p+11, 0x1.e32p+11, 0x1.e34p+11, 0x1.e36p+11, 0x1.e38p+11, 0x1.e3ap+11, 0x1.e3cp+11, 0x1.e3ep+11, 0x1.e4p+11, 0x1.e42p+11, 0x1.e44p+11, 0x1.e46p+11, 0x1.e48p+11, 0x1.e4ap+11, 0x1.e4cp+11, 0x1.e4ep+11, 0x1.e5p+11, 0x1.e52p+11, 0x1.e54p+11, 0x1.e56p+11, 0x1.e58p+11, 0x1.e5ap+11, 0x1.e5cp+11, 0x1.e5ep+11, 0x1.e6p+11, 0x1.e62p+11, 0x1.e64p+11, 0x1.e66p+11, 0x1.e68p+11, 0x1.e6ap+11, 0x1.e6cp+11, 0x1.e6ep+11, 0x1.e7p+11, 0x1.e72p+11, 0x1.e74p+11, 0x1.e76p+11, 0x1.e78p+11, 0x1.e7ap+11, 0x1.e7cp+11, 0x1.e7ep+11, 0x1.e8p+11], [0x1.e82p+11, 0x1.e84p+11, 0x1.e86p+11, 0x1.e88p+11, 0x1.e8ap+11, 0x1.e8cp+11, 0x1.e8ep+11, 0x1.e9p+11, 0x1.e92p+11, 0x1.e94p+11, 0x1.e96p+11, 0x1.e98p+11, 0x1.e9ap+11, 0x1.e9cp+11, 0x1.e9ep+11, 0x1.eap+11, 0x1.ea2p+11, 0x1.ea4p+11, 0x1.ea6p+11, 0x1.ea8p+11, 0x1.eaap+11, 0x1.eacp+11, 0x1.eaep+11, 0x1.ebp+11, 0x1.eb2p+11, 0x1.eb4p+11, 0x1.eb6p+11, 0x1.eb8p+11, 0x1.ebap+11, 0x1.ebcp+11, 0x1.ebep+11, 0x1.ecp+11, 0x1.ec2p+11, 0x1.ec4p+11, 0x1.ec6p+11, 0x1.ec8p+11, 0x1.ecap+11, 0x1.eccp+11, 0x1.ecep+11, 0x1.edp+11, 0x1.ed2p+11, 0x1.ed4p+11, 0x1.ed6p+11, 0x1.ed8p+11, 0x1.edap+11, 0x1.edcp+11, 0x1.edep+11, 0x1.eep+11, 0x1.ee2p+11, 0x1.ee4p+11, 0x1.ee6p+11, 0x1.ee8p+11, 0x1.eeap+11, 0x1.eecp+11, 0x1.eeep+11, 0x1.efp+11, 0x1.ef2p+11, 0x1.ef4p+11, 0x1.ef6p+11, 0x1.ef8p+11, 0x1.efap+11, 0x1.efcp+11, 0x1.efep+11, 0x1.fp+11], [0x1.f02p+11, 0x1.f04p+11, 0x1.f06p+11, 0x1.f08p+11, 0x1.f0ap+11, 0x1.f0cp+11, 0x1.f0ep+11, 0x1.f1p+11, 0x1.f12p+11, 0x1.f14p+11, 0x1.f16p+11, 0x1.f18p+11, 0x1.f1ap+11, 0x1.f1cp+11, 0x1.f1ep+11, 0x1.f2p+11, 0x1.f22p+11, 0x1.f24p+11, 0x1.f26p+11, 0x1.f28p+11, 0x1.f2ap+11, 0x1.f2cp+11, 0x1.f2ep+11, 0x1.f3p+11, 0x1.f32p+11, 0x1.f34p+11, 0x1.f36p+11, 0x1.f38p+11, 0x1.f3ap+11, 0x1.f3cp+11, 0x1.f3ep+11, 0x1.f4p+11, 0x1.f42p+11, 0x1.f44p+11, 0x1.f46p+11, 0x1.f48p+11, 