program(1.3)
[buildInfo = dict<string, string>({{"coremlc-component-MIL", "3510.2.1"}, {"coremlc-version", "3500.32.1"}})]
{
    func main<ios19>(tensor<fp32, [1, 4]> x) {
            tensor<fp32, [4, 4]> dummy_0_0 = const()[name = string("dummy_0_0"), val = tensor<fp32, [4, 4]>([[-0x1.0bc6dp-1, 0x1.c2d9b4p+0, 0x1.67487ep+0, -0x1.6e05fcp+0], [-0x1.3b8d1ep-1, 0x1.4317c4p-1, 0x1.3d2584p-2, -0x1.24efe6p+0], [-0x1.07c70cp+0, -0x1.074ac6p+1, 0x1.21e36ap-1, 0x1.9ce94ep-1], [0x1.ef3394p+0, -0x1.f0d7bcp-2, 0x1.286ad2p-1, 0x1.3af088p+0]])];
            tensor<fp32, [4, 4]> dummy_1_1 = const()[name = string("dummy_1_1"), val = tensor<fp32, [4, 4]>([[0x1.eae336p-1, -0x1.90c2f4p-1, 0x1.969a12p+0, -0x1.8233d6p+0], [0x1.270704p+0, 0x1.7cc554p-2, -0x1.f2263cp+0, 0x1.e719aep+0], [0x1.015912p-1, 0x1.2c18e6p+0, 0x1.0c993ep+0, 0x1.89fe46p+0], [0x1.97c1f2p-1, 0x1.d59904p-2, 0x1.ffa542p+0, -0x1.62cd9ep-1]])];
            tensor<fp32, [4, 4]> dummy_2_2 = const()[name = string("dummy_2_2"), val = tensor<fp32, [4, 4]>([[-0x1.dabc5ap+0, 0x1.efccap-1, 0x1.c5eba6p+0, -0x1.9661b4p+0], [-0x1.5fae64p+0, 0x1.cd6c82p-4, 0x1.7ed1fp-4, 0x1.4f409p-1], [0x1.04900ep+1, 0x1.b4463p-4, 0x1.8840cap+0, -0x1.02fd8ap+1], [-0x1.5dc68p-2, 0x1.670272p+0, -0x1.c0dbbep-1, 0x1.adc4d4p+0]])];
            tensor<fp32, [4, 4]> dummy_3_3 = const()[name = string("dummy_3_3"), val = tensor<fp32, [4, 4]>([[-0x1.7d9d62p-2, -0x1.9354dep+0, 0x1.f53d3ap+0, -0x1.aa8f8ep+0], [0x1.947cbep-2, -0x1.2c1e24p-3, 0x1.11003ep+1, -0x1.2fb23cp-1], [-0x1.73de8ep-1, -0x1.eb2042p-1, 0x1.01f42ap+1, -0x1.4a7176p+0], [-0x1.7ac43ap+0, -0x1.f2e458p+0, 0x1.1603f4p-1, -0x1.f49418p-3]])];
            tensor<fp32, [4, 4]> dummy_4_4 = const()[name = string("dummy_4_4"), val = tensor<fp32, [4, 4]>([[0x1.1bedaap+0, 0x1.67975ep-3, 0x1.124768p+1, -0x1.bebd6ap+0], [-0x1.10cb1ap+1, -0x1.9f7946p-2, -0x1.f6f232p-4, -0x1.d75284p+0], [0x1.9d089cp-1, -0x1.033252p+1, -0x1.cbf318p+0, -0x1.1dcfb2p-1], [0x1.ad6c24p+0, -0x1.014826p+0, 0x1.f671d2p+0, 0x1.104c9p+1]])];
            tensor<fp32, [4, 1]> w_5 = const()[name = string("w_5"), val = tensor<fp32, [4, 1]>([[-0x1.0bc6dp-1], [0x1.c2d9b4p+0], [0x1.67487ep+0], [-0x1.6e05fcp+0]])];
            tensor<fp32, [1, 1]> matmul_6 = matmul(transpose_x = bool(false), transpose_y = bool(false), x = x, y = w_5)[name = string("matmul_6")];
        } -> (matmul_6);
}