program(1.3)
[buildInfo = dict<string, string>({{"coremlc-component-MIL", "3510.2.1"}, {"coremlc-version", "3500.32.1"}})]
{
    func main<ios19>(tensor<fp32, [1, 64]> x) {
            tensor<fp32, [64, 2]> wa_0 = const()[name = string("wa_0"), val = tensor<fp32, [64, 2]>([[0x1p+0, 0x1p+1], [0x1.8p+1, 0x1p+2], [0x1.4p+2, 0x1.8p+2], [0x1.cp+2, 0x1p+3], [0x1.2p+3, 0x1.4p+3], [0x1.6p+3, 0x1.8p+3], [0x1.ap+3, 0x1.cp+3], [0x1.ep+3, 0x1p+4], [0x1.1p+4, 0x1.2p+4], [0x1.3p+4, 0x1.4p+4], [0x1.5p+4, 0x1.6p+4], [0x1.7p+4, 0x1.8p+4], [0x1.9p+4, 0x1.ap+4], [0x1.bp+4, 0x1.cp+4], [0x1.dp+4, 0x1.ep+4], [0x1.fp+4, 0x1p+5], [0x1.08p+5, 0x1.1p+5], [0x1.18p+5, 0x1.2p+5], [0x1.28p+5, 0x1.3p+5], [0x1.38p+5, 0x1.4p+5], [0x1.48p+5, 0x1.5p+5], [0x1.58p+5, 0x1.6p+5], [0x1.68p+5, 0x1.7p+5], [0x1.78p+5, 0x1.8p+5], [0x1.88p+5, 0x1.9p+5], [0x1.98p+5, 0x1.ap+5], [0x1.a8p+5, 0x1.bp+5], [0x1.b8p+5, 0x1.cp+5], [0x1.c8p+5, 0x1.dp+5], [0x1.d8p+5, 0x1.ep+5], [0x1.e8p+5, 0x1.fp+5], [0x1.f8p+5, 0x1p+6], [0x1.04p+6, 0x1.08p+6], [0x1.0cp+6, 0x1.1p+6], [0x1.14p+6, 0x1.18p+6], [0x1.1cp+6, 0x1.2p+6], [0x1.24p+6, 0x1.28p+6], [0x1.2cp+6, 0x1.3p+6], [0x1.34p+6, 0x1.38p+6], [0x1.3cp+6, 0x1.4p+6], [0x1.44p+6, 0x1.48p+6], [0x1.4cp+6, 0x1.5p+6], [0x1.54p+6, 0x1.58p+6], [0x1.5cp+6, 0x1.6p+6], [0x1.64p+6, 0x1.68p+6], [0x1.6cp+6, 0x1.7p+6], [0x1.74p+6, 0x1.78p+6], [0x1.7cp+6, 0x1.8p+6], [0x1.84p+6, 0x1.88p+6], [0x1.8cp+6, 0x1.9p+6], [0x1.94p+6, 0x1.98p+6], [0x1.9cp+6, 0x1.ap+6], [0x1.a4p+6, 0x1.a8p+6], [0x1.acp+6, 0x1.bp+6], [0x1.b4p+6, 0x1.b8p+6], [0x1.bcp+6, 0x1.cp+6], [0x1.c4p+6, 0x1.c8p+6], [0x1.ccp+6, 0x1.dp+6], [0x1.d4p+6, 0x1.d8p+6], [0x1.dcp+6, 0x1.ep+6], [0x1.e4p+6, 0x1.e8p+6], [0x1.ecp+6, 0x1.fp+6], [0x1.f4p+6, 0x1.f8p+6], [0x1.fcp+6, 0x1p+7]])];
            tensor<fp32, [64, 2]> wb_1 = const()[name = string("wb_1"), val = tensor<fp32, [64, 2]>([[0x1.4p+2, 0x1.8p+2], [0x1.cp+2, 0x1p+3], [0x1.2p+3, 0x1.4p+3], [0x1.6p+3, 0x1.8p+3], [0x1.ap+3, 0x1.cp+3], [0x1.ep+3, 0x1p+4], [0x1.1p+4, 0x1.2p+4], [0x1.3p+4, 0x1.4p+4], [0x1.5p+4, 0x1.6p+4], [0x1.7p+4, 0x1.8p+4], [0x1.9p+4, 0x1.ap+4], [0x1.bp+4, 0x1.cp+4], [0x1.dp+4, 0x1.ep+4], [0x1.fp+4, 0x1p+5], [0x1.08p+5, 0x1.1p+5], [0x1.18p+5, 0x1.2p+5], [0x1.28p+5, 0x1.3p+5], [0x1.38p+5, 0x1.4p+5], [0x1.48p+5, 0x1.5p+5], [0x1.58p+5, 0x1.6p+5], [0x1.68p+5, 0x1.7p+5], [0x1.78p+5, 0x1.8p+5], [0x1.88p+5, 0x1.9p+5], [0x1.98p+5, 0x1.ap+5], [0x1.a8p+5, 0x1.bp+5], [0x1.b8p+5, 0x1.cp+5], [0x1.c8p+5, 0x1.dp+5], [0x1.d8p+5, 0x1.ep+5], [0x1.e8p+5, 0x1.fp+5], [0x1.f8p+5, 0x1p+6], [0x1.04p+6, 0x1.08p+6], [0x1.0cp+6, 0x1.1p+6], [0x1.14p+6, 0x1.18p+6], [0x1.1cp+6, 0x1.2p+6], [0x1.24p+6, 0x1.28p+6], [0x1.2cp+6, 0x1.3p+6], [0x1.34p+6, 0x1.38p+6], [0x1.3cp+6, 0x1.4p+6], [0x1.44p+6, 0x1.48p+6], [0x1.4cp+6, 0x1.5p+6], [0x1.54p+6, 0x1.58p+6], [0x1.5cp+6, 0x1.6p+6], [0x1.64p+6, 0x1.68p+6], [0x1.6cp+6, 0x1.7p+6], [0x1.74p+6, 0x1.78p+6], [0x1.7cp+6, 0x1.8p+6], [0x1.84p+6, 0x1.88p+6], [0x1.8cp+6, 0x1.9p+6], [0x1.94p+6, 0x1.98p+6], [0x1.9cp+6, 0x1.ap+6], [0x1.a4p+6, 0x1.a8p+6], [0x1.acp+6, 0x1.bp+6], [0x1.b4p+6, 0x1.b8p+6], [0x1.bcp+6, 0x1.cp+6], [0x1.c4p+6, 0x1.c8p+6], [0x1.ccp+6, 0x1.dp+6], [0x1.d4p+6, 0x1.d8p+6], [0x1.dcp+6, 0x1.ep+6], [0x1.e4p+6, 0x1.e8p+6], [0x1.ecp+6, 0x1.fp+6], [0x1.f4p+6, 0x1.f8p+6], [0x1.fcp+6, 0x1p+7], [0x1.02p+7, 0x1.04p+7], [0x1.06p+7, 0x1.08p+7]])];
            tensor<fp32, [1, 1]> matmul_2 = matmul(transpose_x = bool(false), transpose_y = bool(false), x = x, y = wa_0)[name = string("matmul_2")];
            tensor<fp32, [1, 1]> matmul_3 = matmul(transpose_x = bool(false), transpose_y = bool(false), x = x, y = wb_1)[name = string("matmul_3")];
            tensor<fp32, [1, 1]> add_4 = add(x = matmul_2, y = matmul_3)[name = string("add_4")];
        } -> (add_4);
}