program(1.3)
[buildInfo = dict<string, string>({{"coremlc-component-MIL", "3510.2.1"}, {"coremlc-version", "3500.32.1"}})]
{
    func main<ios19>(tensor<fp32, [1, 128]> x) {
            tensor<fp32, [128, 128]> w_0 = const()[name = string("w_0"), val = tensor<fp32, [128, 128]>([[0x1.d6d66p+0, 0x1.6e17bp+0, -0x1.c79d12p-2, -0x1.4876d2p-1, -0x1.1fc266p+0, -0x1.126d96p+0, 0x1.6416acp+0, -0x1.8cbad8p+0, 0x1.a38212p-1, 0x1.58d7eep-7, 0x1.fa50acp-6, 0x1.090d36p+1, 0x1.b792acp-2, -0x1.5549ep+0, -0x1.774044p-1, -0x1.0334fp+0, -0x1.442a4cp-1, -0x1.c0fd6ap-2, -0x1.102bep+1, 0x1.aab4acp-1, 0x1.53eee6p-1, -0x1.71c5d4p+0, 0x1.1b0a42p+0, 0x1.5a1b54p-1, -0x1.e49daap+0, -0x1.1072bep+1, -0x1.d42de4p+0, 0x1.6f89e6p-3, -0x1.16384ap+0, 0x1.96217ap-1, 0x1.3a7edap-3, -0x1.710754p+0, 0x1.09d268p+1, 0x1.f05292p-1, -0x1.8bc0cep+0, 0x1.9a68ep+0, -0x1.bfafc2p-2, -0x1.4dcfe6p+0, -0x1.9e9878p-1, 0x1.12947cp+1, 0x1.caf76p+0, -0x1.58713ep-1, -0x1.006182p+1, 0x1.2585c8p-1, -0x1.dba1ccp+0, 0x1.8b0472p-2, -0x1.80e078p+0, 0x1.4b803p+0, -0x1.1a198ep+0, 0x1.9f6c22p-1, -0x1.c7b8aep+0, -0x1.da96a6p-2, 0x1.bb6808p-2, 0x1.3000fap-2, 0x1.7ae032p+0, 0x1.1361b6p+0, -0x1.7b6394p-2, 0x1.e38f0cp+0, 0x1.044656p+1, -0x1.da6a32p-2, 0x1.8b3a92p-1, 0x1.038ce4p+0, 0x1.2d3b2cp-1, -0x1.e287cep+0, -0x1.0c2404p-1, -0x1.a407aep+0, 0x1.0c2934p+0, 0x1.8f57c2p+0, -0x1.736bbap-2, 0x1.efd22ap+0, 0x1.ae7648p+0, -0x1.626d6ep+0, 0x1.2bd7c6p-2, -0x1.c106f2p+0, -0x1.fcabd4p+0, -0x1.55bab2p+0, 0x1.cfecc2p+0, 0x1.689dbp+0, 0x1.fc21fap+0, -0x1.3a5f9p-2, 0x1.7412ap+0, -0x1.f9306ap+0, 0x1.51205ap+0, -0x1.7123fep+0, 0x1.47df74p-1, -0x1.6be11p+0, 0x1.f50e7p+0, 0x1.fc5ba4p+0, 0x1.c6e42ep-1, 0x1.8aecb4p-7, 0x1.5e7d1p-2, -0x1.828d9ep+0, -0x1.974e86p+0, -0x1.db7e62p-5, -0x1.9a8cf2p+0, -0x1.10d102p+1, 0x1.4a8878p-1, -0x1.436618p+0, -0x1.c04e92p-1, 0x1.4dc82cp-1, 0x1.7177ap-1, 0x1.d7ed8p+0, -0x1.b502c2p-2, 0x1.50cf8ap+0, 0x1.870ee8p-1, -0x1.622cdep-2, 0x1.474cc6p-1, 0x1.712e64p+0, 0x1.1be184p+0, -0x1.caaf64p-3, 0x1.e2ae7ap+0, -0x1.c45154p+0, 0x1.884b12p+0, 0x1.7ca724p+0, -0x1.ef275ap+0, -0x1.bafd68p-3, -0x1.6c3e84p-4, 0x1.835e1cp-4, -0x1.cbd47ap-1, -0x1.101cecp+0, 0x1.0ea07cp-1, -0x1.105ad8p-1, 0x1.e2c3fp+0, 0x1.b9bc36p-1, -0x1.159c64p-2, -0x1.26997ep-1, -0x1.7cd218p+0, 0x1.0c8ce6p+1], [-0x1.7cd4f4p+0, -0x1.4916a4p-1, 0x1.053604p+0, -0x1.10bfa8p+0, 0x1.12d8eap-1, 0x1.77dacp+0, 0x1.c9c452p-2, -0x1.ed88dp-2, 0x1.0c2eeap+0, -0x1.677b6ep+0, -0x1.8d5d1cp-2, 0x1.c7abb4p+0, -0x1.3647eap-1, 0x1.ac0cc8p+0, 0x1.0df4a2p+0, -0x1.8cbca6p+0, -0x1.8d20dp-1, 0x1.49bb2ep-1, 0x1.c2ab0ep-1, 0x1.96a2f2p-1, 0x1.992202p-1, 0x1.26453cp-2, -0x1.b3c0e4p+0, 0x1.bfd12cp+0, -0x1.abb728p+0, 0x1.4383e8p-2, -0x1.82d6b6p-1, 0x1.c16508p+0, 0x1.3ac882p+0, 0x1.c91ad8p-3, -0x1.8a6f28p-4, 0x1.5aa772p-1, -0x1.29630ap+0, 0x1.a16deap-2, -0x1.5c69fp+0, -0x1.8cf466p+0, -0x1.e72922p-1, -0x1.1b113ep+0, -0x1.b60174p-4, 0x1.3afc22p-1, 0x1.b84a34p+0, 0x1.38d208p+0, -0x1.bef3aep-2, 0x1.2686eep+0, -0x1.0a4b2p-1, -0x1.1dce4ep+0, 0x1.9f6dbp-1, 0x1.18cd8ep+0, -0x1.92ead8p-2, -0x1.0ccccep-1, -0x1.96eab4p+0, -0x1.57c8ep+0, 0x1.f93d52p+0, -0x1.77ba58p-4, -0x1.32e0ecp+0, -0x1.4cc326p-2, -0x1.1100b4p+0, 0x1.b9afdp-5, -0x1.7b63cap-3, -0x1.43c4fcp+0, -0x1.d5156ap+0, -0x1.06ce58p+0, -0x1.0107fcp+1, 0x1.036f1cp+1, -0x1.88bd28p-4, -0x1.aee628p+0, -0x1.0bebe6p+1, -0x1.74bacp-1, 0x1.fa695ep+0, 0x1.e42816p-1, -0x1.3ce05p-2, -0x1.2c55cap-1, -0x1.109b3p+1, 0x1.fbdd78p-1, 0x1.9564b4p+0, 0x1.402554p+0, -0x1.4ddcd8p-1, -0x1.d68f5ep+0, -0x1.35572p-1, 0x1.d1cb5ap-1, 0x1.2898e2p+0, 0x1.afafe4p+0, -0x1.8d2604p+0, 0x1.d1cafp+0, 0x1.330ea4p-1, -0x1.e5f6cap-1, 0x1.12ba88p+1, 0x1.b434e6p-1, 0x1.3ee12ap-1, 0x1.af777ep-1, -0x1.24457ep-3, 0x1.cbfb2p+0, 0x1.dc314ep+0, -0x1.41f24ap+0, 0x1.ed2f82p-1, 0x1.d900d8p+0, -0x1.e6fe9p+0, -0x1.4f2694p+0, 0x1.dc2608p-3, 0x1.70c234p+0, 0x1.3dac9ap-4, 0x1.f82cf6p-1, -0x1.2ec2c6p-2, -0x1.454dcp-3, 0x1.5987aep-1, 0x1.828d1ep-1, -0x1.04a206p+1, -0x1.78e76cp-1, -0x1.1c14acp-1, 0x1.7c3404p-2, -0x1.3ae438p+0, 0x1.706988p+0, -0x1.da999ep+0, 0x1.3df0eap+0, 0x1.fa17c4p+0, 0x1.f9ced6p-1, -0x1.154a8ap+0, 0x1.36ba3cp-2, 0x1.6e290ep+0, 0x1.95e828p+0, 0x1.8580d8p+0, 0x1.07a4d8p+0, -0x1.c5352ap+0, -0x1.e37c1ap-2, -0x1.74219ap-1, 0x1.b9c6c4p+0, 0x1.f3852ap-2, 0x1.0e7f9ap+1], [-0x1.0f405p-4, -0x1.3018p+0, -0x1.03952cp-2, 0x1.e0d35ap+0, -0x1.2f9b2ep-1, -0x1.76b19cp-3, 0x1.67d1bep+0, 0x1.6b00e6p-1, -0x1.10a3c4p+1, -0x1.d9d654p-1, -0x1.38a2c2p-1, -0x1.34b2dcp-1, -0x1.2d5d56p+0, 0x1.827694p+0, -0x1.07b7acp-4, -0x1.ed657ep+0, 0x1.b6c4ap-1, -0x1.3a1402p-1, 0x1.cf87ep+0, 0x1.18e81ap+0, 0x1.cd6d9ep-1, -0x1.83e5aap-4, -0x1.edece6p-1, -0x1.296e36p+0, 0x1.664a9ep+0, -0x1.844742p+0, -0x1.94c4bep-3, -0x1.ae4a58p+0, 0x1.13fdb4p-5, -0x1.5b09fp-1, 0x1.1b30dcp-1, -0x1.b6bfd8p-1, -0x1.e9fbe6p+0, -0x1.964128p+0, -0x1.ad7704p+0, 0x1.48d854p+0, 0x1.6f9ca6p-2, -0x1.7b91a4p+0, 0x1.ccbff6p-1, -0x1.c295e4p+0, -0x1.ce2df2p+0, 0x1.9ee156p-1, 0x1.82759p+0, 0x1.7a5a4ap+0, -0x1.02232cp+1, -0x1.b71b78p+0, 0x1.893dfp+0, -0x1.42b9eap+0, 0x1.35a2b2p+0, -0x1.e3875cp-1, -0x1.e05338p+0, 0x1.01e166p+0, -0x1.3434a4p+0, -0x1.347d64p+0, 0x1.eeb638p+0, -0x1.11d3bcp+0, 0x1.ba096cp-1, 0x1.284086p-3, 0x1.68bd22p+0, 0x1.3a7d46p+0, -0x1.c10f1cp+0, -0x1.90ad7p+0, -0x1.d505fcp+0, 0x1.976fe6p+0, 0x1.389c6p+0, -0x1.905b7p+0, -0x1.8b09ep-2, 0x1.514e5cp-4, -0x1.9b2b1ap+0, -0x1.0f95a6p+1, 0x1.874a7ap+0, -0x1.4bf8d2p-8, 0x1.9780ccp-3, -0x1.62805cp+0, -0x1.257f62p-3, -0x1.8226acp+0, -0x1.46126ap+0, 0x1.9691d4p+0, 0x1.b95ddp-4, 0x1.e07efp-1, 0x1.b5b0eap+0, 0x1.b5e554p+0, -0x1.5ecf54p-3, -0x1.7dd106p+0, -0x1.ea9d3ep+0, 0x1.bc6316p-1, 0x1.d72f96p-2, -0x1.d5a82p+0, -0x1.e0ea7ep+0, 0x1.cce87ap+0, 0x1.bc7654p-1, 0x1.aa047ep-1, -0x1.8d2d78p-1, -0x1.2f4eacp+0, -0x1.21c93ep-2, 0x1.bb85fep-2, 0x1.bcdb18p-1, 0x1.80d5d2p+0, 0x1.e736d2p+0, -0x1.f6ee82p+0, 0x1.d07e2ep+0, 0x1.b92982p+0, -0x1.9ba9bap-6, -0x1.005a4p+1, 0x1.813b6ap+0, 0x1.d8b13ep+0, -0x1.acdcdep-2, -0x1.7d1d58p+0, -0x1.65d7fp+0, -0x1.59f9f2p+0, 0x1.febb36p-3, 0x1.0df78ap-1, 0x1.ea815cp-4, 0x1.1663e6p+0, 0x1.e8a52cp-1, -0x1.a741d4p-3, -0x1.95cd8p+0, -0x1.a30cfep+0, -0x1.f4ffb8p+0, 0x1.cc3c9p-1, -0x1.835f6ep-2, -0x1.1b264p+0, 0x1.de28d4p+0, 0x1.c7122p-3, 0x1.a0f624p-2, -0x1.9b9ccap+0, -0x1.2b84f8p-1, -0x1.dd340ep-1], [-0x1.91432ep-1, -0x1.6355cap+0, -0x1.47861ep-4, -0x1.2fd466p+0, 0x1.fb28c4p+0, -0x1.218f92p-1, 0x1.4003fap-2, -0x1.00a89p+1, -0x1.8e40fcp+0, -0x1.a3a192p-3, 0x1.0a023ap+1, -0x1.16210cp-2, -0x1.ad2a0cp+0, -0x1.d2a512p+0, 0x1.e0a81ap+0, 0x1.c44ddcp-1, 0x1.b1cc2ep-1, 0x1.3b5306p-1, 0x1.fff896p+0, -0x1.974eacp+0, 0x1.eb05bp-1, 0x1.0efe2ap+0, -0x1.e7b3a8p+0, 0x1.254eaap+0, 0x1.8c8b1cp-3, -0x1.112b2ep-2, 0x1.e96898p+0, 0x1.a2eda8p+0, 0x1.0a362ep+1, 0x1.05ab2ap+1, -0x1.409492p+0, 0x1.f253c2p-1, -0x1.e46456p-1, -0x1.295624p+0, 0x1.03f35ap+0, 0x1.8aa542p+0, -0x1.88c0fap-2, -0x1.8f3c7p-3, 0x1.024f66p+0, 0x1.6faee6p+0, 0x1.ce9cdcp-1, 0x1.9c1d88p+0, -0x1.93d46ap-2, -0x1.1cab26p-1, 0x1.a1d994p+0, -0x1.30594p-1, -0x1.73f3b6p+0, -0x1.677538p+0, -0x1.b12a7ap+0, 0x1.00508p-2, -0x1.e3615cp-7, 0x1.ce9ebep+0, -0x1.64b678p-3, 0x1.0875f4p+1, -0x1.6587cp+0, 0x1.12ae7p-1, 0x1.63b55cp-9, -0x1.52268ap+0, -0x1.859398p-3, 0x1.023f8cp+1, 0x1.336ee2p+0, 0x1.587228p-1, -0x1.e075f8p+0, 0x1.94c57ep-1, 0x1.75df54p-5, 0x1.d99942p+0, 0x1.eaf392p-1, 0x1.517968p-1, -0x1.25a19cp+0, 0x1.cbb574p-8, 0x1.7a5bbcp+0, -0x1.5f2c7ep-3, -0x1.285eb4p-1, -0x1.363da4p-1, -0x1.91c766p+0, 0x1.12203ap+1, 0x1.608944p-2, 0x1.0f9b9cp+1, -0x1.03f842p+1, 0x1.8f0e2p-1, 0x1.66730ap+0, 0x1.09723cp-1, 0x1.2cf08ep-4, -0x1.41e3eap+0, 0x1.08abe6p-1, -0x1.a635c8p+0, 0x1.68f8f6p-1, 0x1.5f998p+0, 0x1.9cb05cp+0, 0x1.d78252p+0, 0x1.aa025cp+0, -0x1.1f3112p-3, 0x1.b16ecep+0, 0x1.c597e2p+0, -0x1.c6dc3ap+0, -0x1.a397bep-3, -0x1.9149fap-12, -0x1.f7d19ep+0, -0x1.a260e2p+0, 0x1.86785ep+0, -0x1.8a9b12p+0, 0x1.258904p-3, 0x1.91edfep-1, 0x1.89b1a8p-1, 0x1.49fa82p-1, 0x1.cdb936p-2, -0x1.300344p-1, -0x1.09794cp+0, -0x1.b2838ep+0, -0x1.8f83e2p+0, 0x1.01572ap+1, 0x1.1d77eep-2, 0x1.31e77p-1, 0x1.e9efeep-3, -0x1.31baacp-1, -0x1.001edep-1, 0x1.d8eda8p-1, -0x1.84685ep-3, -0x1.cabf02p+0, 0x1.337dacp+0, 0x1.f053bcp-3, 0x1.bd1996p-2, -0x1.2b155cp+0, -0x1.ad3fc8p+0, 0x1.1344bcp-1, 0x1.eee51ep-2, 0x1.794ccp-1, 0x1.7c83eep+0], [0x1.0d35ccp+1, -0x1.da3a7ep+0, -0x1.f92224p-1, 0x1.990ddap-1, -0x1.b76312p-1, -0x1.026122p-1, -0x1.52c2fcp-1, -0x1.78f074p+0, 0x1.a15ab8p+0, 0x1.4d795cp+0, 0x1.6b986ep+0, -0x1.aef746p-2, 0x1.0f59ep-1, 0x1.19d286p+0, -0x1.bf9876p-1, 0x1.e33536p-1, -0x1.62cf3cp+0, -0x1.38837cp+0, -0x1.c5b48p+0, -0x1.a62d4ep+0, -0x1.278d32p-2, -0x1.d135b6p+0, 0x1.813c32p-1, -0x1.b7c87ap+0, -0x1.c42e08p-1, 0x1.092146p-2, -0x1.e9f086p+0, -0x1.51e6ccp+0, -0x1.410308p+0, -0x1.631ad8p+0, -0x1.df3c1p+0, 0x1.8ad5bcp-1, 0x1.d7afd4p+0, 0x1.59ba1p+0, 0x1.9cce7cp+0, 0x1.e6e644p-1, 0x1.7c4ce4p+0, 0x1.c7af1ap-1, 0x1.9ce034p+0, -0x1.05f53p+0, 0x1.b1896ap-1, -0x1.424898p-1, -0x1.b3452p+0, -0x1.bd9064p-2, -0x1.1881bcp+0, 0x1.6b594cp-1, 0x1.ddbfaep-1, 0x1.911536p+0, -0x1.17094p+0, -0x1.73692ap-1, 0x1.c905e8p-1, -0x1.020868p+0, -0x1.af5524p-1, 0x1.a821ep+0, 0x1.f030e4p+0, -0x1.44727p+0, -0x1.f840b6p+0, -0x1.fc3b92p+0, -0x1.28148p-1, -0x1.7da31ep+0, 0x1.cda4ecp-2, 0x1.aba064p-1, -0x1.92318ep+0, 0x1.fa05bap+0, -0x1.2fadbap-1, -0x1.b87242p-1, 0x1.bb3baap+0, -0x1.0c5966p+1, -0x1.bf7ed2p+0, 0x1.c1e74p-1, 0x1.6b5d14p+0, 0x1.f29598p-3, -0x1.02ec58p+1, -0x1.db766ap-1, 0x1.ec1594p-5, 0x1.5e5f1p-1, 0x1.0da6d6p+0, 0x1.27a634p+0, 0x1.9dd124p-1, 0x1.2d7312p+0, -0x1.e4b954p+0, 0x1.c89508p+0, 0x1.af4a48p+0, 0x1.b5e5eap-1, 0x1.1fb4dap+0, 0x1.970986p-2, -0x1.08324ap+1, 0x1.f81da8p-4, 0x1.d5096p-2, 0x1.e2272ep-1, 0x1.087d8ap+1, 0x1.043c2p+1, -0x1.ac7636p+0, -0x1.1e567p-1, -0x1.0b0d74p+0, 0x1.a63c6ap-1, 0x1.6001cap+0, -0x1.4d1e74p-1, 0x1.c1ce3cp+0, -0x1.0aeb9ep+1, -0x1.2ad554p+0, 0x1.cc84f2p-2, 0x1.21466p+0, -0x1.9c43p+0, -0x1.1fdd7ep-3, 0x1.2a2462p-3, -0x1.92ec14p+0, 0x1.8ec75cp-2, 0x1.dcb4ccp+0, 0x1.cc8104p-1, -0x1.09c604p-5, 0x1.7581f8p-2, 0x1.55e9d2p-2, 0x1.3ef808p-1, 0x1.af6dbap-1, -0x1.a88684p-1, 0x1.38713cp+0, 0x1.517584p+0, 0x1.532244p-2, -0x1.054736p+0, 0x1.d93df4p+0, -0x1.64d0d6p-2, -0x1.676468p-7, -0x1.99181ap+0, 0x1.0f8d78p-1, 0x1.af4dbap-1, 0x1.09fad2p-1, 0x1.67e43ap-8], [0x1.638af2p+0, -0x1.6a1532p-1, 0x1.b521e4p-1, -0x1.c2d0bap-1, -0x1.77226ep-1, 0x1.dc5918p+0, 0x1.024578p+1, 0x1.58c878p-2, -0x1.30821cp-2, -0x1.a25a4ap+0, -0x1.5c1fc2p-2, -0x1.bef058p-1, -0x1.e1b156p+0, -0x1.7e085cp+0, -0x1.7e1bc8p-1, -0x1.856e2p-2, 0x1.1374b8p+0, -0x1.f37d9ep+0, 0x1.7d3282p-1, -0x1.237e6ap+0, 0x1.ba9772p+0, 0x1.8bf70ep-1, 0x1.d335c8p+0, -0x1.16bc6cp+0, -0x1.7b5926p+0, -0x1.fc90dp+0, -0x1.948154p+0, -0x1.efe886p-2, 0x1.6b94aap+0, -0x1.aa9f1cp+0, 0x1.2e2bccp+0, -0x1.1b5dfcp+0, -0x1.15eef4p+0, -0x1.7227fep-2, -0x1.7d545p+0, -0x1.292b78p-4, 0x1.f3b58cp-1, -0x1.e5b9e2p+0, -0x1.88ec2p-2, 0x1.fb1d0cp+0, 0x1.af1292p+0, 0x1.8da9bap-1, 0x1.a226f8p-2, -0x1.6d5454p+0, 0x1.3078bp-1, 0x1.4d3e96p-1, -0x1.0aadeap+0, -0x1.0ed1ecp+0, -0x1.75d92p+0, -0x1.b4a07p-3, 0x1.92a8d6p-1, 0x1.a7d522p-1, -0x1.b68dc6p+0, -0x1.39155p-1, 0x1.f5fbc4p+0, 0x1.1422p+0, 0x1.796904p-1, 0x1.347eep+0, -0x1.e4c2b6p-1, -0x1.ee078ap+0, -0x1.ea92cp+0, 0x1.bc1dc4p+0, 0x1.7fec9cp+0, -0x1.ab5c32p-1, 0x1.c0d19ap-2, -0x1.0bab22p+1, -0x1.f01f62p+0, -0x1.aeb036p+0, -0x1.06e06cp+1, 0x1.a2f9p-1, -0x1.5f196ap-1, 0x1.ff9b5ep-1, -0x1.06eedp+1, -0x1.07078p+1, -0x1.4f37c8p-1, -0x1.81c336p+0, -0x1.cb5b2ap+0, -0x1.7464fp-1, 0x1.9958aep-2, 0x1.21a072p-2, -0x1.22fcf2p-2, -0x1.31c05ep-3, 0x1.2d969p+0, 0x1.3a2b2cp-1, 0x1.0ebf6cp+1, 0x1.044436p+1, 0x1.3e04f4p+0, 0x1.7b8cd4p-1, -0x1.c639c2p-3, -0x1.01dd16p+1, -0x1.51a42cp+0, -0x1.01034ep+1, -0x1.6e89cap+0, 0x1.0429b4p+0, 0x1.0df142p-1, 0x1.964676p-3, 0x1.79976ap-1, -0x1.98ac1cp-2, 0x1.707ba2p+0, 0x1.d7da1cp-1, -0x1.450deap-5, 0x1.397bfap+0, 0x1.012a0cp+1, 0x1.d1e456p-2, 0x1.3eb09ap+0, 0x1.066774p+1, -0x1.7c4f22p+0, -0x1.74500cp+0, 0x1.8dcd72p+0, 0x1.1fe3ccp-2, 0x1.11dacep+1, 0x1.88f4fcp+0, 0x1.0e1c78p+0, -0x1.e39456p+0, 0x1.e9cbc6p-1, -0x1.039ffp+0, 0x1.2c8114p-1, -0x1.0fff96p+1, 0x1.3f4ec4p-3, -0x1.c81956p+0, -0x1.4fb29p+0, -0x1.97d8fp-1, 0x1.e2b0e2p+0, 0x1.e2c6e6p-1, 0x1.0c4b88p+0, -0x1.0b4742p-2, -0x1.7388f8p-4, 0x1.15eceap-2], [-0x1.74bd96p-6, 0x1.04b38p+1, 0x1.979cbep-2, -0x1.f123bap+0, -0x1.6860b4p+0, 0x1.abc6f8p-1, -0x1.30467p-1, -0x1.12ff48p+0, -0x1.0c2518p-1, -0x1.a42458p-1, -0x1.17ce52p+0, -0x1.04adf8p-2, -0x1.c2cbc6p+0, -0x1.c547c8p-2, 0x1.34232p-1, -0x1.7ad1c2p-1, 0x1.6555fap+0, -0x1.70903ap-2, -0x1.a03afap+0, -0x1.ce6e2cp-1, -0x1.0c0b38p-4, 0x1.03dd6p-3, 0x1.96df4cp-1, -0x1.9d788cp+0, -0x1.c28874p-1, -0x1.1b3c04p-3, 0x1.136bcap-1, 0x1.2312fap-1, 0x1.b3d3a4p-7, 0x1.af276ep-3, -0x1.d46518p-1, 0x1.511622p-5, -0x1.7cea8p-1, 0x1.ef6f56p+0, 0x1.30a92ep+0, -0x1.96e116p+0, 0x1.605a1ap-2, -0x1.9a62ep-3, 0x1.7896c2p+0, 0x1.c3ad1cp-1, -0x1.50698ap+0, -0x1.be45f8p-1, -0x1.41165cp+0, 0x1.6ffa86p-10, 0x1.12cd0ap+1, 0x1.bae15ap-2, 0x1.9d5fa4p-1, 0x1.403d22p+0, -0x1.a5b4dep+0, -0x1.b8229p-1, -0x1.21394ap-1, -0x1.77d5ccp+0, -0x1.740888p+0, -0x1.0fbc84p+0, 0x1.1e60cap-1, 0x1.702d9ep+0, 0x1.e8c7f2p+0, -0x1.93f96cp-2, 0x1.9be97ep+0, 0x1.61225cp-1, -0x1.ac5008p+0, 0x1.e581b4p-2, -0x1.2c19a4p-1, 0x1.7bcd1ap-1, -0x1.0f53dep+1, 0x1.691d14p-3, 0x1.91a2bcp+0, 0x1.89b73p-1, 0x1.4fcba2p+0, 0x1.f18cf8p-1, -0x1.0fe1aap+0, 0x1.795f5p+0, -0x1.580788p-1, -0x1.89456p-1, -0x1.2e0ec6p+0, 0x1.faca76p+0, -0x1.a879a6p-1, -0x1.8939ap+0, 0x1.82c726p-1, -0x1.030644p+1, -0x1.d601bap+0, 0x1.1131fep+1, -0x1.11676ap-3, -0x1.32ac82p-1, -0x1.72984cp+0, -0x1.723176p+0, -0x1.9b7766p+0, 0x1.c8451ep+0, 0x1.84ae88p-3, 0x1.68bb8cp+0, 0x1.18449cp-1, -0x1.0e93e8p+1, 0x1.3b68dcp-2, -0x1.4af854p-1, 0x1.c1fa78p+0, 0x1.20eec6p+0, -0x1.ec629p+0, 0x1.2bacfcp+0, 0x1.4e6f4cp-1, 0x1.d5c5dp-2, 0x1.8f87b2p-1, -0x1.281718p+0, 0x1.275c9p+0, -0x1.d12a6ep-1, 0x1.c9c248p-2, 0x1.e162e8p+0, -0x1.8c1a36p+0, 0x1.87d59cp-1, -0x1.6e0932p+0, -0x1.5abff4p+0, 0x1.a0f77ep-3, -0x1.41f7ccp+0, -0x1.003278p+1, 0x1.efbe3ap-1, -0x1.03eea6p+0, -0x1.212992p-3, -0x1.03b15cp+1, -0x1.216be2p+0, 0x1.163fe6p+0, -0x1.63715p+0, -0x1.6cc9fp+0, 0x1.87311p-1, 0x1.4ebfd6p-2, 0x1.02bb6p+1, 0x1.9a378ep-1, 0x1.929e62p-2, 0x1.9ebf1ep-1, -0x1.73f502p+0], [0x1.82ff5p+0, 0x1.a21cfep-1, 0x1.c2efdp-1, -0x1.3639e4p+0, 0x1.0792d6p+0, -0x1.4e2ab4p-1, -0x1.8c1764p-1, 0x1.fa40dp+0, -0x1.0b2edap+0, 0x1.69a9d8p+0, 0x1.486502p+0, -0x1.cd7472p-2, -0x1.003498p+0, 0x1.982c8p+0, 0x1.15e2cp-1, -0x1.8f2a32p+0, 0x1.0f8a88p+0, 0x1.fa59bp+0, 0x1.466e54p-4, -0x1.0c68eep+1, -0x1.798c2cp+0, 0x1.7e50ap+0, 0x1.011bap+1, -0x1.b130dap+0, 0x1.3b4e1cp+0, -0x1.04d90cp-3, 0x1.aed7b8p+0, -0x1.cd43e2p-1, -0x1.f2897ep-3, -0x1.75854ap+0, -0x1.3f7346p+0, -0x1.7a4b88p-1, -0x1.3e7cfep-3, -0x1.8e3cb8p-1, -0x1.1f8b4cp-1, -0x1.0a796ep+0, 0x1.80284ap+0, -0x1.6f7488p+0, -0x1.44c20ep+0, 0x1.ef2ecap-1, 0x1.467f06p-2, -0x1.e335dep-4, 0x1.2cde4p-2, 0x1.47d542p-2, 0x1.659c3ap-3, 0x1.46fdf6p+0, -0x1.93766p-1, 0x1.b35cdap+0, -0x1.d7f9dp-1, -0x1.1b7c7p+0, -0x1.0cc65p+0, 0x1.13d844p+0, -0x1.5aead8p+0, -0x1.110eb8p-1, 0x1.98faa8p+0, -0x1.f3d3bcp+0, 0x1.db1f26p+0, -0x1.23531ap+0, -0x1.089afp-1, -0x1.e93afp+0, 0x1.0d0918p+0, 0x1.1093cap+1, -0x1.e38e92p-1, -0x1.a198cep+0, 0x1.6764c6p+0, -0x1.019208p+0, 0x1.e7b1a6p-1, -0x1.b6dd6p+0, 0x1.0d5b0ep+0, -0x1.50afacp-1, -0x1.8d03fp+0, 0x1.22388ep-1, -0x1.8f07ep-1, -0x1.5dc926p-6, -0x1.10ba2cp-2, -0x1.a25ffep+0, -0x1.cb4c6p+0, -0x1.f48308p-2, -0x1.0bf31ep+1, 0x1.e9c6e6p-1, 0x1.0e563p+1, 0x1.482cb2p+0, 0x1.2e655ep+0, 0x1.2a124ap+0, 0x1.76c794p-1, 0x1.ff85dep+0, 0x1.43ce9ep-2, -0x1.8cb34ep-1, 0x1.0a5a76p-1, -0x1.205836p-1, 0x1.4a6302p+0, 0x1.10c374p+1, -0x1.e788fap-7, -0x1.4b5152p-1, 0x1.1632aap-2, 0x1.0fec9cp+1, 0x1.93202p-2, 0x1.c27328p+0, -0x1.0cf162p+1, -0x1.8981ap+0, -0x1.ebea3cp+0, 0x1.12b52cp+1, 0x1.15fc06p+0, 0x1.4d6496p+0, -0x1.accbdcp-1, -0x1.ccd122p-2, 0x1.492a32p+0, -0x1.2b502p-1, -0x1.01d642p+1, -0x1.81df52p-1, 0x1.8712a6p-5, -0x1.c0caa2p+0, -0x1.07f146p+1, 0x1.c3fd62p-1, -0x1.08256ap+1, 0x1.3af6cep-7, 0x1.8d361ep+0, -0x1.1c06b8p-4, 0x1.677428p+0, -0x1.018eeap+1, 0x1.ac24a6p-2, 0x1.7c8aa8p-1, 0x1.674e96p+0, 0x1.06d65p-5, 0x1.8b975ap+0, -0x1.75917ep+0, 0x1.facf92p-2, 0x1.7fceaap+0], [-0x1.a5a45p-1, 0x1.6acfd6p+0, -0x1.1b5494p-1, 0x1.7d8cdcp+0, 0x1.0b7b2p+1, -0x1.9a8eb8p+0, -0x1.dd28ap-3, -0x1.f721b6p-1, 0x1.a75ba6p+0, 0x1.9b03b6p-1, 0x1.356748p+0, -0x1.07a65ep+1, 0x1.1c1436p-3, 0x1.2b49c6p+0, -0x1.8bdcc4p+0, 0x1.87e962p-5, -0x1.791f4ep+0, -0x1.9130bap-1, -0x1.16af48p+0, 0x1.b87372p+0, -0x1.ead88ap-2, -0x1.d5d47cp-3, 0x1.fb1c4ep-2, -0x1.c6155cp-1, -0x1.6f65dap-1, 0x1.3d1356p-3, 0x1.efd048p+0, 0x1.719adap+0, -0x1.3d3b78p-1, 0x1.99e552p-2, 0x1.ae64ccp+0, 0x1.f5faep-1, -0x1.1d6064p-1, -0x1.d9804ep-3, 0x1.0f7f1ap+1, 0x1.e5b0a4p+0, 0x1.da6afep-3, -0x1.0b6fbcp+0, 0x1.467cf8p-3, 0x1.bbcb56p+0, -0x1.7e2a62p+0, -0x1.9c2c8ap-5, 0x1.d84ba2p+0, 0x1.b160fap-1, -0x1.6cb464p-1, -0x1.1b861p+0, 0x1.a367fep+0, 0x1.723a04p+0, 0x1.62dbf6p+0, -0x1.63b716p-1, -0x1.43e848p-2, 0x1.b81474p+0, 0x1.113cb6p+1, -0x1.0f6958p+1, -0x1.5b48eep-2, -0x1.8ce6fp-1, 0x1.fb6becp-1, 0x1.1772ccp-4, 0x1.396546p-1, 0x1.1a657p-1, 0x1.1de748p-3, -0x1.3f154ep+0, -0x1.9148ep-1, 0x1.7c7b3p-1, 0x1.b04e2p+0, 0x1.43fae2p+0, -0x1.206bfap-2, 0x1.910696p+0, 0x1.bda5eep+0, 0x1.8385f8p-4, 0x1.4843dap+0, -0x1.007a92p+1, 0x1.01d3b8p+0, -0x1.51b39ap+0, -0x1.dfb97cp+0, -0x1.848ce4p+0, -0x1.7a567p+0, 0x1.8ae5e2p+0, 0x1.e83484p+0, 0x1.349a44p+0, -0x1.b547dcp-5, -0x1.6d7466p+0, -0x1.46bd78p-1, 0x1.9ea238p-1, 0x1.23e6bcp+0, -0x1.ca6f32p+0, -0x1.8c893ep+0, -0x1.c35458p+0, -0x1.beac1ep+0, -0x1.aae7dep-6, -0x1.7ca762p+0, -0x1.07d7cep-1, -0x1.f80654p+0, -0x1.1a8492p-1, -0x1.fc7b68p-1, 0x1.9cbdd8p-1, 0x1.f81216p-2, 0x1.e54f6cp+0, -0x1.08a1acp-1, 0x1.9c7994p+0, -0x1.de77c2p-2, 0x1.d571f4p-1, 0x1.f541cap-1, 0x1.03366ap-5, -0x1.33b778p+0, -0x1.c5065ap+0, -0x1.9f908p-1, 0x1.8af098p-2, 0x1.78f45cp-1, -0x1.8c4848p+0, 0x1.817bf6p-3, 0x1.415b74p+0, -0x1.313388p+0, -0x1.f3513ap+0, -0x1.8b697p+0, -0x1.e983a6p-3, 0x1.1c45f2p+0, -0x1.c8f1aap-1, 0x1.da863cp+0, -0x1.3f3316p+0, 0x1.89a522p-1, -0x1.a5a356p+0, 0x1.b7cd32p-2, -0x1.75f87ep-1, -0x1.1d8878p+0, -0x1.362fc4p+0, -0x1.6c7ab2p+0, -0x1.a3a2f6p+0], [0x1.dcce1ap+0, 0x1.fb0554p-1, 0x1.ef6562p+0, -0x1.afb358p+0, 0x1.dbf41ap+0, 0x1.1d3622p+0, -0x1.80c728p-1, 0x1.8dd64ep-2, 0x1.89d01ep-2, 0x1.3b962cp-1, 0x1.be001p-2, -0x1.0d82eap+0, 0x1.310d94p+0, -0x1.d91568p-6, -0x1.c56ad4p+0, 0x1.0d61dp-1, 0x1.998538p-1, -0x1.033faep+1, 0x1.35ff1ap-1, 0x1.a88b2cp+0, 0x1.720bep-1, 0x1.a9577ap-3, 0x1.2ccea8p+0, -0x1.9a413cp+0, -0x1.02406cp+1, -0x1.8dffe8p-2, -0x1.c665c4p-1, 0x1.eeeae2p+0, 0x1.67c9ep+0, 0x1.dec3fp+0, -0x1.8f5f18p-2, 0x1.829ec4p-1, -0x1.251824p-1, -0x1.d024b8p-2, 0x1.d79da6p-7, -0x1.02e446p-1, -0x1.a02d36p-5, 0x1.9b5b7cp-2, 0x1.4ff998p-1, 0x1.eda0eep-5, -0x1.bd6e82p-3, 0x1.8072d8p-1, -0x1.7b74a6p-1, 0x1.bdb754p-1, 0x1.2b2bb6p+0, -0x1.6c1764p-1, 0x1.388ca6p-6, 0x1.2d596p-1, 0x1.56a412p-2, 0x1.feb548p+0, -0x1.5d36cp+0, -0x1.a2390ap-1, 0x1.fe2562p-1, -0x1.e0f38ap+0, -0x1.f6a918p+0, -0x1.0914dcp+1, -0x1.dc1c7p-1, -0x1.187d3ap+0, 0x1.3c6f26p+0, -0x1.514dcep-2, 0x1.3074fap-3, -0x1.01fad6p+1, 0x1.cc0bbcp+0, 0x1.be1556p+0, 0x1.065e68p+1, 0x1.12a0e4p+1, 0x1.b6e952p+0, 0x1.fb5784p-1, 0x1.a4b36ep-1, 0x1.3d957p-3, -0x1.a3b83ap+0, -0x1.449d86p-2, -0x1.0732acp-2, 0x1.a29586p-1, -0x1.8529dcp-2, 0x1.00b59ep-2, -0x1.838e74p+0, 0x1.112f66p+1, -0x1.7c71c6p+0, -0x1.8605aep-1, -0x1.4ed726p-2, -0x1.7bee34p-2, -0x1.4b023ap+0, 0x1.179b64p+0, -0x1.d16decp+0, 0x1.c9c97ep+0, -0x1.4ab7f8p+0, -0x1.65d73ep-3, 0x1.24fb1ep+0, 0x1.1b486p+0, 0x1.a8f364p-1, -0x1.285e62p-1, 0x1.7ce13ap-3, 0x1.e63b78p+0, -0x1.1e7d2cp-2, -0x1.b86196p+0, 0x1.0d463p+0, 0x1.332daap+0, -0x1.50b6b6p-1, -0x1.3d1c5ap-1, -0x1.6cc736p+0, -0x1.c4bdep+0, -0x1.5f057ep+0, -0x1.b32342p+0, 0x1.98c28ap+0, -0x1.2d26c2p-3, 0x1.9bbf94p-1, 0x1.ec2c54p+0, 0x1.bd315cp+0, 0x1.744f58p-2, 0x1.8f048p-3, -0x1.166fb2p-2, 0x1.7124b2p-3, 0x1.63034ap+0, -0x1.f3a23ep-3, 0x1.0ed9f4p-4, 0x1.13309ap-1, -0x1.dce80ap-5, -0x1.a8922cp-3, -0x1.c601b6p-2, -0x1.430b1ep-3, 0x1.85d28ap+0, -0x1.f283b8p+0, 0x1.4487e2p-3, -0x1.ec875cp+0, 0x1.4113dap-2, -0x1.3dc546p-2, -0x1.6f8ccep-3], [-0x1.19c24ep-1, -0x1.b25p+0, -0x1.5dd566p+0, -0x1.7ac522p+0, 0x1.52baf8p-2, -0x1.ef007ep-3, -0x1.bd931p+0, -0x1.0cbd86p+1, -0x1.87f1d4p-3, -0x1.1a725ep+0, -0x1.c7e398p-1, -0x1.211ecap+0, 0x1.1bbbp-1, -0x1.d36348p-3, -0x1.021a82p+1, 0x1.a16e1ep+0, -0x1.a48278p+0, -0x1.b89712p-1, 0x1.6899f2p+0, -0x1.1370acp-2, 0x1.535cbap+0, 0x1.cf4c44p-1, -0x1.0242d6p+0, 0x1.feeebep+0, -0x1.c94f1ep-1, 0x1.159588p-1, 0x1.a00874p+0, -0x1.9a8364p-2, -0x1.80a522p-1, -0x1.4b34aap+0, 0x1.7a716ap-2, 0x1.2170eap+0, 0x1.8e3f9ap-1, -0x1.6c7126p+0, -0x1.79fc08p-1, 0x1.eccc52p+0, -0x1.bc7d8p+0, -0x1.ee242p+0, -0x1.8c5e1ep-1, -0x1.99ed4ap+0, 0x1.e4124ep+0, 0x1.ddeebap+0, 0x1.9ce328p-1, 0x1.ccf5b4p-2, -0x1.0b4a72p+1, -0x1.7d99bep+0, 0x1.a6e66ep-1, 0x1.12b44ep-1, 0x1.9c1ad4p-3, 0x1.f1d32ep+0, -0x1.014cecp-1, -0x1.19950ap+0, 0x1.28ac3ap-2, 0x1.c1ffcp-4, 0x1.43b2bcp-1, -0x1.155c1ap-1, 0x1.3ca2aep-1, 0x1.25c85cp+0, 0x1.94a5f2p-2, -0x1.7477ep+0, 0x1.ff3e5ep-3, 0x1.bc4a7cp-1, 0x1.d068a6p+0, 0x1.9c136p+0, 0x1.7f94d8p-3, -0x1.9c6e8cp-2, 0x1.b6b242p-1, -0x1.566b28p+0, 0x1.9f9a8p+0, -0x1.4139ecp+0, -0x1.0cbd3cp-1, -0x1.566f22p-3, 0x1.b299d2p-4, -0x1.90c0a2p-1, 0x1.ececdp+0, 0x1.5f7074p-4, -0x1.adbf28p+0, 0x1.4bb8c6p-1, 0x1.689ad4p+0, 0x1.ce7edep+0, 0x1.a56146p-3, -0x1.fc1c3p+0, -0x1.00c9fcp-1, 0x1.1a50fp-1, -0x1.6712f4p-4, 0x1.2b7c9p+0, -0x1.1dd44cp-1, -0x1.2691eep-1, -0x1.097b34p+0, -0x1.03b824p+1, 0x1.9c767p+0, -0x1.97dd4cp+0, -0x1.f49a0ap+0, -0x1.4347bep+0, 0x1.331506p+0, -0x1.d608bep+0, -0x1.60dbbp+0, -0x1.05e034p+0, -0x1.38df9cp-2, -0x1.25e9bep+0, 0x1.cccd2cp+0, 0x1.fbb006p+0, -0x1.39ae42p+0, -0x1.18db44p+0, -0x1.b4b7c8p+0, -0x1.0fbc18p-2, -0x1.7bfbb8p+0, -0x1.f940cep-2, -0x1.03a794p+0, 0x1.f545a6p-1, 0x1.014d44p+0, -0x1.3096c4p-4, -0x1.0e18d4p+1, -0x1.02898ep+1, -0x1.aee3d8p-2, 0x1.bf0bccp+0, -0x1.55c1c4p-1, -0x1.67dccep-3, 0x1.f66e42p-2, 0x1.456f4p-1, -0x1.07f572p+0, -0x1.02d062p+0, -0x1.c300e4p+0, 0x1.2ce07p-2, -0x1.ddb682p-2, 0x1.d6c56cp+0, -0x1.d21366p-2, 0x1.30630ep-2], [0x1.c5d328p-1, -0x1.c05f26p+0, 0x1.47419p-2, -0x1.b19abap+0, 0x1.643332p+0, -0x1.16551ap-3, 0x1.60ee4ap-4, 0x1.4164dap-3, 0x1.ded62cp-1, -0x1.befba6p-1, 0x1.08108p+1, -0x1.bc59f4p-2, 0x1.2af52ep-2, 0x1.f153cap+0, 0x1.d8af78p+0, 0x1.efe0fep-4, -0x1.8f0134p+0, -0x1.0a6a16p+0, 0x1.9026eep+0, 0x1.0ac334p+0, -0x1.7721f2p+0, -0x1.417ddep-4, 0x1.0caca2p+1, -0x1.0f5d92p+0, -0x1.e75bfep+0, 0x1.6b4fa2p+0, -0x1.03456ep-2, -0x1.ee6106p-2, 0x1.cfbe78p+0, -0x1.d4999p-3, -0x1.69dafap+0, -0x1.fe3e04p-4, 0x1.069acep+1, 0x1.77655cp+0, 0x1.700cdcp+0, -0x1.16df5ep+0, -0x1.8b805ep+0, 0x1.462eb2p-4, 0x1.0ac1dcp+1, -0x1.9bb0f8p-1, -0x1.000ecp+1, -0x1.161bd4p-1, -0x1.0df672p+1, -0x1.9f23ccp+0, 0x1.cfc012p-3, 0x1.f709e6p+0, 0x1.c2a3a4p-5, -0x1.0efd4p+0, -0x1.4d4258p+0, 0x1.9f99ep+0, 0x1.03204cp-1, 0x1.4136ecp+0, -0x1.7bee68p+0, 0x1.11ca2cp+0, -0x1.3f6574p-3, 0x1.e41b5cp+0, 0x1.51979p+0, 0x1.6761dap+0, 0x1.b930c6p-1, 0x1.c3b9f4p-2, 0x1.d4abdcp+0, 0x1.2c8d42p-2, -0x1.39fcf2p-2, -0x1.05202ep+1, -0x1.0c2b1p+1, 0x1.08eab2p-2, 0x1.58e98ap+0, 0x1.802c96p+0, -0x1.352398p+0, -0x1.d4980ap+0, -0x1.985602p+0, -0x1.c26afep+0, -0x1.44ee28p+0, 0x1.515cfap-1, 0x1.6e1b3p+0, -0x1.dcddep-1, 0x1.0a4dbp+1, -0x1.1a5e6ap+0, -0x1.099336p+1, 0x1.08fa4ap+0, 0x1.f85e6ap+0, 0x1.e0fb96p-1, -0x1.9ed5eap+0, -0x1.de753ap+0, -0x1.200f38p-2, -0x1.a16a48p+0, -0x1.184e02p-3, 0x1.a020dcp-4, -0x1.e9f094p-1, -0x1.6346bap+0, 0x1.92470ep+0, -0x1.457bep+0, -0x1.e8beaep+0, 0x1.e21fdep-2, -0x1.936734p+0, -0x1.570e2ap+0, 0x1.15fe3ep+0, 0x1.d13db2p+0, 0x1.54c058p-5, -0x1.50879p+0, 0x1.0aaf52p+1, -0x1.050c02p-2, -0x1.c158eap+0, 0x1.01a4f8p+0, -0x1.539e5cp+0, 0x1.89da8ap-3, 0x1.77f568p-1, -0x1.022c56p+1, 0x1.42e584p+0, 0x1.b1030ep-2, 0x1.f5aa88p+0, -0x1.ddd858p-1, 0x1.ff080ep+0, 0x1.d01ba2p+0, -0x1.ffe738p+0, -0x1.debf46p-2, 0x1.e77fdcp-1, 0x1.5b80fp-1, -0x1.1f55cap+0, -0x1.f8d918p-3, -0x1.662a76p+0, 0x1.bd55f2p-6, 0x1.8c101ep+0, 0x1.8b1a1p-2, 0x1.d0cffap+0, -0x1.8025bep+0, 0x1.0fde24p+1, -0x1.2617a8p-1], [-0x1.b3bc2cp-2, 0x1.a19a5ep-2, 0x1.fd017ep+0, 0x1.0e74a6p+0, 0x1.e219f8p-3, -0x1.a8e88ap+0, 0x1.c4c6ecp-1, -0x1.8f06bep-1, -0x1.4f1356p-2, -0x1.fb388ep-3, -0x1.0a54bp+1, -0x1.7c5bf6p+0, 0x1.5f26ccp-5, 0x1.59e5eap+0, -0x1.7538ep+0, 0x1.08ce66p+0, 0x1.4aa682p+0, -0x1.8b8b96p-1, -0x1.b0715ep-1, 0x1.7ad07cp-2, 0x1.800c7cp+0, -0x1.8c4e8ap-2, -0x1.0d6e26p-3, 0x1.c4e9a2p+0, -0x1.9a25eap-2, -0x1.ddc582p-8, -0x1.22ea86p+0, 0x1.7925dap+0, 0x1.986ac2p+0, -0x1.53c09ep+0, -0x1.b7898p-1, 0x1.08a8b6p-1, -0x1.1b85f4p+0, 0x1.11f34ap-1, -0x1.0c4e8ep-1, 0x1.76130ap+0, -0x1.bb435cp-1, -0x1.52b65p-1, -0x1.6fba88p+0, 0x1.1e0c2p+0, 0x1.cccef6p-2, 0x1.6afd3p-1, 0x1.0f53d6p+0, 0x1.c9c958p-1, -0x1.04e4ap+1, 0x1.4fe91p-3, -0x1.d9504ap+0, 0x1.5d3c7p+0, 0x1.3c65fcp+0, -0x1.a39272p+0, -0x1.629f58p-1, 0x1.04499cp+0, 0x1.88f7c2p+0, -0x1.e2d5f6p-1, -0x1.bda6a6p-2, 0x1.5a029p-1, -0x1.28007ep+0, 0x1.84b482p-1, 0x1.575e0cp+0, 0x1.8d7ce6p+0, 0x1.a30d4ap+0, -0x1.8f5b4p+0, 0x1.0425ccp+1, 0x1.abeceep-1, 0x1.5b8aa6p-1, 0x1.0f35e2p+1, 0x1.a10e4ap-3, -0x1.d609a2p-2, 0x1.1b318cp+0, -0x1.74a2bep+0, 0x1.29082ep+0, -0x1.57601ep-2, 0x1.7179e8p-3, -0x1.b004d2p+0, -0x1.5c286p+0, -0x1.01ea0ap+1, -0x1.c14b64p+0, 0x1.d3c1e2p+0, -0x1.7280e6p-1, 0x1.0c9dfap+1, 0x1.841c3ep+0, 0x1.eed43ep-1, -0x1.23b75cp-1, -0x1.11c454p-6, 0x1.cc19cp+0, 0x1.c96114p-5, 0x1.8f50cap-1, 0x1.ca144cp-4, 0x1.8f9e76p+0, -0x1.720d86p-6, -0x1.b7fa1cp-1, 0x1.e856fcp-1, 0x1.f1a25p-1, -0x1.6d96b2p+0, 0x1.9107f2p-2, 0x1.d2d5f8p+0, 0x1.d414d6p+0, -0x1.07749p+1, -0x1.fd6602p+0, -0x1.1de7fcp-1, 0x1.071ab4p+0, 0x1.423ba8p+0, 0x1.51547ep-11, 0x1.04d34ap+1, -0x1.d0ace6p+0, -0x1.6a0edap+0, 0x1.cce068p-1, -0x1.75da58p-1, 0x1.54a198p-1, -0x1.51dce8p+0, -0x1.3805c4p-1, -0x1.38f60ep-1, 0x1.4fdbccp+0, -0x1.bdb2aap-3, 0x1.5494dep+0, -0x1.44aa5cp-1, 0x1.4b27eap+0, 0x1.b50d9ap+0, 0x1.feb9dcp-1, -0x1.6795b8p+0, 0x1.b4658cp+0, -0x1.84b086p+0, -0x1.757b1ap+0, 0x1.39d29p-1, 0x1.28a9c6p+0, -0x1.e2ae68p-1, -0x1.3bf634p-3, -0x1.d80a06p-2], [-0x1.099db8p-2, 0x1.110716p-3, -0x1.4c518cp-1, 0x1.0fccd4p-1, 0x1.fc07dcp+0, -0x1.a0b864p-3, 0x1.2eaa1ep-2, 0x1.2dec2ep-3, -0x1.53e7e8p-5, -0x1.96b22ap-2, 0x1.be300ap+0, 0x1.4f6934p+0, 0x1.0387b2p+1, -0x1.356c1cp+0, 0x1.ca7608p+0, 0x1.6226d4p+0, 0x1.7658b4p+0, -0x1.a63304p-1, -0x1.8d0cdap-1, 0x1.9884a6p-3, -0x1.521a68p+0, -0x1.008cep+1, 0x1.9421c8p-1, 0x1.098f26p-2, 0x1.e96df2p-1, 0x1.a5e8ccp-1, -0x1.6334fcp-1, 0x1.bd74a8p-4, -0x1.722af2p+0, 0x1.8f8592p-1, -0x1.224438p-1, 0x1.3d03cep-1, -0x1.83d2e2p+0, 0x1.0ef45p-5, -0x1.696f3ep+0, -0x1.1a7168p+0, 0x1.498546p+0, 0x1.74c316p+0, 0x1.1869d4p-1, -0x1.f57b66p-3, -0x1.4df324p+0, 0x1.2db6bep+0, 0x1.be19b6p-4, 0x1.bd86cep-1, -0x1.ec3708p-2, -0x1.fe150cp+0, -0x1.b3e86ep-2, 0x1.a3507ap-1, 0x1.591968p+0, -0x1.99c33ap-1, -0x1.d29624p+0, 0x1.444f06p-1, 0x1.db4374p+0, 0x1.5e0938p+0, 0x1.b6633ap-1, -0x1.6c2b44p+0, -0x1.64aafap+0, 0x1.9c8758p+0, 0x1.f43a6ep+0, -0x1.bb2478p-1, 0x1.0ce9ccp+0, -0x1.5698fp+0, -0x1.84fa32p+0, 0x1.7a611p+0, -0x1.f38b72p-1, -0x1.7274a4p-2, 0x1.5b2b7p+0, 0x1.b0f428p-1, 0x1.015f3ep+1, 0x1.049a3ap+1, 0x1.ecf29p+0, -0x1.059afep+1, -0x1.9f4942p+0, 0x1.409f06p-4, -0x1.48d9b4p+0, 0x1.17f754p+0, 0x1.17743p+0, -0x1.293cdp-1, -0x1.c0fd76p+0, -0x1.e7b6dep-1, 0x1.7d8142p-1, -0x1.ff2414p-2, 0x1.0ed538p+1, 0x1.1463fep+0, -0x1.d2277ap+0, 0x1.4a1374p+0, -0x1.cd675ap+0, 0x1.c7ba38p-2, 0x1.036cc6p+0, -0x1.08aa1ap-2, 0x1.6228fcp-1, -0x1.86623ep+0, 0x1.12497p-2, 0x1.dc0ae4p+0, -0x1.92c0c2p+0, -0x1.cfda1ep-3, 0x1.53c7dep+0, -0x1.ea9efcp-3, -0x1.bad8bp+0, 0x1.63f26p+0, -0x1.5741aap-2, 0x1.d13c62p-1, 0x1.91a8f8p-1, -0x1.0b3028p+0, 0x1.6c7b0cp+0, -0x1.212f2p-2, -0x1.3bc276p-2, -0x1.9b839ep+0, 0x1.55377ep-1, -0x1.012d5ap+0, 0x1.79e6bcp-3, -0x1.10aecap+1, -0x1.a65f02p-2, -0x1.cb5404p-2, 0x1.c0f654p-1, 0x1.82e824p+0, 0x1.9a6a22p-1, -0x1.a4849ep+0, -0x1.92e97ep-3, 0x1.a93a7ep-1, 0x1.9a21bap+0, 0x1.37a40cp+0, -0x1.c9c612p+0, -0x1.579016p+0, 0x1.f3b27cp-1, 0x1.b982a4p+0, -0x1.2a089ep+0, -0x1.f8d51ep-1], [0x1.404f3cp+0, 0x1.0e5fdep-1, -0x1.7bda72p+0, -0x1.9ee18p+0, -0x1.ed2c82p-1, 0x1.8c4316p-1, -0x1.50b50ap+0, 0x1.c1f388p-4, -0x1.e350bp-1, 0x1.b65132p-2, -0x1.7026bcp+0, -0x1.bed52ep-1, 0x1.ef487ep+0, 0x1.19f35ap-2, -0x1.8ea17ap+0, -0x1.7e3d36p+0, 0x1.dfb4c4p+0, 0x1.d33234p+0, 0x1.9eea9cp-7, -0x1.8a927p+0, -0x1.28c3d8p-1, -0x1.c5b24ep-4, -0x1.d5527cp-1, -0x1.3df932p+0, -0x1.55c81ep-7, -0x1.1721b4p-3, 0x1.33b67ap-1, -0x1.88e53p-1, -0x1.6353fap+0, 0x1.dbaf1ap-1, -0x1.318f66p-2, -0x1.b77404p-1, -0x1.057d58p+1, -0x1.bf79cep+0, -0x1.b6ea82p+0, 0x1.5657fap+0, -0x1.1f367ep+0, -0x1.ecd9eep-3, -0x1.eec3b4p-5, -0x1.9a1ef8p-3, -0x1.0188f2p+1, 0x1.6b4598p-1, -0x1.b8d476p-1, -0x1.1e2d06p+0, 0x1.76bc6ap-2, 0x1.8d28a4p+0, 0x1.d6d012p+0, 0x1.c90db4p-1, 0x1.a89874p-1, 0x1.7beb5p+0, 0x1.8de268p+0, 0x1.6a76aap+0, 0x1.25fbbep+0, 0x1.d9240ap+0, -0x1.ef212cp+0, -0x1.0d5bdep+1, 0x1.0a6cccp+1, -0x1.d152cp-2, 0x1.076da2p+1, 0x1.06df82p-1, 0x1.fc08c6p+0, 0x1.1b8d74p-2, 0x1.2c9b0ap+0, 0x1.27dc84p-1, 0x1.d5aaep-1, 0x1.1d49aep+0, 0x1.b8291ep+0, 0x1.282eecp+0, 0x1.7f0d08p+0, -0x1.8b649ap-1, 0x1.b9d99ap+0, -0x1.aaa214p-1, 0x1.566ce4p+0, -0x1.d16434p-2, -0x1.e83474p-1, 0x1.3e0904p+0, -0x1.40dc44p+0, 0x1.38780ap+0, -0x1.e7da36p+0, 0x1.fad8fp-3, 0x1.39989p+0, -0x1.2c771cp+0, 0x1.0193e6p+0, 0x1.2b9a88p-3, 0x1.d7162ap-1, -0x1.07cdbap+0, 0x1.8ab12ep-2, 0x1.5c8d8ap-1, 0x1.89428p+0, -0x1.301188p-1, -0x1.83a68cp-2, -0x1.b3136ep+0, 0x1.4b729ep+0, -0x1.b53ea6p-1, 0x1.79c0eap+0, 0x1.4ce1cp-1, -0x1.2f9b6ep-1, -0x1.95caa6p+0, 0x1.78aaa4p-8, 0x1.15ca14p+0, 0x1.cf3b64p-1, 0x1.3a360ep-2, 0x1.31c33ep-3, 0x1.7c871p-3, -0x1.33d764p-4, -0x1.1e2606p-1, -0x1.3ec02cp-1, -0x1.c27f06p-1, 0x1.71a0cp+0, 0x1.263af4p-3, -0x1.5d694ep-1, 0x1.8a45a8p+0, -0x1.54533cp-1, 0x1.87b7c6p+0, 0x1.e055b8p-4, -0x1.2c6e44p-1, 0x1.0a6504p+1, -0x1.373a84p+0, 0x1.473e3cp-2, 0x1.d98f4p-3, 0x1.0559aep+1, -0x1.c14508p-1, 0x1.c68d7ap+0, 0x1.673b5ap-1, 0x1.cb835cp+0, -0x1.4d8c02p-9, -0x1.69e47ap-2, 0x1.56f992p+0], [-0x1.839a8ap-1, -0x1.482b74p-1, -0x1.0afd02p+1, -0x1.74a61p+0, -0x1.0fe092p+1, 0x1.949804p-2, -0x1.48e0b4p+0, 0x1.664996p+0, 0x1.645442p+0, 0x1.4620bep-1, -0x1.3f183ap+0, -0x1.0b72c6p-2, 0x1.278076p-1, 0x1.931564p+0, -0x1.d7b19ep+0, -0x1.e76092p-7, -0x1.d03ac4p+0, -0x1.2bca9ap+0, -0x1.3ebeep-3, 0x1.7bef3p-3, -0x1.f2bea2p-7, -0x1.05053p+0, -0x1.2f166cp-1, -0x1.eca04ep+0, 0x1.e18758p+0, 0x1.326bap-2, 0x1.39f778p-1, 0x1.087126p-5, 0x1.1762e6p-2, 0x1.97b6dp-2, -0x1.fee6aep-1, -0x1.a6c71ap-3, 0x1.1ebf7ep-2, -0x1.13b56ap+0, 0x1.dc3edap-2, -0x1.73d8eap+0, 0x1.96454cp-1, -0x1.208c54p+0, -0x1.5a6034p-1, -0x1.96c8b2p+0, 0x1.e9b7fap+0, 0x1.fb5794p-2, -0x1.bec38cp+0, 0x1.fa1078p-4, 0x1.717ed8p+0, -0x1.70dee2p-1, 0x1.561862p-2, -0x1.8cb9fcp-1, 0x1.6747e2p+0, 0x1.005fb6p+1, 0x1.0f596cp+1, 0x1.1274fp+0, -0x1.9ce9dcp-1, -0x1.7932ap+0, -0x1.3074fap+0, -0x1.c5c0c8p-1, -0x1.302ddcp-2, 0x1.6a43a6p-1, -0x1.d5002ep-2, 0x1.4d4546p+0, -0x1.7bcd44p+0, -0x1.0fa814p+0, 0x1.3c28b6p+0, -0x1.74716ep-4, -0x1.442c9p-3, 0x1.b12142p-1, 0x1.50a7d8p+0, -0x1.a62198p+0, -0x1.c10ae8p+0, 0x1.b930c6p-2, 0x1.a2b932p+0, 0x1.adfd84p-2, 0x1.e907f8p-1, -0x1.7db6b8p-2, -0x1.3bd3bcp+0, 0x1.1ddf4cp-1, 0x1.bc3beep+0, 0x1.a16fp+0, 0x1.8a6b86p+0, -0x1.410a28p+0, 0x1.4e3c66p+0, -0x1.043acap-2, 0x1.0c50d4p+1, -0x1.dc976p-1, 0x1.24cbd8p+0, -0x1.f522eap-1, 0x1.c8aea6p-3, -0x1.46573ap+0, -0x1.48a794p-1, 0x1.5ae1bp+0, 0x1.10fffep+1, 0x1.06d14ap+1, 0x1.648e74p-2, 0x1.26e38p+0, 0x1.7b202ep+0, -0x1.c65cacp+0, 0x1.a2b3a4p+0, 0x1.f7633p-2, 0x1.10890cp+1, -0x1.036328p+1, -0x1.80d98p+0, -0x1.a2fe38p-1, 0x1.585ff8p+0, -0x1.4d77ccp-1, -0x1.665bb6p-1, -0x1.00dc84p+1, 0x1.d349e6p-1, 0x1.63063ap-2, -0x1.1d3e3ap+0, 0x1.bc6656p+0, -0x1.95377ap-1, -0x1.f19ac8p+0, -0x1.bee6cp+0, 0x1.809406p-1, 0x1.409842p-1, 0x1.45d43ep+0, 0x1.12417cp+1, 0x1.7445acp-2, 0x1.c5c614p-3, 0x1.7f0b46p-3, 0x1.516e08p+0, -0x1.601e6ep-1, -0x1.472a7ap-2, 0x1.a03546p-1, -0x1.07626p+1, -0x1.291db8p-2, -0x1.9cd876p+0, -0x1.68528p-2], [-0x1.ca054ap-1, 0x1.a95136p-1, -0x1.2a47dp+0, -0x1.964058p+0, 0x1.637bep+0, 0x1.773bdap+0, -0x1.15d1ap+0, 0x1.b9ad5cp-1, 0x1.56b7b2p+0, 0x1.b9fe54p-4, -0x1.503b2ap-2, -0x1.2e77bap+0, -0x1.cc4c12p+0, -0x1.4d40fcp-1, 0x1.ecae22p-2, -0x1.b2dc44p-1, -0x1.8aba7cp+0, 0x1.d142f6p-1, -0x1.328104p-1, -0x1.b2168ap-6, -0x1.cf2a12p-1, -0x1.0a7b94p+1, 0x1.67c5d2p+0, 0x1.edb43ep+0, -0x1.d8302ap-4, -0x1.08a688p+1, -0x1.4a4d06p+0, 0x1.d4f4fap-3, -0x1.4f6606p-4, 0x1.6b6f3ep+0, -0x1.29cfa6p+0, 0x1.75f494p-3, -0x1.07d1b8p-1, -0x1.3ed3c8p+0, 0x1.25d618p+0, 0x1.07062p+0, -0x1.3c275cp+0, -0x1.49266ap-1, 0x1.8f44a2p-2, -0x1.b18f74p+0, -0x1.1fa108p-1, 0x1.24f7d2p+0, -0x1.fef1cep-3, -0x1.8efdf6p+0, 0x1.671ca8p-1, 0x1.66ebb2p-1, 0x1.bc85d6p-1, -0x1.8a902p+0, -0x1.7a1ca2p+0, -0x1.49bf06p+0, -0x1.14993ep+0, 0x1.15dccp-2, 0x1.5e6bp+0, -0x1.9a26a6p+0, -0x1.6c0ef2p-2, 0x1.2dbe7ep-4, -0x1.0c4c3ap+0, -0x1.5be51cp+0, 0x1.6d4fd2p-1, -0x1.3f5638p-4, -0x1.afadp-1, -0x1.b83956p-2, 0x1.c7f856p+0, -0x1.51d72ep+0, -0x1.7abceap-1, -0x1.068b88p+0, -0x1.57fea6p-1, -0x1.757254p+0, -0x1.4e999cp-3, -0x1.57ad3ap+0, 0x1.21177p+0, 0x1.f7030cp-3, 0x1.cf007ap-5, 0x1.5d03dep+0, 0x1.58e142p-1, 0x1.59e86p-1, -0x1.6a8922p-1, -0x1.1bdb2ep+0, -0x1.f59316p-1, 0x1.ea9964p+0, 0x1.bdc78p-1, -0x1.155828p+0, 0x1.ba7898p-2, -0x1.f50a2cp+0, 0x1.806ea6p+0, -0x1.78666ep+0, -0x1.128e3ep+1, 0x1.688408p+0, 0x1.a51114p+0, -0x1.be5154p+0, 0x1.784d7p+0, 0x1.67b33ep+0, -0x1.07d946p+1, 0x1.2a7bd6p+0, -0x1.c6322ap+0, -0x1.f0d438p-2, 0x1.bf3c02p+0, -0x1.76c3eep-1, 0x1.0113b4p+0, 0x1.b1be7ap-1, 0x1.21a76ap-2, 0x1.a52bc8p-3, 0x1.36a4p-2, -0x1.3920fp-1, 0x1.c43a1cp+0, -0x1.818158p+0, 0x1.59f5a4p-6, -0x1.25a98cp+0, 0x1.09f4c6p+1, -0x1.0efb88p-1, -0x1.963b62p+0, 0x1.72e64cp-3, -0x1.351806p+0, -0x1.3670fp-3, -0x1.2aa81ep+0, -0x1.1c7c5ep-2, 0x1.4a4aa8p+0, 0x1.f3f17cp+0, -0x1.3d4a7p-1, -0x1.6bb3c4p+0, 0x1.1a7942p+0, 0x1.e9fd56p-1, 0x1.e7ccbp-1, 0x1.1f2ec2p-3, -0x1.4fa678p+0, -0x1.8ba8b2p+0, 0x1.b1c6fep-3, -0x1.edfbfap-2], [0x1.bad12ap-4, -0x1.dc9a36p-1, -0x1.102bf4p+1, 0x1.c2a108p-1, -0x1.3c0268p+0, 0x1.aa1efap-2, 0x1.3dcf22p+0, 0x1.670674p+0, -0x1.8162f8p-4, 0x1.9294cp+0, 0x1.4cf82cp-4, 0x1.93cf6ap+0, 0x1.070dd4p+1, 0x1.7c7742p+0, 0x1.ea37d4p-4, 0x1.ee67p-2, 0x1.4fb7eep+0, 0x1.384bdep-1, -0x1.1e5f88p-4, -0x1.fd28d6p+0, -0x1.bfe516p-1, 0x1.9db51ep-2, 0x1.de0edep-2, -0x1.d9d7e6p-1, -0x1.b3e614p-1, -0x1.19a634p+0, -0x1.a26d2ep-1, -0x1.ba7e18p+0, -0x1.b10248p-1, -0x1.d4b7cap-1, 0x1.0c9438p+1, -0x1.f747e4p-2, 0x1.3c5ddp-3, 0x1.0a2b48p+0, 0x1.875b44p-1, -0x1.77cbe6p+0, 0x1.087726p+1, 0x1.ec1c8cp+0, -0x1.0bde9ap+1, 0x1.b649c6p+0, -0x1.2a4628p-5, 0x1.1710a4p-3, 0x1.547534p-1, 0x1.b7493p+0, 0x1.3dfd4cp+0, 0x1.d006fep+0, 0x1.d397cp+0, 0x1.8ecc4ap-4, -0x1.60149p-1, 0x1.36d9f8p-1, 0x1.9e9b7ap-1, -0x1.19d792p-1, -0x1.07bb62p+1, -0x1.a58398p-1, -0x1.cc0c1ap-2, -0x1.a3e9c6p+0, -0x1.04986ep+1, -0x1.a85e6cp-1, -0x1.a12248p+0, -0x1.a73c18p-2, -0x1.4fc6b6p+0, 0x1.9829eap+0, -0x1.b7ef1ap-1, 0x1.9602b4p+0, -0x1.c6f514p-2, -0x1.537ea4p+0, -0x1.e4564p+0, -0x1.53a9c8p-1, -0x1.19c1b2p-7, 0x1.619784p-4, 0x1.0e904ep+1, 0x1.c776acp-4, -0x1.896b8p+0, -0x1.8a598ep-1, 0x1.ce6c7cp+0, -0x1.d2b20ap-2, 0x1.ee3e22p-5, 0x1.bd532ep+0, -0x1.365ac4p-2, -0x1.7c9644p+0, 0x1.601b58p+0, 0x1.72e0fcp+0, 0x1.2e933cp+0, 0x1.0424f8p+1, -0x1.f6e7acp+0, 0x1.57bcdcp+0, 0x1.2d0606p+0, 0x1.614806p+0, 0x1.552c58p-1, 0x1.c90b94p-2, -0x1.2a8b9cp-4, -0x1.90b3ecp-1, -0x1.611ffcp-1, -0x1.21d478p+0, -0x1.b7c276p+0, 0x1.69bc0cp+0, 0x1.83e92p-1, -0x1.b8c2fap-1, -0x1.9a7674p+0, -0x1.d7c4c6p+0, 0x1.899a9p-2, 0x1.86cbd2p-2, 0x1.e8a974p+0, -0x1.b9958cp-2, 0x1.be93dep-2, 0x1.e2d8cap+0, -0x1.452ac2p-6, -0x1.c0e32ep+0, 0x1.19202ep+0, -0x1.365e24p+0, 0x1.bc1d94p+0, -0x1.49c0bcp-1, 0x1.51cda6p+0, 0x1.76da92p+0, -0x1.8e2fc4p+0, -0x1.62bd26p-2, -0x1.bea94ep-1, -0x1.3f481p+0, 0x1.076ae2p-2, 0x1.a8e842p-1, 0x1.e090f6p+0, -0x1.f30c6cp-1, 0x1.dbf6dcp-1, -0x1.0da8a2p-3, 0x1.616626p+0, -0x1.3a6296p+0, -0x1.8b533p+0, 0x1.2198e6p+0], [-0x1.019f72p-2, 0x1.b3b4ap-2, 0x1.e69208p-2, -0x1.893b96p+0, -0x1.0ec6c8p+1, -0x1.2b22dep+0, -0x1.2b6fd8p+0, 0x1.fa79dp-1, 0x1.4c4ee6p-5, -0x1.a040bap+0, -0x1.905948p-1, -0x1.5c9fap+0, 0x1.f9789p-2, 0x1.5a16dap-1, 0x1.c0f2c2p-1, -0x1.36b2bap+0, 0x1.deec42p+0, -0x1.1753eep+0, -0x1.0a6cap+1, 0x1.b79c94p-1, 0x1.06b6bcp+1, -0x1.1fcd6p-1, 0x1.e9c934p-1, 0x1.23c008p+0, -0x1.ba525cp+0, -0x1.2fd8a6p-1, -0x1.b56af2p+0, 0x1.ea4f34p-1, 0x1.dbff02p+0, -0x1.cd5912p-1, -0x1.73ab7ep-1, 0x1.b6fcecp+0, -0x1.487172p+0, -0x1.0e96b4p+1, -0x1.aa8524p-1, 0x1.e92daap+0, 0x1.0a6d0ep+1, -0x1.d47b5ap-2, 0x1.4031a4p+0, 0x1.7d9308p-1, 0x1.e33708p-1, -0x1.aef7a6p-5, -0x1.fc94f8p+0, -0x1.cf70e6p+0, -0x1.05958cp+1, 0x1.7a9072p-2, -0x1.fd1d62p+0, 0x1.238bdap+0, 0x1.888c4cp-1, 0x1.305066p+0, -0x1.67fcf8p+0, 0x1.6cb65ep+0, 0x1.9b1182p+0, -0x1.07d76p+1, 0x1.08664cp-2, -0x1.b1172ep-2, -0x1.3c8028p-2, 0x1.87a9a6p+0, 0x1.94415p-3, 0x1.ad816ap-2, -0x1.1b68a4p+0, 0x1.0cd3fp+1, -0x1.4c300cp+0, -0x1.b5846ep+0, -0x1.ecf854p-2, 0x1.1aa198p-1, -0x1.8724b4p+0, 0x1.78ff52p-3, 0x1.74d918p-1, 0x1.31be7cp-3, 0x1.ff4536p+0, -0x1.532068p-3, -0x1.4341e2p+0, -0x1.7a00fap+0, -0x1.06c656p+0, 0x1.cd24d2p+0, -0x1.313e3p+0, 0x1.48f5ap-1, -0x1.9a9578p+0, -0x1.09252p+0, 0x1.b54d2ap+0, -0x1.62fc6p-4, -0x1.35b4c4p+0, -0x1.b77dap+0, -0x1.0fec3ep+1, 0x1.1af1dap+0, 0x1.8af2c6p-2, 0x1.346ef6p-2, -0x1.af874ep+0, 0x1.ca5c74p-1, 0x1.dc154cp+0, -0x1.0dfaa2p+0, -0x1.839f68p+0, -0x1.90af4ep-3, 0x1.7cc6fep+0, 0x1.439458p-1, -0x1.1cf772p+0, 0x1.6b6438p+0, -0x1.495628p+0, -0x1.04f7d4p+1, -0x1.71b17cp-2, 0x1.bc73e4p+0, -0x1.4c7fep-2, -0x1.b3c872p-2, -0x1.35f24ep+0, 0x1.fee9e8p-1, -0x1.4de6p+0, 0x1.fe9eacp-1, 0x1.9ef39p+0, -0x1.eee518p+0, 0x1.803e42p-1, -0x1.73851cp+0, -0x1.6034ap+0, -0x1.a84e7p-5, 0x1.a07fc4p-2, -0x1.f264e4p-2, -0x1.3c953cp-2, 0x1.1ae712p+0, -0x1.42a84cp-2, -0x1.3b5a28p-1, -0x1.a0a9c8p+0, 0x1.71f822p+0, -0x1.a89194p-2, 0x1.61439ep-1, -0x1.4e427ap+0, 0x1.f5acecp+0, 0x1.90adf4p+0, -0x1.626e3ap-1], [-0x1.0f0794p+1, 0x1.623a66p+0, 0x1.1c407ap-2, 0x1.c36c5cp-1, 0x1.ed102ap+0, 0x1.33ec8ap-1, 0x1.27e7b2p-2, 0x1.082edp-1, -0x1.bea182p+0, -0x1.790bf8p+0, -0x1.cf9ecp+0, 0x1.e8eb6p+0, -0x1.542f0ep+0, -0x1.86858ap-3, 0x1.223fdp-3, 0x1.79b8bcp-1, 0x1.daaa3ep-3, -0x1.b8a2b2p-2, -0x1.bedc04p+0, 0x1.0ecb8p+0, 0x1.7021f2p-1, -0x1.3cea9p+0, -0x1.0a5a5ep-1, 0x1.60bb7ap+0, -0x1.11dc38p+1, -0x1.1f6e54p+0, -0x1.978b94p+0, -0x1.7cab62p+0, 0x1.7764e2p+0, -0x1.656258p-2, -0x1.b8b87cp+0, -0x1.95f084p-2, 0x1.65e888p-4, 0x1.102bc4p+0, 0x1.ac3828p+0, -0x1.b0d1dap-1, 0x1.b766dap-2, -0x1.30c08ap+0, -0x1.df9b84p+0, 0x1.45d958p+0, 0x1.29d3fap-2, -0x1.136eacp-1, -0x1.5bab02p+0, -0x1.b3ab76p-2, -0x1.f39828p-1, -0x1.8ca35p-1, -0x1.e26d0ap+0, 0x1.d742bcp-2, 0x1.c21cccp+0, -0x1.91b5dap-3, 0x1.bcba52p-1, 0x1.0836cp+0, 0x1.0d1584p+1, -0x1.74b084p-1, -0x1.ca1c24p+0, -0x1.3627e2p-3, -0x1.91f248p+0, -0x1.76600ep+0, 0x1.4b4e36p-1, 0x1.947ddep+0, 0x1.65c9p+0, -0x1.dab72p+0, 0x1.83ffa6p+0, -0x1.5cc642p+0, 0x1.188076p-5, 0x1.3e3748p+0, -0x1.11f88ap-2, -0x1.e27af8p-2, -0x1.a96b18p+0, -0x1.e16be8p+0, 0x1.0cedfap+1, -0x1.d9113cp+0, 0x1.0a2de8p+1, 0x1.ac1e8p+0, 0x1.311558p+0, -0x1.db8176p+0, -0x1.765e58p+0, 0x1.918e84p-1, -0x1.7ce094p-1, 0x1.42ab1ep+0, -0x1.fedd5p-1, -0x1.fa151p-3, 0x1.4d912cp-1, 0x1.06ad4cp+1, 0x1.32b41ep-2, -0x1.2a3dfap+0, -0x1.3d6feap+0, -0x1.2f927ep-1, -0x1.968b18p-4, 0x1.69f77ep-1, -0x1.2ad226p-2, -0x1.4d4ac2p-1, -0x1.0b0402p+1, 0x1.caeb38p+0, 0x1.40ff26p+0, 0x1.f625eap-1, -0x1.0ccc56p-1, 0x1.73490ap+0, 0x1.73d54cp-2, -0x1.8c781cp+0, 0x1.d04e34p+0, 0x1.0e15d6p+0, 0x1.ecb362p-1, 0x1.ec1f9ep+0, 0x1.186b94p-5, -0x1.0de1fap+1, 0x1.1261ecp+1, -0x1.bb4ac8p-1, -0x1.fc34e4p+0, -0x1.b2674ep-4, -0x1.b2c252p+0, -0x1.c8bf7cp+0, -0x1.f3f158p+0, 0x1.9acfa4p-1, 0x1.051276p+0, 0x1.c29c7p+0, 0x1.e77d22p-2, -0x1.b0c854p+0, -0x1.a8fed4p+0, -0x1.8429fcp-2, 0x1.58b26cp+0, -0x1.072598p+1, -0x1.039276p+1, -0x1.687e78p+0, -0x1.d55adep-1, -0x1.ee58bep+0, 0x1.f4cec6p-1, -0x1.a44262p-3], [0x1.2d28b2p+0, 0x1.087e82p+1, 0x1.0d594ap+1, 0x1.6485bp+0, -0x1.0a94f6p-1, 0x1.aac982p+0, 0x1.c5bbdp-1, -0x1.2cccc4p+0, -0x1.1c3d5ep+0, 0x1.de08f4p+0, -0x1.632e96p-5, 0x1.69ca06p+0, 0x1.7a942cp-2, 0x1.aff93cp+0, 0x1.2f3b8ap-2, 0x1.4a14a2p+0, 0x1.e14a72p-4, -0x1.2bc8e2p-2, -0x1.afdb62p-1, -0x1.9ccb9ap+0, 0x1.27ec3ap-2, 0x1.7837aap+0, -0x1.23266p+0, -0x1.3765bp+0, -0x1.05a15cp+1, 0x1.f6a676p+0, -0x1.bba038p+0, 0x1.97a846p-8, 0x1.f85456p+0, 0x1.9d75e8p-3, -0x1.532248p-2, -0x1.91418cp+0, 0x1.7a8ac6p+0, -0x1.9bb8fcp-2, -0x1.fa6f56p+0, 0x1.0d81a4p-3, -0x1.e7f6e6p+0, 0x1.924dfcp-3, -0x1.887cbcp+0, 0x1.534aeep+0, -0x1.bdde3p+0, 0x1.6b6bdep+0, -0x1.df843cp-4, 0x1.a61a02p-2, 0x1.3668d2p+0, 0x1.b008dp-2, 0x1.104b4cp-1, 0x1.d73254p-2, 0x1.1221e6p+1, 0x1.139e7cp-1, 0x1.f4b3d2p-1, -0x1.2d3454p+0, 0x1.998a5ep+0, -0x1.2a214cp-3, -0x1.353eccp+0, 0x1.0c9b02p+0, -0x1.386c5cp-1, -0x1.79dc0cp+0, -0x1.28c18ap-4, -0x1.1a036ep+0, -0x1.0e6ab8p+0, -0x1.0af1dap-1, 0x1.aa9a86p-1, 0x1.b49f1ep+0, 0x1.ea572p+0, -0x1.1fec74p+0, 0x1.60d68cp-1, -0x1.57c16ep+0, -0x1.d864dep+0, 0x1.5805d4p+0, 0x1.e3a37ap+0, 0x1.2108d2p+0, -0x1.935adcp-1, 0x1.080df6p-1, -0x1.f9ea42p+0, -0x1.021e5ap+1, -0x1.a76ff8p+0, -0x1.886d6ap-1, 0x1.120fcep+1, 0x1.18091ep+0, -0x1.8a8a46p-1, -0x1.6bc5d6p-1, 0x1.59e368p+0, 0x1.720ad4p+0, 0x1.d10d86p+0, 0x1.e39a3ep+0, 0x1.6286e6p+0, -0x1.3757acp+0, -0x1.7facf2p-1, -0x1.e94208p-1, 0x1.a263f8p-1, 0x1.7d6c6ap+0, -0x1.5a5b6cp-3, 0x1.001658p+0, -0x1.800c8ap-1, -0x1.9e4538p-1, -0x1.570298p-2, -0x1.37dd8p-2, -0x1.0c4a68p+0, -0x1.c1d294p-1, -0x1.f8cf42p-1, 0x1.c03632p-13, -0x1.060f9ep-1, -0x1.cfccb4p+0, 0x1.3fc236p+0, -0x1.104244p-4, 0x1.28bbb8p-2, 0x1.4cf4dep-1, 0x1.70671cp+0, 0x1.88e2e8p+0, 0x1.6f6b4ep-3, -0x1.cf499cp+0, -0x1.3b860cp+0, 0x1.d69392p+0, -0x1.44a49p+0, -0x1.52ffbp-1, 0x1.095f64p-2, -0x1.023f58p+0, -0x1.9e8cd2p+0, 0x1.8c2e5ap-2, 0x1.420752p-2, -0x1.917764p-1, -0x1.d5caa8p-1, 0x1.1d26bp+0, 0x1.a1a88ep-1, 0x1.0280f2p+1, 0x1.8363aap-1, -0x1.535408p+0], [-0x1.a6f16ep+0, -0x1.0da188p+1, -0x1.0e243ep+0, 0x1.1de46ep-1, -0x1.4282c6p+0, 0x1.a47ee8p-1, -0x1.7320d2p-5, -0x1.df33eep-1, 0x1.e3c968p-10, 0x1.b0ab3ep+0, -0x1.2b7884p-3, 0x1.71c81cp-2, 0x1.e0b9c8p-1, 0x1.637514p-4, 0x1.5669d4p-2, -0x1.8f58bp-1, -0x1.bdd24cp+0, 0x1.6d9326p-1, 0x1.e96fd8p-1, 0x1.0698fp+0, 0x1.b984fp+0, -0x1.796e1ep+0, 0x1.d79354p+0, 0x1.80059ap-5, 0x1.085204p+1, -0x1.958bf4p-1, -0x1.7e63f2p+0, -0x1.5c16a4p+0, 0x1.6e9fe8p-3, 0x1.3b13b2p+0, -0x1.3a6d7ap-1, 0x1.2fccbep-4, -0x1.fafdeap-3, 0x1.6b7e2cp+0, 0x1.5ecb64p-1, 0x1.cc1aep-1, 0x1.f15498p+0, 0x1.667c02p-5, 0x1.e85a58p-4, -0x1.dfbecep-3, -0x1.087554p+1, -0x1.295ab2p-4, 0x1.ad29f2p+0, -0x1.e4d52ap+0, 0x1.1c2262p+0, 0x1.4f54acp+0, 0x1.0bfbccp+0, -0x1.f25b4cp+0, -0x1.ea1112p+0, -0x1.184dbcp-4, 0x1.4a6922p-3, -0x1.6fa19p+0, -0x1.b393c8p+0, -0x1.3bafccp-1, 0x1.ce9062p+0, 0x1.554e7p+0, -0x1.2fa7bcp+0, -0x1.570a94p+0, 0x1.e8663cp+0, -0x1.0f24b4p+1, -0x1.7da3b6p-6, -0x1.7a35e6p+0, 0x1.02207p+1, 0x1.8a9904p-3, -0x1.9521b2p+0, -0x1.f652b4p-2, 0x1.100f38p+1, 0x1.02cb08p+1, -0x1.7ac9fap+0, 0x1.5339acp-2, 0x1.0622f4p+0, -0x1.dbaa3cp+0, -0x1.1177a8p-2, -0x1.4999dep+0, 0x1.484b0ep-2, 0x1.10bc94p+1, -0x1.cfe5ccp-1, -0x1.aa0f1ep-1, -0x1.980f84p-2, 0x1.ae76bcp+0, -0x1.1513dep-1, 0x1.e4574ep-6, -0x1.cbc48p+0, 0x1.9dfe4cp+0, 0x1.755f6ep-5, -0x1.95823ap+0, 0x1.0ca082p+0, -0x1.188ea4p-1, -0x1.6ccc7ap+0, 0x1.b593fp+0, 0x1.18c796p+0, 0x1.44b7f8p-1, -0x1.f543dap-5, -0x1.16ade8p+0, 0x1.4197ccp-1, -0x1.904064p-1, -0x1.8cecfep+0, -0x1.1bbc5cp-1, -0x1.7038eap+0, -0x1.26a382p-1, -0x1.a245f8p+0, -0x1.735a54p-2, -0x1.3eeeaap+0, 0x1.dcc784p+0, 0x1.6ed8a6p+0, 0x1.9164b6p+0, 0x1.07d978p-1, -0x1.8581e8p-3, -0x1.14d9d4p+0, 0x1.a9dc32p+0, 0x1.3b56a8p-2, 0x1.006f78p+0, 0x1.0bd2a4p+1, -0x1.244e5ep+0, 0x1.9072a2p+0, 0x1.f2f3bap-1, 0x1.e50ae8p-2, 0x1.86281ap-2, -0x1.9f6f5cp+0, 0x1.1c9afep-1, 0x1.d9a3eap-1, -0x1.39bad2p+0, 0x1.929974p-1, -0x1.f3efeap+0, 0x1.c05fdp+0, 0x1.13bcfcp+0, 0x1.10a5fp+1, 0x1.28ea5ep-1], [0x1.3a59a6p+0, -0x1.5a741cp-1, -0x1.063a88p+1, -0x1.71f5e6p-4, -0x1.0997cep+0, -0x1.d9bde4p-4, 0x1.3d5e48p-1, -0x1.01fab4p+0, -0x1.53a602p+0, 0x1.5d6e26p-1, 0x1.865074p+0, -0x1.f7b0cep+0, 0x1.e108acp-2, 0x1.44fc44p-1, -0x1.b3f44cp+0, -0x1.517b4ap+0, -0x1.3731dap-1, -0x1.6d711cp-1, 0x1.381446p-1, 0x1.6c968cp-1, -0x1.497cdep-1, -0x1.759ac8p+0, -0x1.0eb6f4p+1, 0x1.04810ap+1, -0x1.bff73p+0, 0x1.08107ap+1, 0x1.9070b2p+0, -0x1.8bc772p+0, -0x1.879438p+0, 0x1.e9bcbcp+0, -0x1.eb9e14p+0, 0x1.f5ca82p+0, 0x1.5ed498p+0, -0x1.776d4cp+0, 0x1.53b2e6p+0, -0x1.c1beep-1, 0x1.ea153ep+0, -0x1.ce2984p-3, 0x1.6baf74p+0, -0x1.83f574p-1, 0x1.2a4c24p-1, -0x1.041aaep+1, -0x1.b02942p-1, -0x1.fff29p-1, -0x1.cf67bp-4, -0x1.4f608cp-2, -0x1.669b84p+0, 0x1.07b5bep+1, -0x1.fe7d78p-5, 0x1.1e2e9cp-1, 0x1.898764p+0, -0x1.93fc7p-3, 0x1.6c882p-2, 0x1.e410b8p+0, 0x1.b2b51p+0, -0x1.005ea6p+1, -0x1.c9b7d2p+0, -0x1.b79d48p+0, 0x1.2539eep-4, 0x1.d4627cp+0, 0x1.31c512p+0, -0x1.ced0eap-1, 0x1.eac90ep+0, 0x1.53af06p+0, 0x1.a0cbe8p+0, 0x1.75f5bap+0, -0x1.8aba36p+0, -0x1.c9aac6p-2, 0x1.4b763cp-2, -0x1.042dc8p+0, 0x1.3253eep+0, -0x1.aef5b8p+0, 0x1.b14e3ep+0, -0x1.c1acd2p+0, -0x1.6e719cp-1, -0x1.fb54e8p-3, 0x1.aaf8f6p+0, -0x1.2afebep-1, 0x1.0c380ap+1, 0x1.8446d2p-3, -0x1.d97058p+0, -0x1.972006p+0, 0x1.624eap+0, -0x1.93303cp-1, 0x1.378982p+0, 0x1.5f4516p-3, 0x1.f27fd4p-2, -0x1.f172eap+0, -0x1.870c36p-1, -0x1.ebffcep-2, 0x1.1aff8cp-1, 0x1.aeb42cp-4, 0x1.1ded9cp+0, -0x1.6cd4d8p-6, -0x1.1239dcp+0, 0x1.def7dcp+0, 0x1.253026p+0, -0x1.e34376p+0, 0x1.938a2ep+0, 0x1.f3d0d8p-2, 0x1.41de0cp-2, -0x1.85f348p-1, 0x1.049bd2p+0, 0x1.ab6af4p+0, -0x1.c40972p+0, 0x1.b8bb78p+0, -0x1.2cee82p+0, 0x1.6a6ba4p+0, -0x1.72142p+0, 0x1.0ad9bap-2, -0x1.60f8bp+0, 0x1.10da7ep+1, -0x1.19bebcp-1, 0x1.5e08a6p+0, 0x1.581ce4p+0, -0x1.943b5ep-1, 0x1.5e6c04p-1, 0x1.b813e4p-1, -0x1.0becc4p+0, -0x1.e5badcp-5, 0x1.3c524ap-4, 0x1.ea20eep+0, -0x1.712458p+0, 0x1.d8a0f8p-1, -0x1.da7154p+0, 0x1.0fadbap+0, -0x1.5a96c8p-1, 0x1.18eb0ep+0], [0x1.da298ap+0, 0x1.826fc2p-1, 0x1.7fc8c4p+0, -0x1.baebf8p+0, -0x1.83ac32p+0, 0x1.e63fbcp-3, 0x1.f6a1ap-1, -0x1.01fe46p+1, -0x1.d5f3f4p-1, 0x1.c24a34p-1, -0x1.4c9524p+0, 0x1.bdb19ap-2, -0x1.d49e4ep-1, 0x1.2a10d2p+0, 0x1.855b02p-1, -0x1.25489p-1, 0x1.95a52p+0, -0x1.ca1196p-4, -0x1.bf80dep+0, 0x1.e7838p+0, 0x1.ac61dap+0, -0x1.997b3ap+0, -0x1.f4960ep-2, 0x1.bee93ap-2, -0x1.232b06p-1, 0x1.ce2ccep+0, -0x1.0f5a6ep+1, 0x1.04e68cp+1, 0x1.56980cp+0, -0x1.9576fep+0, 0x1.83a42p-2, 0x1.3967bep-1, 0x1.20064ep+0, 0x1.13928ap-3, 0x1.264514p-1, -0x1.22e91ep+0, 0x1.068078p+0, -0x1.800108p-1, 0x1.1061d6p+0, 0x1.d0a444p+0, 0x1.581d9cp-1, 0x1.c02382p+0, -0x1.a16828p-1, 0x1.364c9p-2, 0x1.0f1a66p+1, 0x1.f38328p+0, -0x1.72d7aep-2, -0x1.ed391cp+0, 0x1.25d35p-3, 0x1.a046dap+0, 0x1.39f678p+0, 0x1.15ba12p+0, 0x1.f77102p+0, 0x1.88e648p+0, -0x1.4089b4p+0, 0x1.11b932p+0, 0x1.b328c8p+0, -0x1.df0e6cp-1, -0x1.668aa6p-1, -0x1.91345p-1, -0x1.37434p+0, -0x1.a5e9fap-1, 0x1.48b806p+0, -0x1.b9f0c8p+0, 0x1.829de2p-3, -0x1.27a056p+0, 0x1.039d12p+1, -0x1.ef1b88p+0, -0x1.3ad88ep-2, -0x1.b20ce6p-2, -0x1.47ffe8p-2, 0x1.410f4p+0, 0x1.6f947ep-1, -0x1.056562p-4, -0x1.fbf4b6p-1, 0x1.d6e856p-1, -0x1.a3b92p+0, 0x1.5051a6p-1, 0x1.d0d332p+0, 0x1.60ad34p-1, -0x1.590c38p-2, 0x1.4aadd8p-2, 0x1.0d113ep-1, 0x1.693432p+0, 0x1.c5caep+0, 0x1.c3a8c2p+0, -0x1.831a7p+0, -0x1.ad303cp+0, -0x1.b28246p+0, 0x1.8bfcbep-1, 0x1.1793b2p+0, -0x1.c505eep+0, 0x1.d4d7f8p-2, -0x1.a78ffep+0, -0x1.8f8964p+0, -0x1.c867a6p+0, -0x1.48f73cp-1, 0x1.1eaf56p-1, -0x1.da0aaep-1, -0x1.3f583ap-2, 0x1.0b0018p+1, 0x1.059484p+1, 0x1.01f4ep+0, 0x1.3f3b16p+0, -0x1.5b5af6p-2, -0x1.356f42p-1, 0x1.0a8b08p+0, -0x1.5b466ap+0, -0x1.cd57b6p+0, -0x1.57cc6ap+0, 0x1.4105fep-1, -0x1.773318p-5, -0x1.3f6dcap+0, 0x1.bce4d2p-1, 0x1.2e4dc8p+0, -0x1.948448p-3, 0x1.94018cp+0, -0x1.ad6b88p+0, -0x1.cb731p+0, 0x1.890a28p+0, -0x1.e6b00cp+0, -0x1.7c71a4p-4, -0x1.781d4ep+0, -0x1.47470ap-1, -0x1.349cdp+0, -0x1.0ff5dep+1, 0x1.6a1d48p-4, 0x1.da8602p-2], [0x1.7aad6p-1, 0x1.efcf78p-5, -0x1.46d326p-2, 0x1.010844p+1, 0x1.3811d2p+0, -0x1.9abd88p+0, -0x1.3d0d2ep+0, 0x1.f18596p+0, -0x1.e2f30ep+0, 0x1.95521ep-2, 0x1.508c4p-1, 0x1.4ff38cp+0, 0x1.4d73bep-1, -0x1.577f32p+0, 0x1.43acdep+0, -0x1.f71c76p-4, -0x1.60c7fp-2, -0x1.9b6dacp-3, -0x1.b6a6ecp-1, 0x1.ebb7bep-3, -0x1.702b48p+0, 0x1.0941c2p-1, -0x1.8fc7dcp-3, 0x1.7a2e7ep+0, 0x1.b2779p+0, 0x1.0f0c9cp+0, -0x1.e02ca6p-1, 0x1.369beep-1, 0x1.2308bp-1, -0x1.9e1cap+0, 0x1.604c02p-2, -0x1.da67dcp+0, -0x1.184d44p+0, -0x1.1542ecp+0, -0x1.0ba02ap-5, -0x1.29c786p+0, -0x1.cd1fccp-5, -0x1.91ea3cp+0, -0x1.5245aap+0, -0x1.e8a29ep-5, -0x1.b3e9b4p+0, -0x1.1d0986p+0, 0x1.3fff32p+0, 0x1.0ab0a6p+1, 0x1.39bfd4p-1, -0x1.65fap+0, 0x1.23248ep-3, 0x1.d7e86cp-1, -0x1.bbba6ep-1, -0x1.59eaep-1, -0x1.5f40bap+0, -0x1.614cb8p-1, -0x1.1f2cd6p-1, -0x1.7f2e2cp+0, 0x1.4a46a4p-2, 0x1.6fef7p-3, 0x1.466e5ep+0, -0x1.fe4ec8p-1, 0x1.00f806p+0, 0x1.135d9p-2, 0x1.da469ep-3, -0x1.c81192p-1, -0x1.9b11c4p-1, 0x1.0c82b2p+1, -0x1.952594p-1, -0x1.8e89a8p+0, 0x1.c95a2ep+0, 0x1.5e2686p+0, -0x1.426686p+0, 0x1.012876p+0, 0x1.d0a8eap-1, -0x1.8f56dp-1, 0x1.1f75bap-1, -0x1.8e5e72p-1, -0x1.86647ep+0, 0x1.1c89bp-5, 0x1.b9271ap-1, 0x1.c9df12p-1, 0x1.b25394p-3, 0x1.f48d26p-2, 0x1.3f9992p-1, 0x1.f5ee26p-1, 0x1.0b06eep-8, 0x1.076642p+1, 0x1.bc5f7cp-2, 0x1.7f82cap-1, 0x1.19e1c4p-1, -0x1.f920b2p-1, 0x1.3dcb92p-6, 0x1.cdae2ap-3, 0x1.bbc78ep-6, -0x1.aff344p+0, 0x1.b4c164p+0, -0x1.6b5d7cp-1, 0x1.8831aap+0, -0x1.e9333ap-2, -0x1.f53c6p-7, 0x1.55ca64p+0, 0x1.f1f12cp-1, -0x1.06ff7p+1, 0x1.16f3dep+0, 0x1.3490d2p-1, 0x1.0bdd7p+1, 0x1.d5b9a6p+0, -0x1.d379eep-3, 0x1.8a4a1p-3, 0x1.58c4dcp-5, 0x1.9d3cb2p+0, -0x1.9dbc42p+0, -0x1.e20beep+0, -0x1.9b00e4p-1, -0x1.027972p+1, -0x1.0d3b84p-1, 0x1.cdb344p+0, -0x1.07f8e2p+1, -0x1.8d50e4p-1, -0x1.2be092p+0, -0x1.798192p+0, -0x1.1818f6p+0, 0x1.2f0b62p-1, 0x1.47a01cp+0, -0x1.05099p-1, -0x1.88b4a4p+0, 0x1.4fb96ap-3, -0x1.9845aep-1, 0x1.98856ep+0, -0x1.88306ep+0, -0x1.31816ep-2], [-0x1.eb199cp-2, -0x1.944f68p+0, 0x1.15cafep-1, 0x1.78da74p-2, 0x1.4b06f6p-1, 0x1.f15142p-2, 0x1.5c39b6p+0, -0x1.42710ep+0, 0x1.29f1e8p-1, -0x1.8871acp-2, -0x1.316cb2p+0, 0x1.32c622p-1, -0x1.421094p-2, -0x1.376a7p-2, 0x1.3a96f8p+0, -0x1.77cfbep+0, -0x1.585dfep+0, 0x1.ef588cp-1, -0x1.55e5c6p+0, -0x1.1d2f9ep+0, 0x1.5693ecp-4, 0x1.0a3bc2p+1, 0x1.fa6ce8p+0, 0x1.7e3e16p-1, -0x1.65a134p+0, 0x1.677076p-2, -0x1.b25514p+0, -0x1.a99d88p-1, 0x1.1da256p+0, -0x1.8d48c4p+0, 